[
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "المص",
    "use_bismillah": true,
    "translations": [
      {
        "language_name": "english",
        "text": "Alif, Lam, Meem, Sad."
      },
      {
        "language_name": "indonesian",
        "text": "Alif Lam Mim Sad"
      }
    ],
    "verse_number": 1
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "كِتَابٌ أُنزِلَ إِلَيْكَ فَلَا يَكُن فِي صَدْرِكَ حَرَجٌ مِّنْهُ لِتُنذِرَ بِهِ وَذِكْرَىٰ لِلْمُؤْمِنِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Inilah) Kitab yang diturunkan kepadamu (Muhammad); maka janganlah engkau sesak dada karenanya, agar engkau memberi peringatan dengan (Kitab) itu dan menjadi pelajaran bagi orang yang beriman."
      },
      {
        "language_name": "english",
        "text": "[This is] a Book revealed to you, [O Muhammad] -  so let there not be in your breast distress therefrom -  that you may warn thereby and as a reminder to the believers."
      }
    ],
    "verse_number": 2
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "اتَّبِعُوا مَا أُنزِلَ إِلَيْكُم مِّن رَّبِّكُمْ وَلَا تَتَّبِعُوا مِن دُونِهِ أَوْلِيَاءَ ۗ قَلِيلًا مَّا تَذَكَّرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Ikutilah apa yang diturunkan kepadamu dari Tuhanmu, dan janganlah kamu ikuti selain Dia sebagai pemimpin. Sedikit sekali kamu mengambil pelajaran."
      },
      {
        "language_name": "english",
        "text": "Follow, [O mankind], what has been revealed to you from your Lord and do not follow other than Him any allies. Little do you remember."
      }
    ],
    "verse_number": 3
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَكَم مِّن قَرْيَةٍ أَهْلَكْنَاهَا فَجَاءَهَا بَأْسُنَا بَيَاتًا أَوْ هُمْ قَائِلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And how many cities have We destroyed, and Our punishment came to them at night or while they were sleeping at noon."
      },
      {
        "language_name": "indonesian",
        "text": "Betapa banyak negeri yang telah Kami binasakan, siksaan Kami datang (menimpa penduduk)nya pada malam hari, atau pada saat mereka beristirahat pada siang hari."
      }
    ],
    "verse_number": 4
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَمَا كَانَ دَعْوَاهُمْ إِذْ جَاءَهُم بَأْسُنَا إِلَّا أَن قَالُوا إِنَّا كُنَّا ظَالِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And their declaration when Our punishment came to them was only that they said, \"Indeed, we were wrongdoers!\""
      },
      {
        "language_name": "indonesian",
        "text": "Maka ketika siksaan Kami datang menimpa mereka, keluhan mereka tidak lain, hanya mengucap, “Sesungguhnya kami adalah orang-orang yang zhalim.”"
      }
    ],
    "verse_number": 5
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَلَنَسْأَلَنَّ الَّذِينَ أُرْسِلَ إِلَيْهِمْ وَلَنَسْأَلَنَّ الْمُرْسَلِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Then We will surely question those to whom [a message] was sent, and We will surely question the messengers."
      },
      {
        "language_name": "indonesian",
        "text": "Maka pasti akan Kami tanyakan kepada umat yang telah mendapat seruan (dari rasul-rasul) dan Kami akan tanyai (pula) para rasul,"
      }
    ],
    "verse_number": 6
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَلَنَقُصَّنَّ عَلَيْهِم بِعِلْمٍ ۖ وَمَا كُنَّا غَائِبِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Then We will surely relate [their deeds] to them with knowledge, and We were not [at all] absent."
      },
      {
        "language_name": "indonesian",
        "text": "dan pasti akan Kami beritakan kepada mereka dengan ilmu (Kami) dan Kami tidak jauh (dari mereka)."
      }
    ],
    "verse_number": 7
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَالْوَزْنُ يَوْمَئِذٍ الْحَقُّ ۚ فَمَن ثَقُلَتْ مَوَازِينُهُ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Timbangan pada hari itu (menjadi ukuran) kebenaran. Maka barangsiapa berat timbangan (kebaikan)nya, mereka itulah orang yang beruntung,"
      },
      {
        "language_name": "english",
        "text": "And the weighing [of deeds] that Day will be the truth. So those whose scales are heavy -  it is they who will be the successful."
      }
    ],
    "verse_number": 8
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَمَنْ خَفَّتْ مَوَازِينُهُ فَأُولَٰئِكَ الَّذِينَ خَسِرُوا أَنفُسَهُم بِمَا كَانُوا بِآيَاتِنَا يَظْلِمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "dan barangsiapa ringan timbangan (kebaikan)nya, maka mereka itulah orang yang telah merugikan dirinya sendiri, karena mereka mengingkari ayat-ayat Kami."
      },
      {
        "language_name": "english",
        "text": "And those whose scales are light -  they are the ones who will lose themselves for what injustice they were doing toward Our verses."
      }
    ],
    "verse_number": 9
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَلَقَدْ مَكَّنَّاكُمْ فِي الْأَرْضِ وَجَعَلْنَا لَكُمْ فِيهَا مَعَايِشَ ۗ قَلِيلًا مَّا تَشْكُرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We have certainly established you upon the earth and made for you therein ways of livelihood. Little are you grateful."
      },
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, Kami telah menempatkan kamu di bumi dan di sana Kami sediakan (sumber) penghidupan untukmu. (Tetapi) sedikit sekali kamu bersyukur."
      }
    ],
    "verse_number": 10
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَلَقَدْ خَلَقْنَاكُمْ ثُمَّ صَوَّرْنَاكُمْ ثُمَّ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ لَمْ يَكُن مِّنَ السَّاجِدِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We have certainly created you, [O Mankind], and given you [human] form. Then We said to the angels, \"Prostrate to Adam\"; so they prostrated, except for Iblees. He was not of those who prostrated."
      },
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, Kami telah menciptakan kamu, kemudian membentuk (tubuh)mu, kemudian Kami berfirman kepada para malaikat, “Bersujudlah kamu kepada Adam,” maka mereka pun sujud kecuali Iblis. Ia (Iblis) tidak termasuk mereka yang bersujud."
      }
    ],
    "verse_number": 11
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ مَا مَنَعَكَ أَلَّا تَسْجُدَ إِذْ أَمَرْتُكَ ۖ قَالَ أَنَا خَيْرٌ مِّنْهُ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Allah) berfirman, “Apakah yang menghalangimu (sehingga) kamu tidak bersujud (kepada Adam) ketika Aku menyuruhmu?” (Iblis) menjawab, “Aku lebih baik daripada dia. Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.”"
      },
      {
        "language_name": "english",
        "text": "[ Allah ] said, \"What prevented you from prostrating when I commanded you?\" [Satan] said, \"I am better than him. You created me from fire and created him from clay.\""
      }
    ],
    "verse_number": 12
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ فَاهْبِطْ مِنْهَا فَمَا يَكُونُ لَكَ أَن تَتَكَبَّرَ فِيهَا فَاخْرُجْ إِنَّكَ مِنَ الصَّاغِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Allah) berfirman, “Maka turunlah kamu darinya (surga); karena kamu tidak sepatutnya menyombongkan diri di dalamnya. Keluarlah! Sesungguhnya kamu termasuk makhluk yang hina.”"
      },
      {
        "language_name": "english",
        "text": "[ Allah ] said, \"Descend from Paradise, for it is not for you to be arrogant therein. So get out; indeed, you are of the debased."
      }
    ],
    "verse_number": 13
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ أَنظِرْنِي إِلَىٰ يَوْمِ يُبْعَثُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Iblis) menjawab, “Berilah aku penangguhan waktu, sampai hari mereka dibangkitkan.”"
      },
      {
        "language_name": "english",
        "text": "[Satan] said, \"Reprieve me until the Day they are resurrected.\""
      }
    ],
    "verse_number": 14
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ إِنَّكَ مِنَ الْمُنظَرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "[ Allah ] said, \"Indeed, you are of those reprieved.\""
      },
      {
        "language_name": "indonesian",
        "text": "(Allah) berfirman, “Benar, kamu termasuk yang diberi penangguhan waktu.”"
      }
    ],
    "verse_number": 15
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ فَبِمَا أَغْوَيْتَنِي لَأَقْعُدَنَّ لَهُمْ صِرَاطَكَ الْمُسْتَقِيمَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Iblis) menjawab, “Karena Engkau telah menyesatkan aku, pasti aku akan selalu menghalangi mereka dari jalan-Mu yang lurus,"
      },
      {
        "language_name": "english",
        "text": "[Satan] said, \"Because You have put me in error, I will surely sit in wait for them on Your straight path."
      }
    ],
    "verse_number": 16
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "ثُمَّ لَآتِيَنَّهُم مِّن بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ أَيْمَانِهِمْ وَعَن شَمَائِلِهِمْ ۖ وَلَا تَجِدُ أَكْثَرَهُمْ شَاكِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "kemudian pasti aku akan mendatangi mereka dari depan, dari belakang, dari kanan dan dari kiri mereka. Dan Engkau tidak akan mendapati kebanyakan mereka bersyukur.”"
      },
      {
        "language_name": "english",
        "text": "Then I will come to them from before them and from behind them and on their right and on their left, and You will not find most of them grateful [to You].\""
      }
    ],
    "verse_number": 17
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ اخْرُجْ مِنْهَا مَذْءُومًا مَّدْحُورًا ۖ لَّمَن تَبِعَكَ مِنْهُمْ لَأَمْلَأَنَّ جَهَنَّمَ مِنكُمْ أَجْمَعِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "[ Allah ] said, \"Get out of Paradise, reproached and expelled. Whoever follows you among them -  I will surely fill Hell with you, all together.\""
      },
      {
        "language_name": "indonesian",
        "text": "(Allah) berfirman, “Keluarlah kamu dari sana (surga) dalam keadaan terhina dan terusir! Sesungguhnya barangsiapa di antara mereka ada yang mengikutimu, pasti akan Aku isi neraka Jahanam dengan kamu semua.”"
      }
    ],
    "verse_number": 18
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَيَا آدَمُ اسْكُنْ أَنتَ وَزَوْجُكَ الْجَنَّةَ فَكُلَا مِنْ حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَٰذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And \"O Adam, dwell, you and your wife, in Paradise and eat from wherever you will but do not approach this tree, lest you be among the wrongdoers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan (Allah berfirman), “Wahai Adam! Tinggallah engkau bersama istrimu dalam surga dan makanlah apa saja yang kamu berdua sukai. Tetapi janganlah kamu berdua dekati pohon yang satu ini. (Apabila didekati) kamu berdua termasuk orang-orang yang zhalim.”"
      }
    ],
    "verse_number": 19
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَوَسْوَسَ لَهُمَا الشَّيْطَانُ لِيُبْدِيَ لَهُمَا مَا وُورِيَ عَنْهُمَا مِن سَوْآتِهِمَا وَقَالَ مَا نَهَاكُمَا رَبُّكُمَا عَنْ هَٰذِهِ الشَّجَرَةِ إِلَّا أَن تَكُونَا مَلَكَيْنِ أَوْ تَكُونَا مِنَ الْخَالِدِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But Satan whispered to them to make apparent to them that which was concealed from them of their private parts. He said, \"Your Lord did not forbid you this tree except that you become angels or become of the immortal.\""
      },
      {
        "language_name": "indonesian",
        "text": "Kemudian setan membisikkan pikiran jahat kepada mereka agar menampakkan aurat mereka (yang selama ini) tertutup. Dan (setan) berkata, “Tuhanmu hanya melarang kamu berdua mendekati pohon ini, agar kamu berdua tidak menjadi malaikat atau tidak menjadi orang yang kekal (dalam surga).”"
      }
    ],
    "verse_number": 20
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَقَاسَمَهُمَا إِنِّي لَكُمَا لَمِنَ النَّاصِحِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And he swore [by Allah ] to them, \"Indeed, I am to you from among the sincere advisors.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan dia (setan) bersumpah kepada keduanya, “Sesungguhnya aku ini benar-benar termasuk para penasihatmu,”"
      }
    ],
    "verse_number": 21
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَدَلَّاهُمَا بِغُرُورٍ ۚ فَلَمَّا ذَاقَا الشَّجَرَةَ بَدَتْ لَهُمَا سَوْآتُهُمَا وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِن وَرَقِ الْجَنَّةِ ۖ وَنَادَاهُمَا رَبُّهُمَا أَلَمْ أَنْهَكُمَا عَن تِلْكُمَا الشَّجَرَةِ وَأَقُل لَّكُمَا إِنَّ الشَّيْطَانَ لَكُمَا عَدُوٌّ مُّبِينٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "dia (setan) membujuk mereka dengan tipu daya. Ketika mereka mencicipi (buah) pohon itu, tampaklah oleh mereka auratnya, maka mulailah mereka menutupinya dengan daun-daun surga. Tuhan menyeru mereka, “Bukankah Aku telah melarang kamu dari pohon itu dan Aku telah mengatakan bahwa sesungguhnya setan adalah musuh yang nyata bagi kamu berdua?”"
      },
      {
        "language_name": "english",
        "text": "So he made them fall, through deception. And when they tasted of the tree, their private parts became apparent to them, and they began to fasten together over themselves from the leaves of Paradise. And their Lord called to them, \"Did I not forbid you from that tree and tell you that Satan is to you a clear enemy?\""
      }
    ],
    "verse_number": 22
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَا رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "They said, \"Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Keduanya berkata, “Ya Tuhan kami, kami telah menzhalimi diri kami sendiri. Jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya kami termasuk orang-orang yang rugi.”"
      }
    ],
    "verse_number": 23
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ اهْبِطُوا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۖ وَلَكُمْ فِي الْأَرْضِ مُسْتَقَرٌّ وَمَتَاعٌ إِلَىٰ حِينٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Allah) berfirman, “Turunlah kamu! Kamu akan saling bermusuhan satu sama lain. Bumi adalah tempat kediaman dan kesenanganmu sampai waktu yang telah ditentukan.”"
      },
      {
        "language_name": "english",
        "text": "[ Allah ] said, \"Descend, being to one another enemies. And for you on the earth is a place of settlement and enjoyment for a time.\""
      }
    ],
    "verse_number": 24
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ فِيهَا تَحْيَوْنَ وَفِيهَا تَمُوتُونَ وَمِنْهَا تُخْرَجُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Allah) berfirman, “Di sana kamu hidup, di sana kamu mati, dan dari sana (pula) kamu akan dibangkitkan.”"
      },
      {
        "language_name": "english",
        "text": "He said, \"Therein you will live, and therein you will die, and from it you will be brought forth.\""
      }
    ],
    "verse_number": 25
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "يَا بَنِي آدَمَ قَدْ أَنزَلْنَا عَلَيْكُمْ لِبَاسًا يُوَارِي سَوْآتِكُمْ وَرِيشًا ۖ وَلِبَاسُ التَّقْوَىٰ ذَٰلِكَ خَيْرٌ ۚ ذَٰلِكَ مِنْ آيَاتِ اللَّهِ لَعَلَّهُمْ يَذَّكَّرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "O children of Adam, We have bestowed upon you clothing to conceal your private parts and as adornment. But the clothing of righteousness -  that is best. That is from the signs of Allah that perhaps they will remember."
      },
      {
        "language_name": "indonesian",
        "text": "Wahai anak cucu Adam! Sesungguhnya Kami telah menyediakan pakaian untuk menutupi auratmu dan untuk perhiasan bagimu. Tetapi pakaian takwa, itulah yang lebih baik. Demikianlah sebagian tanda-tanda kekuasaan Allah, mudah-mudahan mereka ingat."
      }
    ],
    "verse_number": 26
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "يَا بَنِي آدَمَ لَا يَفْتِنَنَّكُمُ الشَّيْطَانُ كَمَا أَخْرَجَ أَبَوَيْكُم مِّنَ الْجَنَّةِ يَنزِعُ عَنْهُمَا لِبَاسَهُمَا لِيُرِيَهُمَا سَوْآتِهِمَا ۗ إِنَّهُ يَرَاكُمْ هُوَ وَقَبِيلُهُ مِنْ حَيْثُ لَا تَرَوْنَهُمْ ۗ إِنَّا جَعَلْنَا الشَّيَاطِينَ أَوْلِيَاءَ لِلَّذِينَ لَا يُؤْمِنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "O children of Adam, let not Satan tempt you as he removed your parents from Paradise, stripping them of their clothing to show them their private parts. Indeed, he sees you, he and his tribe, from where you do not see them. Indeed, We have made the devils allies to those who do not believe."
      },
      {
        "language_name": "indonesian",
        "text": "Wahai anak cucu Adam! Janganlah sampai kamu tertipu oleh setan sebagaimana halnya dia (setan) telah mengeluarkan ibu bapakmu dari surga, dengan menanggalkan pakaian keduanya untuk memperlihatkan aurat keduanya. Sesungguhnya dia dan pengikutnya dapat melihat kamu dari suatu tempat yang kamu tidak bisa melihat mereka. Sesungguhnya Kami telah menjadikan setan-setan itu pemimpin bagi orang-orang yang tidak beriman."
      }
    ],
    "verse_number": 27
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَإِذَا فَعَلُوا فَاحِشَةً قَالُوا وَجَدْنَا عَلَيْهَا آبَاءَنَا وَاللَّهُ أَمَرَنَا بِهَا ۗ قُلْ إِنَّ اللَّهَ لَا يَأْمُرُ بِالْفَحْشَاءِ ۖ أَتَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan apabila mereka melakukan perbuatan keji, mereka berkata, “Kami mendapati nenek moyang kami melakukan yang demikian, dan Allah menyuruh kami mengerjakannya.” Katakanlah, “Sesungguhnya Allah tidak pernah menyuruh berbuat keji. Mengapa kamu membicarakan tentang Allah apa yang tidak kamu ketahui?”"
      },
      {
        "language_name": "english",
        "text": "And when they commit an immorality, they say, \"We found our fathers doing it, and Allah has ordered us to do it.\" Say, \"Indeed, Allah does not order immorality. Do you say about Allah that which you do not know?\""
      }
    ],
    "verse_number": 28
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قُلْ أَمَرَ رَبِّي بِالْقِسْطِ ۖ وَأَقِيمُوا وُجُوهَكُمْ عِندَ كُلِّ مَسْجِدٍ وَادْعُوهُ مُخْلِصِينَ لَهُ الدِّينَ ۚ كَمَا بَدَأَكُمْ تَعُودُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Katakanlah, “Tuhanku menyuruhku berlaku adil. Hadapkanlah wajahmu (kepada Allah) pada setiap shalat, dan sembahlah Dia dengan mengikhlaskan ibadah semata-mata hanya kepada-Nya. Kamu akan dikembalikan kepada-Nya sebagaimana kamu diciptakan semula."
      },
      {
        "language_name": "english",
        "text": "Say, [O Muhammad], \"My Lord has ordered justice and that you maintain yourselves [in worship of Him] at every place [or time] of prostration, and invoke Him, sincere to Him in religion.\" Just as He originated you, you will return [to life] -"
      }
    ],
    "verse_number": 29
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَرِيقًا هَدَىٰ وَفَرِيقًا حَقَّ عَلَيْهِمُ الضَّلَالَةُ ۗ إِنَّهُمُ اتَّخَذُوا الشَّيَاطِينَ أَوْلِيَاءَ مِن دُونِ اللَّهِ وَيَحْسَبُونَ أَنَّهُم مُّهْتَدُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "A group [of you] He guided, and a group deserved [to be in] error. Indeed, they had taken the devils as allies instead of Allah while they thought that they were guided."
      },
      {
        "language_name": "indonesian",
        "text": "Sebagian diberi-Nya petunjuk dan sebagian lagi sepantasnya menjadi sesat. Mereka menjadikan setan-setan sebagai pelindung selain Allah. Mereka mengira bahwa mereka mendapat petunjuk."
      }
    ],
    "verse_number": 30
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِندَ كُلِّ مَسْجِدٍ وَكُلُوا وَاشْرَبُوا وَلَا تُسْرِفُوا ۚ إِنَّهُ لَا يُحِبُّ الْمُسْرِفِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "O children of Adam, take your adornment at every masjid, and eat and drink, but be not excessive. Indeed, He likes not those who commit excess."
      },
      {
        "language_name": "indonesian",
        "text": "Wahai anak cucu Adam! Pakailah pakaianmu yang bagus pada setiap (memasuki) masjid, makan dan minumlah, tetapi jangan berlebihan. Sungguh, Allah tidak menyukai orang yang berlebih-lebihan."
      }
    ],
    "verse_number": 31
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ وَالطَّيِّبَاتِ مِنَ الرِّزْقِ ۚ قُلْ هِيَ لِلَّذِينَ آمَنُوا فِي الْحَيَاةِ الدُّنْيَا خَالِصَةً يَوْمَ الْقِيَامَةِ ۗ كَذَٰلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, \"Who has forbidden the adornment of Allah which He has produced for His servants and the good [lawful] things of provision?\" Say, \"They are for those who believe during the worldly life [but] exclusively for them on the Day of Resurrection.\" Thus do We detail the verses for a people who know."
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah (Muhammad), “Siapakah yang mengharamkan perhiasan dari Allah yang telah disediakan untuk hamba-hamba-Nya dan rezeki yang baik-baik? Katakanlah, “Semua itu untuk orang-orang yang beriman dalam kehidupan dunia, dan khusus (untuk mereka saja) pada hari Kiamat.” Demikianlah Kami menjelaskan ayat-ayat itu untuk orang-orang yang mengetahui."
      }
    ],
    "verse_number": 32
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قُلْ إِنَّمَا حَرَّمَ رَبِّيَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَالْإِثْمَ وَالْبَغْيَ بِغَيْرِ الْحَقِّ وَأَن تُشْرِكُوا بِاللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا وَأَن تَقُولُوا عَلَى اللَّهِ مَا لَا تَعْلَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Katakanlah (Muhammad), “Tuhanku hanya mengharamkan segala perbuatan keji yang terlihat dan yang tersembunyi, perbuatan dosa, perbuatan zhalim tanpa alasan yang benar, dan (mengharamkan) kamu mempersekutukan Allah dengan sesuatu, sedangkan Dia tidak menurunkan alasan untuk itu, dan (mengharamkan) kamu membicarakan tentang Allah apa yang tidak kamu ketahui.”"
      },
      {
        "language_name": "english",
        "text": "Say, \"My Lord has only forbidden immoralities -  what is apparent of them and what is concealed -  and sin, and oppression without right, and that you associate with Allah that for which He has not sent down authority, and that you say about Allah that which you do not know.\""
      }
    ],
    "verse_number": 33
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَلِكُلِّ أُمَّةٍ أَجَلٌ ۖ فَإِذَا جَاءَ أَجَلُهُمْ لَا يَسْتَأْخِرُونَ سَاعَةً ۖ وَلَا يَسْتَقْدِمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan setiap umat mempunyai ajal (batas waktu). Apabila ajalnya tiba, mereka tidak dapat meminta penundaan atau percepatan sesaat pun."
      },
      {
        "language_name": "english",
        "text": "And for every nation is a [specified] term. So when their time has come, they will not remain behind an hour, nor will they precede [it]."
      }
    ],
    "verse_number": 34
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "يَا بَنِي آدَمَ إِمَّا يَأْتِيَنَّكُمْ رُسُلٌ مِّنكُمْ يَقُصُّونَ عَلَيْكُمْ آيَاتِي ۙ فَمَنِ اتَّقَىٰ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "O children of Adam, if there come to you messengers from among you relating to you My verses, then whoever fears Allah and reforms -  there will be no fear concerning them, nor will they grieve."
      },
      {
        "language_name": "indonesian",
        "text": "Wahai anak cucu Adam! Jika datang kepadamu rasul-rasul dari kalanganmu sendiri, yang menceritakan ayat-ayat-Ku kepadamu, maka barangsiapa bertakwa dan mengadakan perbaikan, maka tidak ada rasa takut pada mereka, dan mereka tidak bersedih hati."
      }
    ],
    "verse_number": 35
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا وَاسْتَكْبَرُوا عَنْهَا أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But the ones who deny Our verses and are arrogant toward them -  those are the companions of the Fire; they will abide therein eternally."
      },
      {
        "language_name": "indonesian",
        "text": "Tetapi orang-orang yang mendustakan ayat-ayat Kami dan menyombongkan diri terhadapnya, mereka itulah penghuni neraka; mereka kekal di dalamnya."
      }
    ],
    "verse_number": 36
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِآيَاتِهِ ۚ أُولَٰئِكَ يَنَالُهُمْ نَصِيبُهُم مِّنَ الْكِتَابِ ۖ حَتَّىٰ إِذَا جَاءَتْهُمْ رُسُلُنَا يَتَوَفَّوْنَهُمْ قَالُوا أَيْنَ مَا كُنتُمْ تَدْعُونَ مِن دُونِ اللَّهِ ۖ قَالُوا ضَلُّوا عَنَّا وَشَهِدُوا عَلَىٰ أَنفُسِهِمْ أَنَّهُمْ كَانُوا كَافِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And who is more unjust than one who invents about Allah a lie or denies His verses? Those will attain their portion of the decree until when Our messengers come to them to take them in death, they will say, \"Where are those you used to invoke besides Allah ?\" They will say, \"They have departed from us,\" and will bear witness against themselves that they were disbelievers."
      },
      {
        "language_name": "indonesian",
        "text": "Siapakah yang lebih zhalim daripada orang yang mengada-adakan kebohongan terhadap Allah atau yang mendustakan ayat-ayat-Nya? Mereka itu akan memperoleh bagian yang telah ditentukan dalam Kitab sampai datang para utusan (malaikat) Kami kepada mereka untuk mencabut nyawanya. Mereka (para malaikat) berkata, “Manakah sembahan yang biasa kamu sembah selain Allah?” Mereka (orang musyrik) menjawab, “Semuanya telah lenyap dari kami.” Dan mereka memberikan kesaksian terhadap diri mereka sendiri bahwa mereka adalah orang-orang kafir."
      }
    ],
    "verse_number": 37
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ ادْخُلُوا فِي أُمَمٍ قَدْ خَلَتْ مِن قَبْلِكُم مِّنَ الْجِنِّ وَالْإِنسِ فِي النَّارِ ۖ كُلَّمَا دَخَلَتْ أُمَّةٌ لَّعَنَتْ أُخْتَهَا ۖ حَتَّىٰ إِذَا ادَّارَكُوا فِيهَا جَمِيعًا قَالَتْ أُخْرَاهُمْ لِأُولَاهُمْ رَبَّنَا هَٰؤُلَاءِ أَضَلُّونَا فَآتِهِمْ عَذَابًا ضِعْفًا مِّنَ النَّارِ ۖ قَالَ لِكُلٍّ ضِعْفٌ وَلَٰكِن لَّا تَعْلَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Allah berfirman, “Masuklah kamu ke dalam api neraka bersama golongan jin dan manusia yang telah lebih dahulu dari kamu. Setiap kali suatu umat masuk, dia melaknat saudaranya, sehingga apabila mereka telah masuk semuanya, berkatalah orang yang (masuk) belakangan (kepada) orang yang (masuk) terlebih dahulu, “Ya Tuhan kami, mereka telah menyesatkan kami. Datangkanlah siksaan api neraka yang berlipat ganda kepada mereka” Allah berfirman, “Masing-masing mendapatkan (siksaan) yang berlipat ganda, tapi kamu tidak mengetahui.”"
      },
      {
        "language_name": "english",
        "text": "[ Allah ] will say, \"Enter among nations which had passed on before you of jinn and mankind into the Fire.\" Every time a nation enters, it will curse its sister until, when they have all overtaken one another therein, the last of them will say about the first of them \"Our Lord, these had misled us, so give them a double punishment of the Fire. He will say, \"For each is double, but you do not know.\""
      }
    ],
    "verse_number": 38
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَقَالَتْ أُولَاهُمْ لِأُخْرَاهُمْ فَمَا كَانَ لَكُمْ عَلَيْنَا مِن فَضْلٍ فَذُوقُوا الْعَذَابَ بِمَا كُنتُمْ تَكْسِبُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan orang yang (masuk) terlebih dahulu berkata kepada yang (masuk) belakangan, “Kamu tidak mempunyai kelebihan sedikit pun atas kami. Maka rasakanlah azab itu karena perbuatan yang telah kamu lakukan.”"
      },
      {
        "language_name": "english",
        "text": "And the first of them will say to the last of them, \"Then you had not any favor over us, so taste the punishment for what you used to earn.\""
      }
    ],
    "verse_number": 39
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "إِنَّ الَّذِينَ كَذَّبُوا بِآيَاتِنَا وَاسْتَكْبَرُوا عَنْهَا لَا تُفَتَّحُ لَهُمْ أَبْوَابُ السَّمَاءِ وَلَا يَدْخُلُونَ الْجَنَّةَ حَتَّىٰ يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ۚ وَكَذَٰلِكَ نَجْزِي الْمُجْرِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Indeed, those who deny Our verses and are arrogant toward them -  the gates of Heaven will not be opened for them, nor will they enter Paradise until a camel enters into the eye of a needle. And thus do We recompense the criminals."
      },
      {
        "language_name": "indonesian",
        "text": "Sesungguhnya orang-orang yang mendustakan ayat-ayat Kami dan menyombongkan diri terhadapnya, tidak akan dibukakan pintu-pintu langit bagi mereka, dan mereka tidak akan masuk surga, sebelum unta masuk ke dalam lubang jarum. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat jahat."
      }
    ],
    "verse_number": 40
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "لَهُم مِّن جَهَنَّمَ مِهَادٌ وَمِن فَوْقِهِمْ غَوَاشٍ ۚ وَكَذَٰلِكَ نَجْزِي الظَّالِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "They will have from Hell a bed and over them coverings [of fire]. And thus do We recompense the wrongdoers."
      },
      {
        "language_name": "indonesian",
        "text": "Bagi mereka tikar tidur dari api neraka dan di atas mereka ada selimut (api neraka). Demikianlah Kami memberi balasan kepada orang-orang yang zhalim."
      }
    ],
    "verse_number": 41
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَا أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ ۖ هُمْ فِيهَا خَالِدُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But those who believed and did righteous deeds -  We charge no soul except [within] its capacity. Those are the companions of Paradise; they will abide therein eternally."
      },
      {
        "language_name": "indonesian",
        "text": "Dan orang-orang yang beriman serta mengerjakan kebajikan, Kami tidak akan membebani seseorang melainkan menurut kesanggupannya. Mereka itulah penghuni surga; mereka kekal di dalamnya,"
      }
    ],
    "verse_number": 42
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَنَزَعْنَا مَا فِي صُدُورِهِم مِّنْ غِلٍّ تَجْرِي مِن تَحْتِهِمُ الْأَنْهَارُ ۖ وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي هَدَانَا لِهَٰذَا وَمَا كُنَّا لِنَهْتَدِيَ لَوْلَا أَنْ هَدَانَا اللَّهُ ۖ لَقَدْ جَاءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ ۖ وَنُودُوا أَن تِلْكُمُ الْجَنَّةُ أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We will have removed whatever is within their breasts of resentment, [while] flowing beneath them are rivers. And they will say, \"Praise to Allah, who has guided us to this; and we would never have been guided if Allah had not guided us. Certainly the messengers of our Lord had come with the truth.\" And they will be called, \"This is Paradise, which you have been made to inherit for what you used to do.\""
      },
      {
        "language_name": "indonesian",
        "text": "dan Kami mencabut rasa dendam dari dalam dada mereka, di bawahnya mengalir sungai-sungai. Mereka berkata, “Segala puji bagi Allah yang telah menunjukkan kami ke (surga) ini. Kami tidak akan mendapat petunjuk sekiranya Allah tidak menunjukkan kami. Sesungguhnya rasul-rasul Tuhan kami telah datang membawa kebenaran.” Diserukan kepada mereka, “Itulah surga yang telah diwariskan kepadamu, karena apa yang telah kamu kerjakan.”"
      }
    ],
    "verse_number": 43
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَنَادَىٰ أَصْحَابُ الْجَنَّةِ أَصْحَابَ النَّارِ أَن قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا فَهَلْ وَجَدتُّم مَّا وَعَدَ رَبُّكُمْ حَقًّا ۖ قَالُوا نَعَمْ ۚ فَأَذَّنَ مُؤَذِّنٌ بَيْنَهُمْ أَن لَّعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan para penghuni surga menyeru penghuni-penghuni neraka, “Sungguh, kami telah memperoleh apa yang dijanjikan Tuhan kepada kami itu benar. Apakah kamu telah memperoleh apa yang dijanjikan Tuhan kepadamu itu benar?” Mereka menjawab, “Benar.” Kemudian penyeru (malaikat) mengumumkan di antara mereka, “Laknat Allah bagi orang-orang zhalim,"
      },
      {
        "language_name": "english",
        "text": "And the companions of Paradise will call out to the companions of the Fire, \"We have already found what our Lord promised us to be true. Have you found what your Lord promised to be true?\" They will say, \"Yes.\" Then an announcer will announce among them, \"The curse of Allah shall be upon the wrongdoers.\""
      }
    ],
    "verse_number": 44
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "الَّذِينَ يَصُدُّونَ عَن سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا وَهُم بِالْآخِرَةِ كَافِرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(yaitu) orang-orang yang menghalang-halangi (orang lain) dari jalan Allah dan ingin membelokkannya. Mereka itulah yang mengingkari kehidupan akhirat.”"
      },
      {
        "language_name": "english",
        "text": "Who averted [people] from the way of Allah and sought to make it [seem] deviant while they were, concerning the Hereafter, disbelievers."
      }
    ],
    "verse_number": 45
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَبَيْنَهُمَا حِجَابٌ ۚ وَعَلَى الْأَعْرَافِ رِجَالٌ يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ ۚ وَنَادَوْا أَصْحَابَ الْجَنَّةِ أَن سَلَامٌ عَلَيْكُمْ ۚ لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan di antara keduanya (penghuni surga dan neraka) ada tabir dan di atas A‘raf (tempat yang tertinggi) ada orang-orang yang saling mengenal, masing-masing dengan tanda-tandanya. Mereka menyeru penghuni surga, “Salamun ‘alaikum” (salam sejahtera bagimu). Mereka belum dapat masuk, tetapi mereka ingin segera (masuk)."
      },
      {
        "language_name": "english",
        "text": "And between them will be a partition, and on [its] elevations are men who recognize all by their mark. And they call out to the companions of Paradise, \"Peace be upon you.\" They have not [yet] entered it, but they long intensely."
      }
    ],
    "verse_number": 46
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَإِذَا صُرِفَتْ أَبْصَارُهُمْ تِلْقَاءَ أَصْحَابِ النَّارِ قَالُوا رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And when their eyes are turned toward the companions of the Fire, they say, \"Our Lord, do not place us with the wrongdoing people.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan apabila pandangan mereka dialihkan ke arah penghuni neraka, mereka berkata, “Ya Tuhan kami, janganlah Engkau tempatkan kami bersama-sama orang-orang zhalim itu.”"
      }
    ],
    "verse_number": 47
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَنَادَىٰ أَصْحَابُ الْأَعْرَافِ رِجَالًا يَعْرِفُونَهُم بِسِيمَاهُمْ قَالُوا مَا أَغْنَىٰ عَنكُمْ جَمْعُكُمْ وَمَا كُنتُمْ تَسْتَكْبِرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan orang-orang di atas A‘raf (tempat yang tertinggi) menyeru orang-orang yang mereka kenal dengan tanda-tandanya sambil berkata, “Harta yang kamu kumpulkan dan apa yang kamu sombongkan, (ternyata) tidak ada manfaatnya buat kamu."
      },
      {
        "language_name": "english",
        "text": "And the companions of the Elevations will call to men [within Hell] whom they recognize by their mark, saying, \"Of no avail to you was your gathering and [the fact] that you were arrogant.\""
      }
    ],
    "verse_number": 48
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "أَهَٰؤُلَاءِ الَّذِينَ أَقْسَمْتُمْ لَا يَنَالُهُمُ اللَّهُ بِرَحْمَةٍ ۚ ادْخُلُوا الْجَنَّةَ لَا خَوْفٌ عَلَيْكُمْ وَلَا أَنتُمْ تَحْزَنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "[ Allah will say], \"Are these the ones whom you [inhabitants of Hell] swore that Allah would never offer them mercy? Enter Paradise, [O People of the Elevations]. No fear will there be concerning you, nor will you grieve.\""
      },
      {
        "language_name": "indonesian",
        "text": "Itukah orang-orang yang kamu telah bersumpah, bahwa mereka tidak akan mendapat rahmat Allah?” (Allah berfirman), “Masuklah kamu ke dalam surga! Tidak ada rasa takut padamu dan kamu tidak pula akan bersedih hati.”"
      }
    ],
    "verse_number": 49
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَنَادَىٰ أَصْحَابُ النَّارِ أَصْحَابَ الْجَنَّةِ أَنْ أَفِيضُوا عَلَيْنَا مِنَ الْمَاءِ أَوْ مِمَّا رَزَقَكُمُ اللَّهُ ۚ قَالُوا إِنَّ اللَّهَ حَرَّمَهُمَا عَلَى الْكَافِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And the companions of the Fire will call to the companions of Paradise, \"Pour upon us some water or from whatever Allah has provided you.\" They will say, \"Indeed, Allah has forbidden them both to the disbelievers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Para penghuni neraka menyeru para penghuni surga, “Tuangkanlah (sedikit) air kepada kami atau rezeki apa saja yang telah dikaruniakan Allah kepadamu.” Mereka menjawab, “Sungguh, Allah telah mengharamkan keduanya bagi orang-orang kafir,”"
      }
    ],
    "verse_number": 50
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "الَّذِينَ اتَّخَذُوا دِينَهُمْ لَهْوًا وَلَعِبًا وَغَرَّتْهُمُ الْحَيَاةُ الدُّنْيَا ۚ فَالْيَوْمَ نَنسَاهُمْ كَمَا نَسُوا لِقَاءَ يَوْمِهِمْ هَٰذَا وَمَا كَانُوا بِآيَاتِنَا يَجْحَدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(yaitu) orang-orang yang menjadikan agamanya sebagai permainan dan senda-gurau, dan mereka telah tertipu oleh kehidupan dunia. Maka pada hari ini (Kiamat), Kami melupakan mereka sebagaimana mereka dahulu melupakan pertemuan hari ini, dan karena mereka mengingkari ayat-ayat Kami."
      },
      {
        "language_name": "english",
        "text": "Who took their religion as distraction and amusement and whom the worldly life deluded.\" So today We will forget them just as they forgot the meeting of this Day of theirs and for having rejected Our verses."
      }
    ],
    "verse_number": 51
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَلَقَدْ جِئْنَاهُم بِكِتَابٍ فَصَّلْنَاهُ عَلَىٰ عِلْمٍ هُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We had certainly brought them a Book which We detailed by knowledge - as guidance and mercy to a people who believe."
      },
      {
        "language_name": "indonesian",
        "text": "Sungguh, Kami telah mendatangkan Kitab (Al-Qur\u0027an) kepada mereka, yang Kami jelaskan atas dasar pengetahuan, sebagai petunjuk dan rahmat bagi orang-orang yang beriman."
      }
    ],
    "verse_number": 52
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "هَلْ يَنظُرُونَ إِلَّا تَأْوِيلَهُ ۚ يَوْمَ يَأْتِي تَأْوِيلُهُ يَقُولُ الَّذِينَ نَسُوهُ مِن قَبْلُ قَدْ جَاءَتْ رُسُلُ رَبِّنَا بِالْحَقِّ فَهَل لَّنَا مِن شُفَعَاءَ فَيَشْفَعُوا لَنَا أَوْ نُرَدُّ فَنَعْمَلَ غَيْرَ الَّذِي كُنَّا نَعْمَلُ ۚ قَدْ خَسِرُوا أَنفُسَهُمْ وَضَلَّ عَنْهُم مَّا كَانُوا يَفْتَرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Do they await except its result? The Day its result comes those who had ignored it before will say, \"The messengers of our Lord had come with the truth, so are there [now] any intercessors to intercede for us or could we be sent back to do other than we used to do?\" They will have lost themselves, and lost from them is what they used to invent."
      },
      {
        "language_name": "indonesian",
        "text": "Tidakkah mereka hanya menanti-nanti bukti kebenaran (Al-Qur\u0027an) itu. Pada hari bukti kebenaran itu tiba, orang-orang yang sebelum itu mengabaikannya berkata, “Sungguh, rasul-rasul Tuhan kami telah datang membawa kebenaran. Maka adakah pemberi syafaat bagi kami yang akan memberikan pertolongan kepada kami atau agar kami dikembalikan (ke dunia) sehingga kami akan beramal tidak seperti perbuatan yang pernah kami lakukan dahulu?” Mereka sebenarnya telah merugikan dirinya sendiri dan apa yang mereka ada-adakan dahulu telah hilang lenyap dari mereka."
      }
    ],
    "verse_number": 53
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ يُغْشِي اللَّيْلَ النَّهَارَ يَطْلُبُهُ حَثِيثًا وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ ۗ أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ ۗ تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sungguh, Tuhanmu (adalah) Allah yang menciptakan langit dan bumi dalam enam masa, lalu Dia bersemayam di atas ‘Arsy. Dia menutupkan malam kepada siang yang mengikutinya dengan cepat. (Dia ciptakan) matahari, bulan dan bintang-bintang tunduk kepada perintah-Nya. Ingatlah! Segala penciptaan dan urusan menjadi hak-Nya. Mahasuci Allah, Tuhan seluruh alam."
      },
      {
        "language_name": "english",
        "text": "Indeed, your Lord is Allah, who created the heavens and earth in six days and then established Himself above the Throne. He covers the night with the day, [another night] chasing it rapidly; and [He created] the sun, the moon, and the stars, subjected by His command. Unquestionably, His is the creation and the command; blessed is Allah, Lord of the worlds."
      }
    ],
    "verse_number": 54
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "ادْعُوا رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً ۚ إِنَّهُ لَا يُحِبُّ الْمُعْتَدِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Berdoalah kepada Tuhanmu dengan rendah hati dan suara yang lembut. Sungguh, Dia tidak menyukai orang-orang yang melampaui batas."
      },
      {
        "language_name": "english",
        "text": "Call upon your Lord in humility and privately; indeed, He does not like transgressors."
      }
    ],
    "verse_number": 55
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَلَا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلَاحِهَا وَادْعُوهُ خَوْفًا وَطَمَعًا ۚ إِنَّ رَحْمَتَ اللَّهِ قَرِيبٌ مِّنَ الْمُحْسِنِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And cause not corruption upon the earth after its reformation. And invoke Him in fear and aspiration. Indeed, the mercy of Allah is near to the doers of good."
      },
      {
        "language_name": "indonesian",
        "text": "Dan janganlah kamu berbuat kerusakan di bumi setelah (diciptakan) dengan baik. Berdoalah kepada-Nya dengan rasa takut dan penuh harap. Sesungguhnya rahmat Allah sangat dekat kepada orang yang berbuat kebaikan."
      }
    ],
    "verse_number": 56
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَهُوَ الَّذِي يُرْسِلُ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ ۖ حَتَّىٰ إِذَا أَقَلَّتْ سَحَابًا ثِقَالًا سُقْنَاهُ لِبَلَدٍ مَّيِّتٍ فَأَنزَلْنَا بِهِ الْمَاءَ فَأَخْرَجْنَا بِهِ مِن كُلِّ الثَّمَرَاتِ ۚ كَذَٰلِكَ نُخْرِجُ الْمَوْتَىٰ لَعَلَّكُمْ تَذَكَّرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And it is He who sends the winds as good tidings before His mercy until, when they have carried heavy rainclouds, We drive them to a dead land and We send down rain therein and bring forth thereby [some] of all the fruits. Thus will We bring forth the dead; perhaps you may be reminded."
      },
      {
        "language_name": "indonesian",
        "text": "Dialah yang meniupkan angin sebagai pembawa kabar gembira, mendahului kedatangan rahmat-Nya (hujan), sehingga apabila angin itu membawa awan mendung, Kami halau ke suatu daerah yang tandus, lalu Kami turunkan hujan di daerah itu. Kemudian Kami tumbuhkan dengan hujan itu berbagai macam buah-buahan. Seperti itulah Kami membangkitkan orang yang telah mati, mudah-mudahan kamu mengambil pelajaran."
      }
    ],
    "verse_number": 57
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهُ بِإِذْنِ رَبِّهِ ۖ وَالَّذِي خَبُثَ لَا يَخْرُجُ إِلَّا نَكِدًا ۚ كَذَٰلِكَ نُصَرِّفُ الْآيَاتِ لِقَوْمٍ يَشْكُرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan tanah yang baik, tanaman-tanamannya tumbuh subur dengan izin Tuhan; dan tanah yang buruk, tanaman-tanamannya yang tumbuh merana. Demikianlah Kami menjelaskan berulang-ulang tanda-tanda (kebesaran Kami) bagi orang-orang yang bersyukur."
      },
      {
        "language_name": "english",
        "text": "And the good land - its vegetation emerges by permission of its Lord; but that which is bad - nothing emerges except sparsely, with difficulty. Thus do We diversify the signs for a people who are grateful."
      }
    ],
    "verse_number": 58
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "لَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ",
    "translations": [
      {
        "language_name": "english",
        "text": "We had certainly sent Noah to his people, and he said, \"O my people, worship Allah ; you have no deity other than Him. Indeed, I fear for you the punishment of a tremendous Day."
      },
      {
        "language_name": "indonesian",
        "text": "Sungguh, Kami benar-benar telah mengutus Nuh kepada kaumnya, lalu dia berkata, “Wahai kaumku! Sembahlah Allah! Tidak ada tuhan (sembahan) bagimu selain Dia. Sesungguhnya aku takut kamu akan ditimpa azab pada hari yang dahsyat (kiamat)."
      }
    ],
    "verse_number": 59
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ الْمَلَأُ مِن قَوْمِهِ إِنَّا لَنَرَاكَ فِي ضَلَالٍ مُّبِينٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Pemuka-pemuka kaumnya berkata, “Sesungguhnya kami memandang kamu benar-benar berada dalam kesesatan yang nyata.”"
      },
      {
        "language_name": "english",
        "text": "Said the eminent among his people, \"Indeed, we see you in clear error.\""
      }
    ],
    "verse_number": 60
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ يَا قَوْمِ لَيْسَ بِي ضَلَالَةٌ وَلَٰكِنِّي رَسُولٌ مِّن رَّبِّ الْعَالَمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dia (Nuh) menjawab, “Wahai kaumku! Aku tidak sesat; tetapi aku ini seorang Rasul dari Tuhan seluruh alam."
      },
      {
        "language_name": "english",
        "text": "[Noah] said, \"O my people, there is not error in me, but I am a messenger from the Lord of the worlds.\""
      }
    ],
    "verse_number": 61
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "أُبَلِّغُكُمْ رِسَالَاتِ رَبِّي وَأَنصَحُ لَكُمْ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "I convey to you the messages of my Lord and advise you; and I know from Allah what you do not know."
      },
      {
        "language_name": "indonesian",
        "text": "Aku menyampaikan kepadamu amanat Tuhanku, memberi nasihat kepadamu, dan aku mengetahui dari Allah apa yang tidak kamu ketahui.”"
      }
    ],
    "verse_number": 62
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "أَوَعَجِبْتُمْ أَن جَاءَكُمْ ذِكْرٌ مِّن رَّبِّكُمْ عَلَىٰ رَجُلٍ مِّنكُمْ لِيُنذِرَكُمْ وَلِتَتَّقُوا وَلَعَلَّكُمْ تُرْحَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan herankah kamu bahwa ada peringatan yang datang dari Tuhanmu melalui seorang laki-laki dari kalanganmu sendiri, untuk memberi peringatan kepadamu dan agar kamu bertakwa, sehingga kamu mendapat rahmat?"
      },
      {
        "language_name": "english",
        "text": "Then do you wonder that there has come to you a reminder from your Lord through a man from among you, that he may warn you and that you may fear Allah so you might receive mercy.\""
      }
    ],
    "verse_number": 63
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَكَذَّبُوهُ فَأَنجَيْنَاهُ وَالَّذِينَ مَعَهُ فِي الْفُلْكِ وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۚ إِنَّهُمْ كَانُوا قَوْمًا عَمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka mereka mendustakannya (Nuh). Lalu Kami selamatkan dia dan orang-orang yang bersamanya di dalam kapal. Kami tenggelamkan orang-orang yang mendustakan ayat-ayat Kami. Sesungguhnya mereka adalah kaum yang buta (mata hatinya)."
      },
      {
        "language_name": "english",
        "text": "But they denied him, so We saved him and those who were with him in the ship. And We drowned those who denied Our signs. Indeed, they were a blind people."
      }
    ],
    "verse_number": 64
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۚ أَفَلَا تَتَّقُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan kepada kaum ‘Ad (Kami utus) Hud, saudara mereka. Dia berkata, “Wahai kaumku! Sembahlah Allah! Tidak ada tuhan (sembahan) bagimu selain Dia. Maka mengapa kamu tidak bertakwa?”"
      },
      {
        "language_name": "english",
        "text": "And to the \u0027Aad [We sent] their brother Hud. He said, \"O my people, worship Allah ; you have no deity other than Him. Then will you not fear Him?\""
      }
    ],
    "verse_number": 65
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِن قَوْمِهِ إِنَّا لَنَرَاكَ فِي سَفَاهَةٍ وَإِنَّا لَنَظُنُّكَ مِنَ الْكَاذِبِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Said the eminent ones who disbelieved among his people, \"Indeed, we see you in foolishness, and indeed, we think you are of the liars.\""
      },
      {
        "language_name": "indonesian",
        "text": "Pemuka-pemuka orang-orang yang kafir dari kaumnya berkata, “Sesungguhnya kami memandang kamu benar-benar kurang waras dan kami kira kamu termasuk orang-orang yang berdusta.”"
      }
    ],
    "verse_number": 66
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ يَا قَوْمِ لَيْسَ بِي سَفَاهَةٌ وَلَٰكِنِّي رَسُولٌ مِّن رَّبِّ الْعَالَمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "[Hud] said, \"O my people, there is not foolishness in me, but I am a messenger from the Lord of the worlds.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dia (Hud) menjawab, “Wahai kaumku! Bukan aku kurang waras, tetapi aku ini adalah Rasul dari Tuhan seluruh alam."
      }
    ],
    "verse_number": 67
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "أُبَلِّغُكُمْ رِسَالَاتِ رَبِّي وَأَنَا لَكُمْ نَاصِحٌ أَمِينٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "I convey to you the messages of my Lord, and I am to you a trustworthy adviser."
      },
      {
        "language_name": "indonesian",
        "text": "Aku menyampaikan kepadamu amanat Tuhanku dan pemberi nasihat yang terpercaya kepada kamu."
      }
    ],
    "verse_number": 68
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "أَوَعَجِبْتُمْ أَن جَاءَكُمْ ذِكْرٌ مِّن رَّبِّكُمْ عَلَىٰ رَجُلٍ مِّنكُمْ لِيُنذِرَكُمْ ۚ وَاذْكُرُوا إِذْ جَعَلَكُمْ خُلَفَاءَ مِن بَعْدِ قَوْمِ نُوحٍ وَزَادَكُمْ فِي الْخَلْقِ بَسْطَةً ۖ فَاذْكُرُوا آلَاءَ اللَّهِ لَعَلَّكُمْ تُفْلِحُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan herankah kamu bahwa ada peringatan yang datang dari Tuhanmu melalui seorang laki-laki dari kalanganmu sendiri, untuk memberi peringatan kepadamu? Ingatlah ketika Dia menjadikan kamu sebagai khalifah-khalifah setelah kaum Nuh, dan Dia lebihkan kamu dalam kekuatan tubuh dan perawakan. Maka ingatlah akan nikmat-nikmat Allah agar kamu beruntung. ”"
      },
      {
        "language_name": "english",
        "text": "Then do you wonder that there has come to you a reminder from your Lord through a man from among you, that he may warn you? And remember when He made you successors after the people of Noah and increased you in stature extensively. So remember the favors of Allah that you might succeed."
      }
    ],
    "verse_number": 69
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالُوا أَجِئْتَنَا لِنَعْبُدَ اللَّهَ وَحْدَهُ وَنَذَرَ مَا كَانَ يَعْبُدُ آبَاؤُنَا ۖ فَأْتِنَا بِمَا تَعِدُنَا إِن كُنتَ مِنَ الصَّادِقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "They said, \"Have you come to us that we should worship Allah alone and leave what our fathers have worshipped? Then bring us what you promise us, if you should be of the truthful.\""
      },
      {
        "language_name": "indonesian",
        "text": "Mereka berkata, “Apakah kedatanganmu kepada kami, agar kami hanya menyembah Allah saja dan meninggalkan apa yang biasa disembah oleh nenek moyang kami? Maka buktikanlah ancamanmu kepada kami, jika kamu benar!”"
      }
    ],
    "verse_number": 70
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ قَدْ وَقَعَ عَلَيْكُم مِّن رَّبِّكُمْ رِجْسٌ وَغَضَبٌ ۖ أَتُجَادِلُونَنِي فِي أَسْمَاءٍ سَمَّيْتُمُوهَا أَنتُمْ وَآبَاؤُكُم مَّا نَزَّلَ اللَّهُ بِهَا مِن سُلْطَانٍ ۚ فَانتَظِرُوا إِنِّي مَعَكُم مِّنَ الْمُنتَظِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dia (Hud) menjawab, “Sungguh, kebencian dan kemurkaan dari Tuhan akan menimpa kamu. Apakah kamu hendak berbantah denganku tentang nama-nama (berhala) yang kamu dan nenek moyangmu buat sendiri, padahal Allah tidak menurunkan keterangan untuk itu? Jika demikian, tunggulah! Sesungguhnya aku pun bersamamu termasuk yang menunggu.”"
      },
      {
        "language_name": "english",
        "text": "[Hud] said, \"Already have defilement and anger fallen upon you from your Lord. Do you dispute with me concerning [mere] names you have named them, you and your fathers, for which Allah has not sent down any authority? Then wait; indeed, I am with you among those who wait.\""
      }
    ],
    "verse_number": 71
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَأَنجَيْنَاهُ وَالَّذِينَ مَعَهُ بِرَحْمَةٍ مِّنَّا وَقَطَعْنَا دَابِرَ الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۖ وَمَا كَانُوا مُؤْمِنِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "So We saved him and those with him by mercy from Us. And We eliminated those who denied Our signs, and they were not [at all] believers."
      },
      {
        "language_name": "indonesian",
        "text": "Maka Kami selamatkan dia (Hud) dan orang-orang yang bersamanya dengan rahmat Kami dan Kami musnahkan sampai ke akar-akarnya orang-orang yang mendustakan ayat-ayat Kami. Mereka bukanlah orang-orang beriman."
      }
    ],
    "verse_number": 72
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ قَدْ جَاءَتْكُم بَيِّنَةٌ مِّن رَّبِّكُمْ ۖ هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً ۖ فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ ۖ وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ أَلِيمٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan kepada kaum Tsamud (Kami utus) saudara mereka Shalih. Dia berkata, “Wahai kaumku! Sembahlah Allah! Tidak ada tuhan (sembahan) bagimu selain Dia. Sesungguhnya telah datang kepadamu bukti yang nyata dari Tuhanmu. Ini (seekor) unta betina dari Allah sebagai tanda untukmu. Biarkanlah ia makan di bumi Allah, janganlah disakiti, nanti akibatnya kamu akan mendapatkan siksaan yang pedih.”"
      },
      {
        "language_name": "english",
        "text": "And to the Thamud [We sent] their brother Salih. He said, \"O my people, worship Allah ; you have no deity other than Him. There has come to you clear evidence from your Lord. This is the she-camel of Allah [sent] to you as a sign. So leave her to eat within Allah \u0027s land and do not touch her with harm, lest there seize you a painful punishment."
      }
    ],
    "verse_number": 73
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَاذْكُرُوا إِذْ جَعَلَكُمْ خُلَفَاءَ مِن بَعْدِ عَادٍ وَبَوَّأَكُمْ فِي الْأَرْضِ تَتَّخِذُونَ مِن سُهُولِهَا قُصُورًا وَتَنْحِتُونَ الْجِبَالَ بُيُوتًا ۖ فَاذْكُرُوا آلَاءَ اللَّهِ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan ingatlah ketika Dia menjadikan kamu khalifah-khalifah setelah kaum ‘Ad dan menempatkan kamu di bumi. Di tempat yang datar kamu dirikan istana-istana dan di bukit-bukit kamu pahat menjadi rumah-rumah. Maka ingatlah nikmat-nikmat Allah dan janganlah kamu membuat kerusakan di bumi."
      },
      {
        "language_name": "english",
        "text": "And remember when He made you successors after the \u0027Aad and settled you in the land, [and] you take for yourselves palaces from its plains and carve from the mountains, homes. Then remember the favors of Allah and do not commit abuse on the earth, spreading corruption.\""
      }
    ],
    "verse_number": 74
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ الْمَلَأُ الَّذِينَ اسْتَكْبَرُوا مِن قَوْمِهِ لِلَّذِينَ اسْتُضْعِفُوا لِمَنْ آمَنَ مِنْهُمْ أَتَعْلَمُونَ أَنَّ صَالِحًا مُّرْسَلٌ مِّن رَّبِّهِ ۚ قَالُوا إِنَّا بِمَا أُرْسِلَ بِهِ مُؤْمِنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Said the eminent ones who were arrogant among his people to those who were oppressed -  to those who believed among them, \"Do you [actually] know that Salih is sent from his Lord?\" They said, \"Indeed we, in that with which he was sent, are believers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Pemuka-pemuka yang menyombongkan diri berkata kepada orang-orang yang dianggap lemah, yaitu orang-orang yang telah beriman di antara kaumnya, “Tahukah kamu bahwa Shalih adalah seorang rasul dari Tuhannya?” Mereka menjawab, “Sesungguhnya kami percaya kepada apa yang disampaikannya.”"
      }
    ],
    "verse_number": 75
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "قَالَ الَّذِينَ اسْتَكْبَرُوا إِنَّا بِالَّذِي آمَنتُم بِهِ كَافِرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Said those who were arrogant, \"Indeed we, in that which you have believed, are disbelievers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Orang-orang yang menyombongkan diri berkata, “Sesungguhnya kami mengingkari apa yang kamu percayai.”"
      }
    ],
    "verse_number": 76
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَعَقَرُوا النَّاقَةَ وَعَتَوْا عَنْ أَمْرِ رَبِّهِمْ وَقَالُوا يَا صَالِحُ ائْتِنَا بِمَا تَعِدُنَا إِن كُنتَ مِنَ الْمُرْسَلِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "So they hamstrung the she-camel and were insolent toward the command of their Lord and said, \"O Salih, bring us what you promise us, if you should be of the messengers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Kemudian mereka sembelih unta betina itu, dan berlaku angkuh terhadap perintah Tuhannya. Mereka berkata, “Wahai Shalih! Buktikanlah ancaman kamu kepada kami, jika benar engkau salah seorang rasul.”"
      }
    ],
    "verse_number": 77
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَأَخَذَتْهُمُ الرَّجْفَةُ فَأَصْبَحُوا فِي دَارِهِمْ جَاثِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Lalu datanglah gempa menimpa mereka, dan mereka pun mati bergelimpangan di dalam reruntuhan rumah mereka."
      },
      {
        "language_name": "english",
        "text": "So the earthquake seized them, and they became within their home [corpses] fallen prone."
      }
    ],
    "verse_number": 78
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَا قَوْمِ لَقَدْ أَبْلَغْتُكُمْ رِسَالَةَ رَبِّي وَنَصَحْتُ لَكُمْ وَلَٰكِن لَّا تُحِبُّونَ النَّاصِحِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Kemudian dia (Shalih) pergi meninggalkan mereka sambil berkata, “Wahai kaumku! Sungguh, aku telah menyampaikan amanat Tuhanku kepadamu dan aku telah menasihati kamu. Tetapi kamu tidak menyukai orang yang memberi nasihat.”"
      },
      {
        "language_name": "english",
        "text": "And he turned away from them and said, \"O my people, I had certainly conveyed to you the message of my Lord and advised you, but you do not like advisors.\""
      }
    ],
    "verse_number": 79
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَلُوطًا إِذْ قَالَ لِقَوْمِهِ أَتَأْتُونَ الْفَاحِشَةَ مَا سَبَقَكُم بِهَا مِنْ أَحَدٍ مِّنَ الْعَالَمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And [We had sent] Lot when he said to his people, \"Do you commit such immorality as no one has preceded you with from among the worlds?"
      },
      {
        "language_name": "indonesian",
        "text": "Dan (Kami juga telah mengutus) Luth, ketika dia berkata kepada kaumnya, “Mengapa kamu melakukan perbuatan keji, yang belum pernah dilakukan oleh seorang pun sebelum kamu (di dunia ini)."
      }
    ],
    "verse_number": 80
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "إِنَّكُمْ لَتَأْتُونَ الرِّجَالَ شَهْوَةً مِّن دُونِ النِّسَاءِ ۚ بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sungguh, kamu telah melampiaskan syahwatmu kepada sesama lelaki bukan kepada perempuan. Kamu benar-benar kaum yang melampaui batas.”"
      },
      {
        "language_name": "english",
        "text": "Indeed, you approach men with desire, instead of women. Rather, you are a transgressing people.\""
      }
    ],
    "verse_number": 81
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَن قَالُوا أَخْرِجُوهُم مِّن قَرْيَتِكُمْ ۖ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But the answer of his people was only that they said, \"Evict them from your city! Indeed, they are men who keep themselves pure.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan jawaban kaumnya tidak lain hanya berkata, “Usirlah mereka (Luth dan pengikutnya) dari negerimu ini, mereka adalah orang yang menganggap dirinya suci.”"
      }
    ],
    "verse_number": 82
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "فَأَنجَيْنَاهُ وَأَهْلَهُ إِلَّا امْرَأَتَهُ كَانَتْ مِنَ الْغَابِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Kemudian Kami selamatkan dia dan pengikutnya, kecuali istrinya. Dia (istrinya) termasuk orang-orang yang tertinggal."
      },
      {
        "language_name": "english",
        "text": "So We saved him and his family, except for his wife; she was of those who remained [with the evildoers]."
      }
    ],
    "verse_number": 83
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَأَمْطَرْنَا عَلَيْهِم مَّطَرًا ۖ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُجْرِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We rained upon them a rain [of stones]. Then see how was the end of the criminals."
      },
      {
        "language_name": "indonesian",
        "text": "Dan Kami hujani mereka dengan hujan (batu). Maka perhatikanlah bagaimana kesudahan orang yang berbuat dosa itu."
      }
    ],
    "verse_number": 84
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ قَدْ جَاءَتْكُم بَيِّنَةٌ مِّن رَّبِّكُمْ ۖ فَأَوْفُوا الْكَيْلَ وَالْمِيزَانَ وَلَا تَبْخَسُوا النَّاسَ أَشْيَاءَهُمْ وَلَا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلَاحِهَا ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan kepada penduduk Madyan, Kami (utus) Syuaib, saudara mereka sendiri. Dia berkata, “Wahai kaumku! Sembahlah Allah. Tidak ada tuhan (sembahan) bagimu selain Dia. Sesungguhnya telah datang kepadamu bukti yang nyata dari Tuhanmu. Sempurnakanlah takaran dan timbangan, dan jangan kamu merugikan orang sedikit pun. Janganlah kamu berbuat kerusakan di bumi setelah (diciptakan) dengan baik. Itulah yang lebih baik bagimu jika kamu orang beriman.”"
      },
      {
        "language_name": "english",
        "text": "And to [the people of] Madyan [We sent] their brother Shu\u0027ayb. He said, \"O my people, worship Allah ; you have no deity other than Him. There has come to you clear evidence from your Lord. So fulfill the measure and weight and do not deprive people of their due and cause not corruption upon the earth after its reformation. That is better for you, if you should be believers."
      }
    ],
    "verse_number": 85
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَلَا تَقْعُدُوا بِكُلِّ صِرَاطٍ تُوعِدُونَ وَتَصُدُّونَ عَن سَبِيلِ اللَّهِ مَنْ آمَنَ بِهِ وَتَبْغُونَهَا عِوَجًا ۚ وَاذْكُرُوا إِذْ كُنتُمْ قَلِيلًا فَكَثَّرَكُمْ ۖ وَانظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And do not sit on every path, threatening and averting from the way of Allah those who believe in Him, seeking to make it [seem] deviant. And remember when you were few and He increased you. And see how was the end of the corrupters."
      },
      {
        "language_name": "indonesian",
        "text": "Dan janganlah kamu duduk di setiap jalan dengan menakut-nakuti dan menghalang-halangi orang-orang yang beriman dari jalan Allah dan ingin membelokkannya. Ingatlah ketika kamu dahulunya sedikit, lalu Allah memperbanyak jumlah kamu. Dan perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan."
      }
    ],
    "verse_number": 86
  },
  {
    "chapter_id": 7,
    "juz_number": 8,
    "text_madani": "وَإِن كَانَ طَائِفَةٌ مِّنكُمْ آمَنُوا بِالَّذِي أُرْسِلْتُ بِهِ وَطَائِفَةٌ لَّمْ يُؤْمِنُوا فَاصْبِرُوا حَتَّىٰ يَحْكُمَ اللَّهُ بَيْنَنَا ۚ وَهُوَ خَيْرُ الْحَاكِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Jika ada segolongan di antara kamu yang beriman kepada (ajaran) yang aku diutus menyampaikannya, dan ada (pula) segolongan yang tidak beriman, maka bersabarlah sampai Allah menetapkan keputusan di antara kita. Dialah hakim yang terbaik."
      },
      {
        "language_name": "english",
        "text": "And if there should be a group among you who has believed in that with which I have been sent and a group that has not believed, then be patient until Allah judges between us. And He is the best of judges.\""
      }
    ],
    "verse_number": 87
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ الْمَلَأُ الَّذِينَ اسْتَكْبَرُوا مِن قَوْمِهِ لَنُخْرِجَنَّكَ يَا شُعَيْبُ وَالَّذِينَ آمَنُوا مَعَكَ مِن قَرْيَتِنَا أَوْ لَتَعُودُنَّ فِي مِلَّتِنَا ۚ قَالَ أَوَلَوْ كُنَّا كَارِهِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Said the eminent ones who were arrogant among his people, \"We will surely evict you, O Shu\u0027ayb, and those who have believed with you from our city, or you must return to our religion.\" He said, \"Even if we were unwilling?\""
      },
      {
        "language_name": "indonesian",
        "text": "Pemuka-pemuka yang menyombongkan diri dari kaum Syuaib berkata, “Wahai Syuaib! Pasti kami usir engkau bersama orang-orang yang beriman dari negeri kami, kecuali engkau kembali kepada agama kami.”Syuaib berkata, “Apakah (kamu akan mengusir kami), kendatipun kami tidak suka?"
      }
    ],
    "verse_number": 88
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَدِ افْتَرَيْنَا عَلَى اللَّهِ كَذِبًا إِنْ عُدْنَا فِي مِلَّتِكُم بَعْدَ إِذْ نَجَّانَا اللَّهُ مِنْهَا ۚ وَمَا يَكُونُ لَنَا أَن نَّعُودَ فِيهَا إِلَّا أَن يَشَاءَ اللَّهُ رَبُّنَا ۚ وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْمًا ۚ عَلَى اللَّهِ تَوَكَّلْنَا ۚ رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "We would have invented against Allah a lie if we returned to your religion after Allah had saved us from it. And it is not for us to return to it except that Allah, our Lord, should will. Our Lord has encompassed all things in knowledge. Upon Allah we have relied. Our Lord, decide between us and our people in truth, and You are the best of those who give decision.\""
      },
      {
        "language_name": "indonesian",
        "text": "Sungguh, kami telah mengada-adakan kebohongan yang besar terhadap Allah, jika kami kembali kepada agamamu, setelah Allah melepaskan kami darinya. Dan tidaklah pantas kami kembali kepadanya, kecuali jika Allah, Tuhan kami menghendaki. Pengetahuan Tuhan kami meliputi segala sesuatu. Hanya kepada Allah kami bertawakal. Ya Tuhan kami, berilah keputusan antara kami dan kaum kami dengan hak (adil). Engkaulah pemberi keputusan terbaik.”"
      }
    ],
    "verse_number": 89
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِن قَوْمِهِ لَئِنِ اتَّبَعْتُمْ شُعَيْبًا إِنَّكُمْ إِذًا لَّخَاسِرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan pemuka-pemuka dari kaumnya (Syuaib) yang kafir berkata (kepada sesamanya), “Sesungguhnya jika kamu mengikuti Syuaib, tentu kamu menjadi orang-orang yang rugi.”"
      },
      {
        "language_name": "english",
        "text": "Said the eminent ones who disbelieved among his people, \"If you should follow Shu\u0027ayb, indeed, you would then be losers.\""
      }
    ],
    "verse_number": 90
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَأَخَذَتْهُمُ الرَّجْفَةُ فَأَصْبَحُوا فِي دَارِهِمْ جَاثِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Lalu datanglah gempa menimpa mereka, dan mereka pun mati bergelimpangan di dalam reruntuhan rumah mereka."
      },
      {
        "language_name": "english",
        "text": "So the earthquake seized them, and they became within their home [corpses] fallen prone."
      }
    ],
    "verse_number": 91
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "الَّذِينَ كَذَّبُوا شُعَيْبًا كَأَن لَّمْ يَغْنَوْا فِيهَا ۚ الَّذِينَ كَذَّبُوا شُعَيْبًا كَانُوا هُمُ الْخَاسِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Those who denied Shu\u0027ayb -  it was as though they had never resided there. Those who denied Shu\u0027ayb -  it was they who were the losers."
      },
      {
        "language_name": "indonesian",
        "text": "Orang-orang yang mendustakan Syuaib seakan-akan mereka belum pernah tinggal di (negeri) itu. Mereka yang mendustakan Syuaib, itulah orang-orang yang rugi."
      }
    ],
    "verse_number": 92
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَا قَوْمِ لَقَدْ أَبْلَغْتُكُمْ رِسَالَاتِ رَبِّي وَنَصَحْتُ لَكُمْ ۖ فَكَيْفَ آسَىٰ عَلَىٰ قَوْمٍ كَافِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka Syuaib meninggalkan mereka seraya berkata, “Wahai kaumku! Sungguh, aku telah menyampaikan amanat Tuhanku kepadamu dan aku telah menasihati kamu. Maka bagaimana aku akan bersedih hati terhadap orang-orang kafir?”"
      },
      {
        "language_name": "english",
        "text": "And he turned away from them and said, \"O my people, I had certainly conveyed to you the messages of my Lord and advised you, so how could I grieve for a disbelieving people?\""
      }
    ],
    "verse_number": 93
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَمَا أَرْسَلْنَا فِي قَرْيَةٍ مِّن نَّبِيٍّ إِلَّا أَخَذْنَا أَهْلَهَا بِالْبَأْسَاءِ وَالضَّرَّاءِ لَعَلَّهُمْ يَضَّرَّعُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan Kami tidak mengutus seorang nabi pun kepada sesuatu negeri, (lalu penduduknya mendustakan nabi itu), melainkan Kami timpakan kepada penduduknya kesempitan dan penderitaan agar mereka (tunduk dengan) merendahkan diri."
      },
      {
        "language_name": "english",
        "text": "And We sent to no city a prophet [who was denied] except that We seized its people with poverty and hardship that they might humble themselves [to Allah ]."
      }
    ],
    "verse_number": 94
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "ثُمَّ بَدَّلْنَا مَكَانَ السَّيِّئَةِ الْحَسَنَةَ حَتَّىٰ عَفَوا وَّقَالُوا قَدْ مَسَّ آبَاءَنَا الضَّرَّاءُ وَالسَّرَّاءُ فَأَخَذْنَاهُم بَغْتَةً وَهُمْ لَا يَشْعُرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Kemudian Kami ganti penderitaan itu dengan kesenangan (sehingga keturunan dan harta mereka) bertambah banyak, lalu mereka berkata, “Sungguh, nenek moyang kami telah merasakan penderitaan dan kesenangan,” maka Kami timpakan siksaan atas mereka dengan tiba-tiba tanpa mereka sadari."
      },
      {
        "language_name": "english",
        "text": "Then We exchanged in place of the bad [condition], good, until they increased [and prospered] and said, \"Our fathers [also] were touched with hardship and ease.\" So We seized them suddenly while they did not perceive."
      }
    ],
    "verse_number": 95
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَوْ أَنَّ أَهْلَ الْقُرَىٰ آمَنُوا وَاتَّقَوْا لَفَتَحْنَا عَلَيْهِم بَرَكَاتٍ مِّنَ السَّمَاءِ وَالْأَرْضِ وَلَٰكِن كَذَّبُوا فَأَخَذْنَاهُم بِمَا كَانُوا يَكْسِبُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And if only the people of the cities had believed and feared Allah, We would have opened upon them blessings from the heaven and the earth; but they denied [the messengers], so We seized them for what they were earning.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan sekiranya penduduk negeri beriman dan bertakwa, pasti Kami akan melimpahkan kepada mereka berkah dari langit dan bumi, tetapi ternyata mereka mendustakan (ayat-ayat Kami), maka Kami siksa mereka sesuai dengan apa yang telah mereka kerjakan."
      }
    ],
    "verse_number": 96
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "أَفَأَمِنَ أَهْلُ الْقُرَىٰ أَن يَأْتِيَهُم بَأْسُنَا بَيَاتًا وَهُمْ نَائِمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka apakah penduduk negeri itu merasa aman dari siksaan Kami yang datang malam hari ketika mereka sedang tidur?"
      },
      {
        "language_name": "english",
        "text": "Then, did the people of the cities feel secure from Our punishment coming to them at night while they were asleep?"
      }
    ],
    "verse_number": 97
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "أَوَأَمِنَ أَهْلُ الْقُرَىٰ أَن يَأْتِيَهُم بَأْسُنَا ضُحًى وَهُمْ يَلْعَبُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Or did the people of the cities feel secure from Our punishment coming to them in the morning while they were at play?"
      },
      {
        "language_name": "indonesian",
        "text": "Atau apakah penduduk negeri itu merasa aman dari siksaan Kami yang datang pada pagi hari ketika mereka sedang bermain?"
      }
    ],
    "verse_number": 98
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "أَفَأَمِنُوا مَكْرَ اللَّهِ ۚ فَلَا يَأْمَنُ مَكْرَ اللَّهِ إِلَّا الْقَوْمُ الْخَاسِرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Then did they feel secure from the plan of Allah ? But no one feels secure from the plan of Allah except the losing people."
      },
      {
        "language_name": "indonesian",
        "text": "Atau apakah mereka merasa aman dari siksaan Allah (yang tidak terduga-duga)? Tidak ada yang merasa aman dari siksaan Allah selain orang-orang yang rugi."
      }
    ],
    "verse_number": 99
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "أَوَلَمْ يَهْدِ لِلَّذِينَ يَرِثُونَ الْأَرْضَ مِن بَعْدِ أَهْلِهَا أَن لَّوْ نَشَاءُ أَصَبْنَاهُم بِذُنُوبِهِمْ ۚ وَنَطْبَعُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَسْمَعُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Has it not become clear to those who inherited the earth after its [previous] people that if We willed, We could afflict them for their sins? But We seal over their hearts so they do not hear."
      },
      {
        "language_name": "indonesian",
        "text": "Atau apakah belum jelas bagi orang-orang yang mewarisi suatu negeri setelah (lenyap) penduduknya? Bahwa kalau Kami menghendaki pasti Kami siksa mereka karena dosa-dosanya; dan Kami mengunci hati mereka sehingga mereka tidak dapat mendengar (pelajaran)."
      }
    ],
    "verse_number": 100
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "تِلْكَ الْقُرَىٰ نَقُصُّ عَلَيْكَ مِنْ أَنبَائِهَا ۚ وَلَقَدْ جَاءَتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ فَمَا كَانُوا لِيُؤْمِنُوا بِمَا كَذَّبُوا مِن قَبْلُ ۚ كَذَٰلِكَ يَطْبَعُ اللَّهُ عَلَىٰ قُلُوبِ الْكَافِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Those cities -  We relate to you, [O Muhammad], some of their news. And certainly did their messengers come to them with clear proofs, but they were not to believe in that which they had denied before. Thus does Allah seal over the hearts of the disbelievers."
      },
      {
        "language_name": "indonesian",
        "text": "Itulah negeri-negeri (yang telah Kami binasakan) itu, Kami ceritakan sebagian kisahnya kepadamu. Rasul-rasul mereka benar-benar telah datang kepada mereka dengan membawa bukti-bukti yang nyata. Tetapi mereka tidak beriman (juga) kepada apa yang telah mereka dustakan sebelumnya. Demikianlah Allah mengunci hati orang-orang kafir."
      }
    ],
    "verse_number": 101
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَمَا وَجَدْنَا لِأَكْثَرِهِم مِّنْ عَهْدٍ ۖ وَإِن وَجَدْنَا أَكْثَرَهُمْ لَفَاسِقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We did not find for most of them any covenant; but indeed, We found most of them defiantly disobedient."
      },
      {
        "language_name": "indonesian",
        "text": "Dan Kami tidak mendapati kebanyakan mereka memenuhi janji. Sebaliknya yang Kami dapati kebanyakan mereka adalah orang-orang yang benar-benar fasik."
      }
    ],
    "verse_number": 102
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "ثُمَّ بَعَثْنَا مِن بَعْدِهِم مُّوسَىٰ بِآيَاتِنَا إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَظَلَمُوا بِهَا ۖ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Then We sent after them Moses with Our signs to Pharaoh and his establishment, but they were unjust toward them. So see how was the end of the corrupters."
      },
      {
        "language_name": "indonesian",
        "text": "Setelah mereka, kemudian Kami utus Musa dengan membawa bukti-bukti Kami kepada Fir‘aun dan pemuka-pemuka kaumnya, lalu mereka mengingkari bukti-bukti itu. Maka perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan."
      }
    ],
    "verse_number": 103
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَقَالَ مُوسَىٰ يَا فِرْعَوْنُ إِنِّي رَسُولٌ مِّن رَّبِّ الْعَالَمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And Moses said, \"O Pharaoh, I am a messenger from the Lord of the worlds"
      },
      {
        "language_name": "indonesian",
        "text": "Dan Musa berkata, “Wahai Fir‘aun! Sungguh, aku adalah seorang utusan dari Tuhan seluruh alam,"
      }
    ],
    "verse_number": 104
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "حَقِيقٌ عَلَىٰ أَن لَّا أَقُولَ عَلَى اللَّهِ إِلَّا الْحَقَّ ۚ قَدْ جِئْتُكُم بِبَيِّنَةٍ مِّن رَّبِّكُمْ فَأَرْسِلْ مَعِيَ بَنِي إِسْرَائِيلَ",
    "translations": [
      {
        "language_name": "english",
        "text": "[Who is] obligated not to say about Allah except the truth. I have come to you with clear evidence from your Lord, so send with me the Children of Israel.\""
      },
      {
        "language_name": "indonesian",
        "text": "aku wajib mengatakan yang sebenarnya tentang Allah. Sungguh, aku datang kepadamu dengan membawa bukti yang nyata dari Tuhanmu, maka lepaskanlah Bani Israil (pergi) bersamaku.”"
      }
    ],
    "verse_number": 105
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ إِن كُنتَ جِئْتَ بِآيَةٍ فَأْتِ بِهَا إِن كُنتَ مِنَ الصَّادِقِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dia (Fir‘aun) menjawab, “Jika benar engkau membawa sesuatu bukti, maka tunjukkanlah, kalau kamu termasuk orang-orang yang benar.”"
      },
      {
        "language_name": "english",
        "text": "[Pharaoh] said, \"If you have come with a sign, then bring it forth, if you should be of the truthful.\""
      }
    ],
    "verse_number": 106
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَأَلْقَىٰ عَصَاهُ فَإِذَا هِيَ ثُعْبَانٌ مُّبِينٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "So Moses threw his staff, and suddenly it was a serpent, manifest."
      },
      {
        "language_name": "indonesian",
        "text": "Lalu (Musa) melemparkan tongkatnya, tiba-tiba tongkat itu menjadi ular besar yang sebenarnya."
      }
    ],
    "verse_number": 107
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَنَزَعَ يَدَهُ فَإِذَا هِيَ بَيْضَاءُ لِلنَّاظِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan dia mengeluarkan tangannya, tiba-tiba tangan itu menjadi putih (bercahaya) bagi orang-orang yang melihatnya."
      },
      {
        "language_name": "english",
        "text": "And he drew out his hand; thereupon it was white [with radiance] for the observers."
      }
    ],
    "verse_number": 108
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ الْمَلَأُ مِن قَوْمِ فِرْعَوْنَ إِنَّ هَٰذَا لَسَاحِرٌ عَلِيمٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Pemuka-pemuka kaum Fir‘aun berkata, “Orang ini benar-benar pesihir yang pandai,"
      },
      {
        "language_name": "english",
        "text": "Said the eminent among the people of Pharaoh, \"Indeed, this is a learned magician"
      }
    ],
    "verse_number": 109
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "يُرِيدُ أَن يُخْرِجَكُم مِّنْ أَرْضِكُمْ ۖ فَمَاذَا تَأْمُرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "yang hendak mengusir kamu dari negerimu.” (Fir‘aun berkata), “Maka apa saran kamu?”"
      },
      {
        "language_name": "english",
        "text": "Who wants to expel you from your land [through magic], so what do you instruct?\""
      }
    ],
    "verse_number": 110
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالُوا أَرْجِهْ وَأَخَاهُ وَأَرْسِلْ فِي الْمَدَائِنِ حَاشِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "They said, \"Postpone [the matter of] him and his brother and send among the cities gatherers"
      },
      {
        "language_name": "indonesian",
        "text": "(Pemuka-pemuka) itu menjawab, “Tahanlah (untuk sementara) dia dan saudaranya dan utuslah ke kota-kota beberapa orang untuk mengumpulkan (para pesihir),"
      }
    ],
    "verse_number": 111
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "يَأْتُوكَ بِكُلِّ سَاحِرٍ عَلِيمٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "agar mereka membawa semua pesihir yang pandai kepadamu.”"
      },
      {
        "language_name": "english",
        "text": "Who will bring you every learned magician.\""
      }
    ],
    "verse_number": 112
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَجَاءَ السَّحَرَةُ فِرْعَوْنَ قَالُوا إِنَّ لَنَا لَأَجْرًا إِن كُنَّا نَحْنُ الْغَالِبِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And the magicians came to Pharaoh. They said, \"Indeed for us is a reward if we are the predominant.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan para pesihir datang kepada Fir‘aun. Mereka berkata, “(Apakah) kami akan mendapat imbalan, jika kami menang?”"
      }
    ],
    "verse_number": 113
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ نَعَمْ وَإِنَّكُمْ لَمِنَ الْمُقَرَّبِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dia (Fir‘aun) menjawab, “Ya, bahkan kamu pasti termasuk orang-orang yang dekat (kepadaku).”"
      },
      {
        "language_name": "english",
        "text": "He said, \"Yes, and, [moreover], you will be among those made near [to me].\""
      }
    ],
    "verse_number": 114
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالُوا يَا مُوسَىٰ إِمَّا أَن تُلْقِيَ وَإِمَّا أَن نَّكُونَ نَحْنُ الْمُلْقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "They said, \"O Moses, either you throw [your staff], or we will be the ones to throw [first].\""
      },
      {
        "language_name": "indonesian",
        "text": "Mereka (para pesihir) berkata, “Wahai Musa! Engkaukah yang akan melemparkan lebih dahulu, atau kami yang melemparkan?”"
      }
    ],
    "verse_number": 115
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ أَلْقُوا ۖ فَلَمَّا أَلْقَوْا سَحَرُوا أَعْيُنَ النَّاسِ وَاسْتَرْهَبُوهُمْ وَجَاءُوا بِسِحْرٍ عَظِيمٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dia (Musa) menjawab, “Lemparkanlah (lebih dahulu)!” Maka setelah mereka melemparkan, mereka menyihir mata orang banyak dan menjadikan orang banyak itu takut, karena mereka memperlihatkan sihir yang hebat (menakjubkan)."
      },
      {
        "language_name": "english",
        "text": "He said, \"Throw,\" and when they threw, they bewitched the eyes of the people and struck terror into them, and they presented a great [feat of] magic."
      }
    ],
    "verse_number": 116
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَلْقِ عَصَاكَ ۖ فَإِذَا هِيَ تَلْقَفُ مَا يَأْفِكُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan Kami wahyukan kepada Musa, “Lemparkanlah tongkatmu!” Maka tiba-tiba ia menelan (habis) segala kepalsuan mereka."
      },
      {
        "language_name": "english",
        "text": "And We inspired to Moses, \"Throw your staff,\" and at once it devoured what they were falsifying."
      }
    ],
    "verse_number": 117
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوا يَعْمَلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "So the truth was established, and abolished was what they were doing."
      },
      {
        "language_name": "indonesian",
        "text": "Maka terbuktilah kebenaran, dan segala yang mereka kerjakan jadi sia-sia."
      }
    ],
    "verse_number": 118
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَغُلِبُوا هُنَالِكَ وَانقَلَبُوا صَاغِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka mereka dikalahkan di tempat itu dan jadilah mereka orang-orang yang hina."
      },
      {
        "language_name": "english",
        "text": "And Pharaoh and his people were overcome right there and became debased."
      }
    ],
    "verse_number": 119
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَأُلْقِيَ السَّحَرَةُ سَاجِدِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan para pesihir itu serta merta menjatuhkan diri dengan bersujud."
      },
      {
        "language_name": "english",
        "text": "And the magicians fell down in prostration [to Allah ]."
      }
    ],
    "verse_number": 120
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالُوا آمَنَّا بِرَبِّ الْعَالَمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "They said, \"We have believed in the Lord of the worlds,"
      },
      {
        "language_name": "indonesian",
        "text": "Mereka berkata, “Kami beriman kepada Tuhan seluruh alam,"
      }
    ],
    "verse_number": 121
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "رَبِّ مُوسَىٰ وَهَارُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "The Lord of Moses and Aaron.\""
      },
      {
        "language_name": "indonesian",
        "text": "(yaitu) Tuhannya Musa dan Harun.”"
      }
    ],
    "verse_number": 122
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ فِرْعَوْنُ آمَنتُم بِهِ قَبْلَ أَنْ آذَنَ لَكُمْ ۖ إِنَّ هَٰذَا لَمَكْرٌ مَّكَرْتُمُوهُ فِي الْمَدِينَةِ لِتُخْرِجُوا مِنْهَا أَهْلَهَا ۖ فَسَوْفَ تَعْلَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Fir‘aun berkata, “Mengapa kamu beriman kepadanya sebelum aku memberi izin kepadamu? Sesungguhnya ini benar-benar tipu muslihat yang telah kamu rencanakan di kota ini, untuk mengusir penduduknya. Kelak kamu akan mengetahui (akibat perbuatanmu ini)."
      },
      {
        "language_name": "english",
        "text": "Said Pharaoh, \"You believed in him before I gave you permission. Indeed, this is a conspiracy which you conspired in the city to expel therefrom its people. But you are going to know."
      }
    ],
    "verse_number": 123
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "لَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلَافٍ ثُمَّ لَأُصَلِّبَنَّكُمْ أَجْمَعِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Pasti akan aku potong tangan dan kakimu dengan bersilang (tangan kanan dan kaki kiri atau sebaliknya), kemudian aku akan menyalib kamu semua.”"
      },
      {
        "language_name": "english",
        "text": "I will surely cut off your hands and your feet on opposite sides; then I will surely crucify you all.\""
      }
    ],
    "verse_number": 124
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالُوا إِنَّا إِلَىٰ رَبِّنَا مُنقَلِبُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Mereka (para pesihir) menjawab, “Sesungguhnya kami akan kembali kepada Tuhan kami."
      },
      {
        "language_name": "english",
        "text": "They said, \"Indeed, to our Lord we will return."
      }
    ],
    "verse_number": 125
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَمَا تَنقِمُ مِنَّا إِلَّا أَنْ آمَنَّا بِآيَاتِ رَبِّنَا لَمَّا جَاءَتْنَا ۚ رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And you do not resent us except because we believed in the signs of our Lord when they came to us. Our Lord, pour upon us patience and let us die as Muslims [in submission to You].\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan engkau tidak melakukan balas dendam kepada kami, melainkan karena kami beriman kepada ayat-ayat Tuhan kami ketika ayat-ayat itu datang kepada kami.” (Mereka berdoa), “Ya Tuhan kami, limpahkanlah kesabaran kepada kami dan matikanlah kami dalam keadaan muslim (berserah diri kepada-Mu).”"
      }
    ],
    "verse_number": 126
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَقَالَ الْمَلَأُ مِن قَوْمِ فِرْعَوْنَ أَتَذَرُ مُوسَىٰ وَقَوْمَهُ لِيُفْسِدُوا فِي الْأَرْضِ وَيَذَرَكَ وَآلِهَتَكَ ۚ قَالَ سَنُقَتِّلُ أَبْنَاءَهُمْ وَنَسْتَحْيِي نِسَاءَهُمْ وَإِنَّا فَوْقَهُمْ قَاهِرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan para pemuka dari kaum Fir‘aun berkata, “Apakah engkau akan membiarkan Musa dan kaumnya untuk berbuat kerusakan di negeri ini (Mesir) dan meninggalkanmu dan tuhan-tuhanmu?” (Fir‘aun) menjawab, “Akan kita bunuh anak-anak laki-laki mereka dan kita biarkan hidup anak-anak perempuan mereka dan sesungguhnya kita berkuasa penuh atas mereka.”"
      },
      {
        "language_name": "english",
        "text": "And the eminent among the people of Pharaoh said,\" Will you leave Moses and his people to cause corruption in the land and abandon you and your gods?\" [Pharaoh] said, \"We will kill their sons and keep their women alive; and indeed, we are subjugators over them.\""
      }
    ],
    "verse_number": 127
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ مُوسَىٰ لِقَوْمِهِ اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا ۖ إِنَّ الْأَرْضَ لِلَّهِ يُورِثُهَا مَن يَشَاءُ مِنْ عِبَادِهِ ۖ وَالْعَاقِبَةُ لِلْمُتَّقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Said Moses to his people, \"Seek help through Allah and be patient. Indeed, the earth belongs to Allah . He causes to inherit it whom He wills of His servants. And the [best] outcome is for the righteous.\""
      },
      {
        "language_name": "indonesian",
        "text": "Musa berkata kepada kaumnya, “Mohonlah pertolongan kepada Allah dan bersabarlah. Sesungguhnya bumi (ini) milik Allah; diwariskan-Nya kepada siapa saja yang Dia kehendaki di antara hamba-hamba-Nya. Dan kesudahan (yang baik) adalah bagi orang-orang yang bertakwa.”"
      }
    ],
    "verse_number": 128
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالُوا أُوذِينَا مِن قَبْلِ أَن تَأْتِيَنَا وَمِن بَعْدِ مَا جِئْتَنَا ۚ قَالَ عَسَىٰ رَبُّكُمْ أَن يُهْلِكَ عَدُوَّكُمْ وَيَسْتَخْلِفَكُمْ فِي الْأَرْضِ فَيَنظُرَ كَيْفَ تَعْمَلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Mereka (kaum Musa) berkata, ”Kami telah ditindas (oleh Fir‘aun) sebelum engkau datang kepada kami dan setelah engkau datang.” (Musa) menjawab, “Mudah-mudahan Tuhanmu membinasakan musuhmu dan menjadikan kamu khalifah di bumi; maka Dia akan melihat bagaimana perbuatanmu.”"
      },
      {
        "language_name": "english",
        "text": "They said, \"We have been harmed before you came to us and after you have come to us.\" He said, \"Perhaps your Lord will destroy your enemy and grant you succession in the land and see how you will do.\""
      }
    ],
    "verse_number": 129
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَقَدْ أَخَذْنَا آلَ فِرْعَوْنَ بِالسِّنِينَ وَنَقْصٍ مِّنَ الثَّمَرَاتِ لَعَلَّهُمْ يَذَّكَّرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We certainly seized the people of Pharaoh with years of famine and a deficiency in fruits that perhaps they would be reminded."
      },
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, Kami telah menghukum Fir‘aun dan kaumnya dengan (mendatangkan musim kemarau) bertahun-tahun dan kekurangan buah-buahan, agar mereka mengambil pelajaran."
      }
    ],
    "verse_number": 130
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَإِذَا جَاءَتْهُمُ الْحَسَنَةُ قَالُوا لَنَا هَٰذِهِ ۖ وَإِن تُصِبْهُمْ سَيِّئَةٌ يَطَّيَّرُوا بِمُوسَىٰ وَمَن مَّعَهُ ۗ أَلَا إِنَّمَا طَائِرُهُمْ عِندَ اللَّهِ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Kemudian apabila kebaikan (kemakmuran) datang kepada mereka, mereka berkata, “Ini adalah karena (usaha) kami.” Dan jika mereka ditimpa kesusahan, mereka lemparkan sebab kesialan itu kepada Musa dan pengikutnya. Ketahuilah, sesungguhnya nasib mereka di tangan Allah, namun kebanyakan mereka tidak mengetahui."
      },
      {
        "language_name": "english",
        "text": "But when good came to them, they said, \"This is ours [by right].\" And if a bad [condition] struck them, they saw an evil omen in Moses and those with him. Unquestionably, their fortune is with Allah, but most of them do not know."
      }
    ],
    "verse_number": 131
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَقَالُوا مَهْمَا تَأْتِنَا بِهِ مِنْ آيَةٍ لِّتَسْحَرَنَا بِهَا فَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan mereka berkata (kepada Musa), “Bukti apa pun yang engkau bawa kepada kami untuk menyihir kami, kami tidak akan beriman kepadamu.”"
      },
      {
        "language_name": "english",
        "text": "And they said, \"No matter what sign you bring us with which to bewitch us, we will not be believers in you.\""
      }
    ],
    "verse_number": 132
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَأَرْسَلْنَا عَلَيْهِمُ الطُّوفَانَ وَالْجَرَادَ وَالْقُمَّلَ وَالضَّفَادِعَ وَالدَّمَ آيَاتٍ مُّفَصَّلَاتٍ فَاسْتَكْبَرُوا وَكَانُوا قَوْمًا مُّجْرِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka Kami kirimkan kepada mereka topan, belalang, kutu, katak dan darah (air minum berubah menjadi darah) sebagai bukti-bukti yang jelas, tetapi mereka tetap menyombongkan diri dan mereka adalah kaum yang berdosa."
      },
      {
        "language_name": "english",
        "text": "So We sent upon them the flood and locusts and lice and frogs and blood as distinct signs, but they were arrogant and were a criminal people."
      }
    ],
    "verse_number": 133
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَمَّا وَقَعَ عَلَيْهِمُ الرِّجْزُ قَالُوا يَا مُوسَى ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِندَكَ ۖ لَئِن كَشَفْتَ عَنَّا الرِّجْزَ لَنُؤْمِنَنَّ لَكَ وَلَنُرْسِلَنَّ مَعَكَ بَنِي إِسْرَائِيلَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan ketika mereka ditimpa azab (yang telah diterangkan itu) mereka pun berkata, “Wahai Musa! Mohonkanlah untuk kami kepada Tuhanmu sesuai dengan janji-Nya kepadamu. Jika engkau dapat menghilangkan azab itu dari kami, niscaya kami akan beriman kepadamu dan pasti akan kami biarkan Bani Israil pergi bersamamu.”"
      },
      {
        "language_name": "english",
        "text": "And when the punishment descended upon them, they said, \"O Moses, invoke for us your Lord by what He has promised you. If you [can] remove the punishment from us, we will surely believe you, and we will send with you the Children of Israel.\""
      }
    ],
    "verse_number": 134
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَلَمَّا كَشَفْنَا عَنْهُمُ الرِّجْزَ إِلَىٰ أَجَلٍ هُم بَالِغُوهُ إِذَا هُمْ يَنكُثُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Tetapi setelah Kami hilangkan azab itu dari mereka hingga batas waktu yang harus mereka penuhi ternyata mereka ingkar janji."
      },
      {
        "language_name": "english",
        "text": "But when We removed the punishment from them until a term which they were to reach, then at once they broke their word."
      }
    ],
    "verse_number": 135
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَانتَقَمْنَا مِنْهُمْ فَأَغْرَقْنَاهُمْ فِي الْيَمِّ بِأَنَّهُمْ كَذَّبُوا بِآيَاتِنَا وَكَانُوا عَنْهَا غَافِلِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "So We took retribution from them, and We drowned them in the sea because they denied Our signs and were heedless of them."
      },
      {
        "language_name": "indonesian",
        "text": "Maka Kami hukum sebagian di antara mereka, lalu Kami tenggelamkan mereka di laut karena mereka telah mendustakan ayat-ayat Kami dan melalaikan ayat-ayat Kami."
      }
    ],
    "verse_number": 136
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَأَوْرَثْنَا الْقَوْمَ الَّذِينَ كَانُوا يُسْتَضْعَفُونَ مَشَارِقَ الْأَرْضِ وَمَغَارِبَهَا الَّتِي بَارَكْنَا فِيهَا ۖ وَتَمَّتْ كَلِمَتُ رَبِّكَ الْحُسْنَىٰ عَلَىٰ بَنِي إِسْرَائِيلَ بِمَا صَبَرُوا ۖ وَدَمَّرْنَا مَا كَانَ يَصْنَعُ فِرْعَوْنُ وَقَوْمُهُ وَمَا كَانُوا يَعْرِشُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan Kami wariskan kepada kaum yang tertindas itu, bumi bagian timur dan bagian baratnya yang telah Kami berkahi. Dan telah sempurnalah firman Tuhanmu yang baik itu (sebagai janji) untuk Bani Israil disebabkan kesabaran mereka. Dan Kami hancurkan apa yang telah dibuat Fir‘aun dan kaumnya dan apa yang telah mereka bangun."
      },
      {
        "language_name": "english",
        "text": "And We caused the people who had been oppressed to inherit the eastern regions of the land and the western ones, which We had blessed. And the good word of your Lord was fulfilled for the Children of Israel because of what they had patiently endured. And We destroyed [all] that Pharaoh and his people were producing and what they had been building."
      }
    ],
    "verse_number": 137
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَجَاوَزْنَا بِبَنِي إِسْرَائِيلَ الْبَحْرَ فَأَتَوْا عَلَىٰ قَوْمٍ يَعْكُفُونَ عَلَىٰ أَصْنَامٍ لَّهُمْ ۚ قَالُوا يَا مُوسَى اجْعَل لَّنَا إِلَٰهًا كَمَا لَهُمْ آلِهَةٌ ۚ قَالَ إِنَّكُمْ قَوْمٌ تَجْهَلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan Kami selamatkan Bani Israil menyeberangi laut itu (bagian utara dari Laut Merah). Ketika mereka sampai kepada suatu kaum yang tetap menyembah berhala, mereka (Bani Israil) berkata, “Wahai Musa! Buatlah untuk kami sebuah tuhan (berhala) sebagaimana mereka mempunyai beberapa tuhan (berhala).” (Musa) menjawab, “Sungguh, kamu orang-orang yang bodoh.”"
      },
      {
        "language_name": "english",
        "text": "And We took the Children of Israel across the sea; then they came upon a people intent in devotion to [some] idols of theirs. They said, \"O Moses, make for us a god just as they have gods.\" He said, \"Indeed, you are a people behaving ignorantly."
      }
    ],
    "verse_number": 138
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "إِنَّ هَٰؤُلَاءِ مُتَبَّرٌ مَّا هُمْ فِيهِ وَبَاطِلٌ مَّا كَانُوا يَعْمَلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Indeed, those [worshippers] -  destroyed is that in which they are [engaged], and worthless is whatever they were doing.\""
      },
      {
        "language_name": "indonesian",
        "text": "Sesungguhnya mereka akan dihancurkan (oleh kepercayaan) yang dianutnya dan akan sia-sia apa yang telah mereka kerjakan."
      }
    ],
    "verse_number": 139
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ أَغَيْرَ اللَّهِ أَبْغِيكُمْ إِلَٰهًا وَهُوَ فَضَّلَكُمْ عَلَى الْعَالَمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "He said, \"Is it other than Allah I should desire for you as a god while He has preferred you over the worlds?\""
      },
      {
        "language_name": "indonesian",
        "text": "Dia (Musa) berkata, “Pantaskah aku mencari tuhan untukmu selain Allah, padahal Dia yang telah melebihkan kamu atas segala umat (pada masa itu).”"
      }
    ],
    "verse_number": 140
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِذْ أَنجَيْنَاكُم مِّنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ ۖ يُقَتِّلُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ ۚ وَفِي ذَٰلِكُم بَلَاءٌ مِّن رَّبِّكُمْ عَظِيمٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "And [recall, O Children of Israel], when We saved you from the people of Pharaoh, [who were] afflicting you with the worst torment -  killing your sons and keeping your women alive. And in that was a great trial from your Lord."
      },
      {
        "language_name": "indonesian",
        "text": "Dan (ingatlah wahai Bani Israil) ketika Kami menyelamatkan kamu dari (Fir‘aun) dan kaumnya, yang menyiksa kamu dengan siksaan yang sangat berat, mereka membunuh anak-anak laki-lakimu dan membiarkan hidup anak-anak perempuanmu. Dan pada yang demikian itu merupakan cobaan yang besar dari Tuhanmu."
      }
    ],
    "verse_number": 141
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَوَاعَدْنَا مُوسَىٰ ثَلَاثِينَ لَيْلَةً وَأَتْمَمْنَاهَا بِعَشْرٍ فَتَمَّ مِيقَاتُ رَبِّهِ أَرْبَعِينَ لَيْلَةً ۚ وَقَالَ مُوسَىٰ لِأَخِيهِ هَارُونَ اخْلُفْنِي فِي قَوْمِي وَأَصْلِحْ وَلَا تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We made an appointment with Moses for thirty nights and perfected them by [the addition of] ten; so the term of his Lord was completed as forty nights. And Moses said to his brother Aaron, \"Take my place among my people, do right [by them], and do not follow the way of the corrupters.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan Kami telah menjanjikan kepada Musa (memberikan Taurat) tiga puluh malam, dan Kami sempurnakan jumlah malam itu dengan sepuluh (malam lagi), maka sempurnalah waktu yang telah ditentukan Tuhannya empat puluh malam. Dan Musa berkata kepada saudaranya (yaitu) Harun, “Gantikanlah aku dalam (memimpin) kaumku, dan perbaikilah (dirimu dan kaummu), dan janganlah engkau mengikuti jalan orang-orang yang berbuat kerusakan.”"
      }
    ],
    "verse_number": 142
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَمَّا جَاءَ مُوسَىٰ لِمِيقَاتِنَا وَكَلَّمَهُ رَبُّهُ قَالَ رَبِّ أَرِنِي أَنظُرْ إِلَيْكَ ۚ قَالَ لَن تَرَانِي وَلَٰكِنِ انظُرْ إِلَى الْجَبَلِ فَإِنِ اسْتَقَرَّ مَكَانَهُ فَسَوْفَ تَرَانِي ۚ فَلَمَّا تَجَلَّىٰ رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وَخَرَّ مُوسَىٰ صَعِقًا ۚ فَلَمَّا أَفَاقَ قَالَ سُبْحَانَكَ تُبْتُ إِلَيْكَ وَأَنَا أَوَّلُ الْمُؤْمِنِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan ketika Musa datang untuk (munajat) pada waktu yang telah Kami tentukan dan Tuhan telah berfirman (langsung) kepadanya, (Musa) berkata, “Ya Tuhanku, tampakkanlah (diri-Mu) kepadaku agar aku dapat melihat Engkau.” (Allah) berfirman, “Engkau tidak akan (sanggup) melihat-Ku, namun lihatlah ke gunung itu, jika ia tetap di tempatnya (sebagai sediakala) niscaya engkau dapat melihat-Ku.” Maka ketika Tuhannya menampakkan (keagungan-Nya) kepada gunung itu, gunung itu hancur luluh dan Musa pun jatuh pingsan. Setelah Musa sadar, dia berkata, “Mahasuci Engkau, aku bertobat kepada Engkau dan aku adalah orang yang pertama-tama beriman.”"
      },
      {
        "language_name": "english",
        "text": "And when Moses arrived at Our appointed time and his Lord spoke to him, he said, \"My Lord, show me [Yourself] that I may look at You.\" [ Allah ] said, \"You will not see Me, but look at the mountain; if it should remain in place, then you will see Me.\" But when his Lord appeared to the mountain, He rendered it level, and Moses fell unconscious. And when he awoke, he said, \"Exalted are You! I have repented to You, and I am the first of the believers.\""
      }
    ],
    "verse_number": 143
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ يَا مُوسَىٰ إِنِّي اصْطَفَيْتُكَ عَلَى النَّاسِ بِرِسَالَاتِي وَبِكَلَامِي فَخُذْ مَا آتَيْتُكَ وَكُن مِّنَ الشَّاكِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Allah) berfirman, “Wahai Musa! Sesungguhnya Aku memilih (melebihkan) engkau dari manusia yang lain (pada masamu) untuk membawa risalah-Ku dan firman-Ku, sebab itu berpegang-teguhlah kepada apa yang Aku berikan kepadamu dan hendaklah engkau termasuk orang-orang yang bersyukur.”"
      },
      {
        "language_name": "english",
        "text": "[ Allah ] said, \"O Moses, I have chosen you over the people with My messages and My words [to you]. So take what I have given you and be among the grateful.\""
      }
    ],
    "verse_number": 144
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَكَتَبْنَا لَهُ فِي الْأَلْوَاحِ مِن كُلِّ شَيْءٍ مَّوْعِظَةً وَتَفْصِيلًا لِّكُلِّ شَيْءٍ فَخُذْهَا بِقُوَّةٍ وَأْمُرْ قَوْمَكَ يَأْخُذُوا بِأَحْسَنِهَا ۚ سَأُرِيكُمْ دَارَ الْفَاسِقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We wrote for him on the tablets [something] of all things -  instruction and explanation for all things, [saying], \"Take them with determination and order your people to take the best of it. I will show you the home of the defiantly disobedient.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan telah Kami tuliskan untuk Musa pada lauh-lauh (Taurat) segala sesuatu sebagai pelajaran dan penjelasan untuk segala hal; maka (Kami berfirman), “Berpegangteguhlah kepadanya dan suruhlah kaummu berpegang kepadanya dengan sebaik-baiknya, Aku akan memperlihatkan kepadamu negeri orang-orang fasik.”"
      }
    ],
    "verse_number": 145
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَإِن يَرَوْا كُلَّ آيَةٍ لَّا يُؤْمِنُوا بِهَا وَإِن يَرَوْا سَبِيلَ الرُّشْدِ لَا يَتَّخِذُوهُ سَبِيلًا وَإِن يَرَوْا سَبِيلَ الْغَيِّ يَتَّخِذُوهُ سَبِيلًا ۚ ذَٰلِكَ بِأَنَّهُمْ كَذَّبُوا بِآيَاتِنَا وَكَانُوا عَنْهَا غَافِلِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Akan Aku palingkan dari tanda-tanda (kekuasaan-Ku) orang-orang yang menyombongkan diri di bumi tanpa alasan yang benar. Kalaupun mereka melihat setiap tanda (kekuasaan-Ku) mereka tetap tidak akan beriman kepadanya. Dan jika mereka melihat jalan yang membawa kepada petunjuk, mereka tidak (akan) menempuhnya, tetapi jika mereka melihat jalan kesesatan, mereka menempuhnya. Yang demikian adalah karena mereka mendustakan ayat-ayat Kami dan mereka selalu lengah terhadapnya."
      },
      {
        "language_name": "english",
        "text": "I will turn away from My signs those who are arrogant upon the earth without right; and if they should see every sign, they will not believe in it. And if they see the way of consciousness, they will not adopt it as a way; but if they see the way of error, they will adopt it as a way. That is because they have denied Our signs and they were heedless of them."
      }
    ],
    "verse_number": 146
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا وَلِقَاءِ الْآخِرَةِ حَبِطَتْ أَعْمَالُهُمْ ۚ هَلْ يُجْزَوْنَ إِلَّا مَا كَانُوا يَعْمَلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Those who denied Our signs and the meeting of the Hereafter -  their deeds have become worthless. Are they recompensed except for what they used to do?"
      },
      {
        "language_name": "indonesian",
        "text": "Dan orang-orang yang mendustakan tanda-tanda (kekuasaan) Kami dan (mendustakan) adanya pertemuan akhirat, sia-sialah amal mereka. Mereka diberi balasan sesuai dengan apa yang telah mereka kerjakan."
      }
    ],
    "verse_number": 147
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَاتَّخَذَ قَوْمُ مُوسَىٰ مِن بَعْدِهِ مِنْ حُلِيِّهِمْ عِجْلًا جَسَدًا لَّهُ خُوَارٌ ۚ أَلَمْ يَرَوْا أَنَّهُ لَا يُكَلِّمُهُمْ وَلَا يَهْدِيهِمْ سَبِيلًا ۘ اتَّخَذُوهُ وَكَانُوا ظَالِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan kaum Musa, setelah kepergian (Musa ke Gunung Sinai) mereka membuat patung anak sapi yang bertubuh dan dapat melenguh (bersuara) dari perhiasan (emas). Apakah mereka tidak mengetahui bahwa (patung) anak sapi itu tidak dapat berbicara dengan mereka dan tidak dapat (pula) menunjukkan jalan kepada mereka? Mereka menjadikannya (sebagai sembahan). Mereka adalah orang-orang yang zhalim."
      },
      {
        "language_name": "english",
        "text": "And the people of Moses made, after [his departure], from their ornaments a calf -  an image having a lowing sound. Did they not see that it could neither speak to them nor guide them to a way? They took it [for worship], and they were wrongdoers."
      }
    ],
    "verse_number": 148
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَمَّا سُقِطَ فِي أَيْدِيهِمْ وَرَأَوْا أَنَّهُمْ قَدْ ضَلُّوا قَالُوا لَئِن لَّمْ يَرْحَمْنَا رَبُّنَا وَيَغْفِرْ لَنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan setelah mereka menyesali perbuatannya dan mengetahui bahwa telah sesat, mereka pun berkata, “Sungguh, jika Tuhan kami tidak memberi rahmat kepada kami dan tidak mengampuni kami, pastilah kami menjadi orang-orang yang rugi.”"
      },
      {
        "language_name": "english",
        "text": "And when regret overcame them and they saw that they had gone astray, they said, \"If our Lord does not have mercy upon us and forgive us, we will surely be among the losers.\""
      }
    ],
    "verse_number": 149
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَمَّا رَجَعَ مُوسَىٰ إِلَىٰ قَوْمِهِ غَضْبَانَ أَسِفًا قَالَ بِئْسَمَا خَلَفْتُمُونِي مِن بَعْدِي ۖ أَعَجِلْتُمْ أَمْرَ رَبِّكُمْ ۖ وَأَلْقَى الْأَلْوَاحَ وَأَخَذَ بِرَأْسِ أَخِيهِ يَجُرُّهُ إِلَيْهِ ۚ قَالَ ابْنَ أُمَّ إِنَّ الْقَوْمَ اسْتَضْعَفُونِي وَكَادُوا يَقْتُلُونَنِي فَلَا تُشْمِتْ بِيَ الْأَعْدَاءَ وَلَا تَجْعَلْنِي مَعَ الْقَوْمِ الظَّالِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And when Moses returned to his people, angry and grieved, he said, \"How wretched is that by which you have replaced me after [my departure]. Were you impatient over the matter of your Lord?\" And he threw down the tablets and seized his brother by [the hair of] his head, pulling him toward him. [Aaron] said, \"O son of my mother, indeed the people oppressed me and were about to kill me, so let not the enemies rejoice over me and do not place me among the wrongdoing people.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan ketika Musa telah kembali kepada kaumnya, dengan marah dan sedih hati dia berkata, “Alangkah buruknya perbuatan yang kamu kerjakan selama kepergianku! Apakah kamu hendak mendahului janji Tuhanmu?” Musa pun melemparkan lauh-lauh (Taurat) itu dan memegang kepala saudaranya (Harun) sambil menarik ke arahnya. (Harun) berkata, “Wahai anak ibuku! Kaum ini telah menganggapku lemah dan hampir saja mereka membunuhku, sebab itu janganlah engkau menjadikan musuh-musuh menyoraki melihat kemalanganku, dan janganlah engkau jadikan aku sebagai orang-orang yang zhalim.”"
      }
    ],
    "verse_number": 150
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قَالَ رَبِّ اغْفِرْ لِي وَلِأَخِي وَأَدْخِلْنَا فِي رَحْمَتِكَ ۖ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "[Moses] said, \"My Lord, forgive me and my brother and admit us into Your mercy, for You are the most merciful of the merciful.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dia (Musa) berdoa, “Ya Tuhanku, ampunilah aku dan saudaraku dan masukkanlah kami ke dalam rahmat Engkau, dan Engkau adalah Maha Penyayang dari semua penyayang.”"
      }
    ],
    "verse_number": 151
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "إِنَّ الَّذِينَ اتَّخَذُوا الْعِجْلَ سَيَنَالُهُمْ غَضَبٌ مِّن رَّبِّهِمْ وَذِلَّةٌ فِي الْحَيَاةِ الدُّنْيَا ۚ وَكَذَٰلِكَ نَجْزِي الْمُفْتَرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Indeed, those who took the calf [for worship] will obtain anger from their Lord and humiliation in the life of this world, and thus do We recompense the inventors [of falsehood]."
      },
      {
        "language_name": "indonesian",
        "text": "Sesungguhnya orang-orang yang menjadikan (patung) anak sapi (sebagai sembahannya), kelak akan menerima kemurkaan dari Tuhan mereka dan kehinaan dalam kehidupan di dunia. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat kebohongan."
      }
    ],
    "verse_number": 152
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَالَّذِينَ عَمِلُوا السَّيِّئَاتِ ثُمَّ تَابُوا مِن بَعْدِهَا وَآمَنُوا إِنَّ رَبَّكَ مِن بَعْدِهَا لَغَفُورٌ رَّحِيمٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan orang-orang yang telah mengerjakan kejahatan, kemudian bertobat dan beriman, niscaya setelah itu Tuhanmu Maha Pengampun, Maha Penyayang."
      },
      {
        "language_name": "english",
        "text": "But those who committed misdeeds and then repented after them and believed - indeed your Lord, thereafter, is Forgiving and Merciful."
      }
    ],
    "verse_number": 153
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَمَّا سَكَتَ عَن مُّوسَى الْغَضَبُ أَخَذَ الْأَلْوَاحَ ۖ وَفِي نُسْخَتِهَا هُدًى وَرَحْمَةٌ لِّلَّذِينَ هُمْ لِرَبِّهِمْ يَرْهَبُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And when the anger subsided in Moses, he took up the tablets; and in their inscription was guidance and mercy for those who are fearful of their Lord."
      },
      {
        "language_name": "indonesian",
        "text": "Dan setelah amarah Musa mereda, diambilnya (kembali) lauh-lauh (Taurat) itu; di dalam tulisannya terdapat petunjuk dan rahmat bagi orang-orang yang takut kepada Tuhannya."
      }
    ],
    "verse_number": 154
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَاخْتَارَ مُوسَىٰ قَوْمَهُ سَبْعِينَ رَجُلًا لِّمِيقَاتِنَا ۖ فَلَمَّا أَخَذَتْهُمُ الرَّجْفَةُ قَالَ رَبِّ لَوْ شِئْتَ أَهْلَكْتَهُم مِّن قَبْلُ وَإِيَّايَ ۖ أَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَاءُ مِنَّا ۖ إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَن تَشَاءُ وَتَهْدِي مَن تَشَاءُ ۖ أَنتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنتَ خَيْرُ الْغَافِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan Musa memilih tujuh puluh orang dari kaumnya untuk (memohon tobat kepada Kami) pada waktu yang telah Kami tentukan. Ketika mereka ditimpa gempa bumi, Musa berkata, “Ya Tuhanku, jika Engkau kehendaki, tentulah Engkau binasakan mereka dan aku sebelum ini. Apakah Engkau akan membinasakan kami karena perbuatan orang-orang yang kurang berakal di antara kami? Itu hanyalah cobaan dari-Mu, Engkau sesatkan dengan cobaan itu siapa yang Engkau kehendaki dan Engkau beri petunjuk kepada siapa yang Engkau kehendaki. Engkaulah pemimpin kami, maka ampunilah kami dan berilah kami rahmat. Engkaulah pemberi ampun yang terbaik.”"
      },
      {
        "language_name": "english",
        "text": "And Moses chose from his people seventy men for Our appointment. And when the earthquake seized them, he said, \"My Lord, if You had willed, You could have destroyed them before and me [as well]. Would You destroy us for what the foolish among us have done? This is not but Your trial by which You send astray whom You will and guide whom You will. You are our Protector, so forgive us and have mercy upon us; and You are the best of forgivers."
      }
    ],
    "verse_number": 155
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَاكْتُبْ لَنَا فِي هَٰذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ ۚ قَالَ عَذَابِي أُصِيبُ بِهِ مَنْ أَشَاءُ ۖ وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ ۚ فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُم بِآيَاتِنَا يُؤْمِنُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan tetapkanlah untuk kami kebaikan di dunia ini dan di akhirat. Sungguh, kami kembali (bertobat) kepada Engkau. (Allah) berfirman, “Siksa-Ku akan Aku timpakan kepada siapa yang Aku kehendaki dan rahmat-Ku meliputi segala sesuatu. Maka akan Aku tetapkan rahmat-Ku bagi orang-orang yang bertakwa, yang menunaikan zakat dan orang-orang yang beriman kepada ayat-ayat Kami.”"
      },
      {
        "language_name": "english",
        "text": "And decree for us in this world [that which is] good and [also] in the Hereafter; indeed, we have turned back to You.\" [ Allah ] said, \"My punishment -  I afflict with it whom I will, but My mercy encompasses all things.\" So I will decree it [especially] for those who fear Me and give zakah and those who believe in Our verses -"
      }
    ],
    "verse_number": 156
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "الَّذِينَ يَتَّبِعُونَ الرَّسُولَ النَّبِيَّ الْأُمِّيَّ الَّذِي يَجِدُونَهُ مَكْتُوبًا عِندَهُمْ فِي التَّوْرَاةِ وَالْإِنجِيلِ يَأْمُرُهُم بِالْمَعْرُوفِ وَيَنْهَاهُمْ عَنِ الْمُنكَرِ وَيُحِلُّ لَهُمُ الطَّيِّبَاتِ وَيُحَرِّمُ عَلَيْهِمُ الْخَبَائِثَ وَيَضَعُ عَنْهُمْ إِصْرَهُمْ وَالْأَغْلَالَ الَّتِي كَانَتْ عَلَيْهِمْ ۚ فَالَّذِينَ آمَنُوا بِهِ وَعَزَّرُوهُ وَنَصَرُوهُ وَاتَّبَعُوا النُّورَ الَّذِي أُنزِلَ مَعَهُ ۙ أُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Those who follow the Messenger, the unlettered prophet, whom they find written in what they have of the Torah and the Gospel, who enjoins upon them what is right and forbids them what is wrong and makes lawful for them the good things and prohibits for them the evil and relieves them of their burden and the shackles which were upon them. So they who have believed in him, honored him, supported him and followed the light which was sent down with him -  it is those who will be the successful."
      },
      {
        "language_name": "indonesian",
        "text": "(Yaitu) orang-orang yang mengikuti Rasul, Nabi yang ummi (tidak bisa baca tulis) yang (namanya) mereka dapati tertulis di dalam Taurat dan Injil yang ada pada mereka, yang menyuruh mereka berbuat yang makruf dan mencegah dari yang mungkar, dan yang menghalalkan segala yang baik bagi mereka dan mengharamkan segala yang buruk bagi mereka, dan membebaskan beban-beban dan belenggu-belenggu yang ada pada mereka. Adapun orang-orang yang beriman kepadanya, memuliakannya, menolongnya dan mengikuti cahaya yang terang yang diturunkan kepadanya (Al-Qur\u0027an), mereka itulah orang-orang beruntung."
      }
    ],
    "verse_number": 157
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قُلْ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ جَمِيعًا الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ لَا إِلَٰهَ إِلَّا هُوَ يُحْيِي وَيُمِيتُ ۖ فَآمِنُوا بِاللَّهِ وَرَسُولِهِ النَّبِيِّ الْأُمِّيِّ الَّذِي يُؤْمِنُ بِاللَّهِ وَكَلِمَاتِهِ وَاتَّبِعُوهُ لَعَلَّكُمْ تَهْتَدُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, [O Muhammad], \"O mankind, indeed I am the Messenger of Allah to you all, [from Him] to whom belongs the dominion of the heavens and the earth. There is no deity except Him; He gives life and causes death.\" So believe in Allah and His Messenger, the unlettered prophet, who believes in Allah and His words, and follow him that you may be guided."
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah (Muhammad), “Wahai manusia! Sesungguhnya aku ini utusan Allah bagi kamu semua, Yang memiliki kerajaan langit dan bumi; tidak ada tuhan (yang berhak disembah) selain Dia, Yang menghidupkan dan mematikan, maka berimanlah kamu kepada Allah dan Rasul-Nya, (yaitu) Nabi yang ummi yang beriman kepada Allah dan kepada kalimat-kalimat-Nya (kitab-kitab-Nya). Ikutilah dia, agar kamu mendapat petunjuk.”"
      }
    ],
    "verse_number": 158
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَمِن قَوْمِ مُوسَىٰ أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَبِهِ يَعْدِلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan di antara kaum Musa itu terdapat suatu umat yang memberi petunjuk (kepada manusia) dengan (dasar) kebenaran dan dengan itu (pula) mereka berlaku adil menjalankan keadilan."
      },
      {
        "language_name": "english",
        "text": "And among the people of Moses is a community which guides by truth and by it establishes justice."
      }
    ],
    "verse_number": 159
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَقَطَّعْنَاهُمُ اثْنَتَيْ عَشْرَةَ أَسْبَاطًا أُمَمًا ۚ وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ إِذِ اسْتَسْقَاهُ قَوْمُهُ أَنِ اضْرِب بِّعَصَاكَ الْحَجَرَ ۖ فَانبَجَسَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا ۖ قَدْ عَلِمَ كُلُّ أُنَاسٍ مَّشْرَبَهُمْ ۚ وَظَلَّلْنَا عَلَيْهِمُ الْغَمَامَ وَأَنزَلْنَا عَلَيْهِمُ الْمَنَّ وَالسَّلْوَىٰ ۖ كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ ۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوا أَنفُسَهُمْ يَظْلِمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We divided them into twelve descendant tribes [as distinct] nations. And We inspired to Moses when his people implored him for water, \"Strike with your staff the stone,\" and there gushed forth from it twelve springs. Every people knew its watering place. And We shaded them with clouds and sent down upon them manna and quails, [saying], \"Eat from the good things with which We have provided you.\" And they wronged Us not, but they were [only] wronging themselves."
      },
      {
        "language_name": "indonesian",
        "text": "Dan Kami membagi mereka menjadi dua belas suku yang masing-masing berjumlah besar, dan Kami wahyukan kepada Musa ketika kaumnya meminta air kepadanya, “Pukullah batu itu dengan tongkatmu!” Maka memancarlah dari (batu) itu dua belas mata air. Setiap suku telah mengetahui tempat minumnya masing-masing. Dan Kami naungi mereka dengan awan dan Kami turunkan kepada mereka mann dan salwa. (Kami berfirman), “Makanlah yang baik-baik dari rezeki yang telah Kami berikan kepadamu.” Mereka tidak menzhalimi Kami, tetapi merekalah yang selalu menzhalimi dirinya sendiri."
      }
    ],
    "verse_number": 160
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِذْ قِيلَ لَهُمُ اسْكُنُوا هَٰذِهِ الْقَرْيَةَ وَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ وَقُولُوا حِطَّةٌ وَادْخُلُوا الْبَابَ سُجَّدًا نَّغْفِرْ لَكُمْ خَطِيئَاتِكُمْ ۚ سَنَزِيدُ الْمُحْسِنِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And [mention, O Muhammad], when it was said to them, \"Dwell in this city and eat from it wherever you will and say, \u0027Relieve us of our burdens,\u0027 and enter the gate bowing humbly; We will [then] forgive you your sins. We will increase the doers of good [in goodness and reward].\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan (ingatlah), ketika dikatakan kepada mereka (Bani Israil), “Diamlah di negeri ini (Baitulmaqdis) dan makanlah dari (hasil bumi)nya di mana saja kamu kehendaki.” Dan katakanlah, “Bebaskanlah kami dari dosa kami dan masukilah pintu gerbangnya sambil membungkuk, niscaya Kami ampuni kesalahan-kesalahanmu.” Kelak akan Kami tambah (pahala) kepada orang-orang yang berbuat baik."
      }
    ],
    "verse_number": 161
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَبَدَّلَ الَّذِينَ ظَلَمُوا مِنْهُمْ قَوْلًا غَيْرَ الَّذِي قِيلَ لَهُمْ فَأَرْسَلْنَا عَلَيْهِمْ رِجْزًا مِّنَ السَّمَاءِ بِمَا كَانُوا يَظْلِمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But those who wronged among them changed [the words] to a statement other than that which had been said to them. So We sent upon them a punishment from the sky for the wrong that they were doing."
      },
      {
        "language_name": "indonesian",
        "text": "Maka orang-orang yang zhalim di antara mereka mengganti (perkataan itu) dengan perkataan yang tidak dikatakan kepada mereka, maka Kami timpakan kepada mereka azab dari langit disebabkan kezhaliman mereka."
      }
    ],
    "verse_number": 162
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَاسْأَلْهُمْ عَنِ الْقَرْيَةِ الَّتِي كَانَتْ حَاضِرَةَ الْبَحْرِ إِذْ يَعْدُونَ فِي السَّبْتِ إِذْ تَأْتِيهِمْ حِيتَانُهُمْ يَوْمَ سَبْتِهِمْ شُرَّعًا وَيَوْمَ لَا يَسْبِتُونَ ۙ لَا تَأْتِيهِمْ ۚ كَذَٰلِكَ نَبْلُوهُم بِمَا كَانُوا يَفْسُقُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan tanyakanlah kepada Bani Israil tentang negeri yang terletak di dekat laut ketika mereka melanggar aturan pada hari Sabtu, (yaitu) ketika datang kepada mereka ikan-ikan (yang berada di sekitar) mereka terapung-apung di permukaan air, padahal pada hari-hari yang bukan Sabat ikan-ikan itu tidak datang kepada mereka. Demikianlah Kami menguji mereka disebabkan mereka berlaku fasik."
      },
      {
        "language_name": "english",
        "text": "And ask them about the town that was by the sea -  when they transgressed in [the matter of] the sabbath -  when their fish came to them openly on their sabbath day, and the day they had no sabbath they did not come to them. Thus did We give them trial because they were defiantly disobedient."
      }
    ],
    "verse_number": 163
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِذْ قَالَتْ أُمَّةٌ مِّنْهُمْ لِمَ تَعِظُونَ قَوْمًا ۙ اللَّهُ مُهْلِكُهُمْ أَوْ مُعَذِّبُهُمْ عَذَابًا شَدِيدًا ۖ قَالُوا مَعْذِرَةً إِلَىٰ رَبِّكُمْ وَلَعَلَّهُمْ يَتَّقُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan (ingatlah) ketika suatu umat di antara mereka berkata, “Mengapa kamu menasihati kaum yang akan dibinasakan atau diazab Allah dengan azab yang sangat keras?” Mereka menjawab, “Agar kami mempunyai alasan (lepas tanggung jawab) kepada Tuhanmu, dan agar mereka bertakwa.”"
      },
      {
        "language_name": "english",
        "text": "And when a community among them said, \"Why do you advise [or warn] a people whom Allah is [about] to destroy or to punish with a severe punishment?\" they [the advisors] said, \"To be absolved before your Lord and perhaps they may fear Him.\""
      }
    ],
    "verse_number": 164
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ أَنجَيْنَا الَّذِينَ يَنْهَوْنَ عَنِ السُّوءِ وَأَخَذْنَا الَّذِينَ ظَلَمُوا بِعَذَابٍ بَئِيسٍ بِمَا كَانُوا يَفْسُقُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka setelah mereka melupakan apa yang diperingatkan kepada mereka, Kami selamatkan orang-orang yang melarang orang berbuat jahat dan Kami timpakan kepada orang-orang yang zhalim siksaan yang keras, disebabkan mereka selalu berbuat fasik."
      },
      {
        "language_name": "english",
        "text": "And when they forgot that by which they had been reminded, We saved those who had forbidden evil and seized those who wronged, with a wretched punishment, because they were defiantly disobeying."
      }
    ],
    "verse_number": 165
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَلَمَّا عَتَوْا عَن مَّا نُهُوا عَنْهُ قُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "So when they were insolent about that which they had been forbidden, We said to them, \"Be apes, despised.\""
      },
      {
        "language_name": "indonesian",
        "text": "Maka setelah mereka bersikap sombong terhadap segala apa yang dilarang. Kami katakan kepada mereka, “Jadilah kamu kera yang hina.”"
      }
    ],
    "verse_number": 166
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِذْ تَأَذَّنَ رَبُّكَ لَيَبْعَثَنَّ عَلَيْهِمْ إِلَىٰ يَوْمِ الْقِيَامَةِ مَن يَسُومُهُمْ سُوءَ الْعَذَابِ ۗ إِنَّ رَبَّكَ لَسَرِيعُ الْعِقَابِ ۖ وَإِنَّهُ لَغَفُورٌ رَّحِيمٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "And [mention] when your Lord declared that He would surely [continue to] send upon them until the Day of Resurrection those who would afflict them with the worst torment. Indeed, your Lord is swift in penalty; but indeed, He is Forgiving and Merciful."
      },
      {
        "language_name": "indonesian",
        "text": "Dan (ingatlah), ketika Tuhanmu memberitahukan, bahwa sungguh, Dia akan mengirim orang-orang yang akan menimpakan azab yang seburuk-buruknya kepada mereka (orang Yahudi) sampai hari Kiamat. Sesungguhnya Tuhanmu sangat cepat siksa-Nya, dan sesungguhnya Dia Maha Pengampun, Maha Penyayang."
      }
    ],
    "verse_number": 167
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَقَطَّعْنَاهُمْ فِي الْأَرْضِ أُمَمًا ۖ مِّنْهُمُ الصَّالِحُونَ وَمِنْهُمْ دُونَ ذَٰلِكَ ۖ وَبَلَوْنَاهُم بِالْحَسَنَاتِ وَالسَّيِّئَاتِ لَعَلَّهُمْ يَرْجِعُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan Kami pecahkan mereka di dunia ini menjadi beberapa golongan; di antaranya ada orang-orang yang shalih dan ada yang tidak demikian. Dan Kami uji mereka dengan (nikmat) yang baik-baik dan (bencana) yang buruk-buruk, agar mereka kembali (kepada kebenaran)."
      },
      {
        "language_name": "english",
        "text": "And We divided them throughout the earth into nations.  Of them some were righteous, and of them some were otherwise. And We tested them with good [times] and bad that perhaps they would return [to obedience]."
      }
    ],
    "verse_number": 168
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَخَلَفَ مِن بَعْدِهِمْ خَلْفٌ وَرِثُوا الْكِتَابَ يَأْخُذُونَ عَرَضَ هَٰذَا الْأَدْنَىٰ وَيَقُولُونَ سَيُغْفَرُ لَنَا وَإِن يَأْتِهِمْ عَرَضٌ مِّثْلُهُ يَأْخُذُوهُ ۚ أَلَمْ يُؤْخَذْ عَلَيْهِم مِّيثَاقُ الْكِتَابِ أَن لَّا يَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ وَدَرَسُوا مَا فِيهِ ۗ وَالدَّارُ الْآخِرَةُ خَيْرٌ لِّلَّذِينَ يَتَّقُونَ ۗ أَفَلَا تَعْقِلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And there followed them successors who inherited the Scripture [while] taking the commodities of this lower life and saying, \"It will be forgiven for us.\" And if an offer like it comes to them, they will [again] take it. Was not the covenant of the Scripture taken from them that they would not say about Allah except the truth, and they studied what was in it? And the home of the Hereafter is better for those who fear Allah, so will you not use reason?"
      },
      {
        "language_name": "indonesian",
        "text": "Maka setelah mereka, datanglah generasi (yang jahat) yang mewarisi Taurat, yang mengambil harta benda dunia yang rendah ini. Lalu mereka berkata, “Kami akan diberi ampun.” Dan kelak jika harta benda dunia datang kepada mereka sebanyak itu (pula), niscaya mereka akan mengambilnya (juga). Bukankah mereka sudah terikat perjanjian dalam Kitab (Taurat) bahwa mereka tidak akan mengatakan terhadap Allah, kecuali yang benar, padahal mereka telah mempelajari apa yang tersebut di dalamnya? Negeri akhirat itu lebih baik bagi mereka yang bertakwa. Maka tidakkah kamu mengerti?"
      }
    ],
    "verse_number": 169
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَالَّذِينَ يُمَسِّكُونَ بِالْكِتَابِ وَأَقَامُوا الصَّلَاةَ إِنَّا لَا نُضِيعُ أَجْرَ الْمُصْلِحِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan orang-orang yang berpegang teguh pada Kitab (Taurat) serta melaksanakan shalat, (akan diberi pahala). Sungguh, Kami tidak akan menghilangkan pahala orang-orang shalih."
      },
      {
        "language_name": "english",
        "text": "But those who hold fast to the Book and establish prayer -  indeed, We will not allow to be lost the reward of the reformers."
      }
    ],
    "verse_number": 170
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِذْ نَتَقْنَا الْجَبَلَ فَوْقَهُمْ كَأَنَّهُ ظُلَّةٌ وَظَنُّوا أَنَّهُ وَاقِعٌ بِهِمْ خُذُوا مَا آتَيْنَاكُم بِقُوَّةٍ وَاذْكُرُوا مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And [mention] when We raised the mountain above them as if it was a dark cloud and they were certain that it would fall upon them, [and Allah said], \"Take what We have given you with determination and remember what is in it that you might fear Allah .\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan (ingatlah) ketika Kami mengangkat gunung ke atas mereka, seakan-akan (gunung) itu naungan awan dan mereka yakin bahwa (gunung) itu akan jatuh menimpa mereka. (Dan Kami firmankan kepada mereka), “Peganglah dengan teguh apa yang telah Kami berikan kepadamu, serta ingatlah selalu (amalkanlah) apa yang tersebut di dalamnya agar kamu menjadi orang-orang bertakwa.”"
      }
    ],
    "verse_number": 171
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِذْ أَخَذَ رَبُّكَ مِن بَنِي آدَمَ مِن ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَىٰ أَنفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ ۖ قَالُوا بَلَىٰ ۛ شَهِدْنَا ۛ أَن تَقُولُوا يَوْمَ الْقِيَامَةِ إِنَّا كُنَّا عَنْ هَٰذَا غَافِلِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And [mention] when your Lord took from the children of Adam -  from their loins - their descendants and made them testify of themselves, [saying to them], \"Am I not your Lord?\" They said, \"Yes, we have testified.\" [This] -  lest you should say on the day of Resurrection, \"Indeed, we were of this unaware.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan (ingatlah) ketika Tuhanmu mengeluarkan dari sulbi (tulang belakang) anak cucu Adam keturunan mereka dan Allah mengambil kesaksian terhadap roh mereka (seraya berfirman), “Bukankah Aku ini Tuhanmu?” Mereka menjawab, “Betul (Engkau Tuhan kami), kami bersaksi.” (Kami lakukan yang demikian itu) agar di hari Kiamat kamu tidak mengatakan, “Sesungguhnya ketika itu kami lengah terhadap ini.”"
      }
    ],
    "verse_number": 172
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "أَوْ تَقُولُوا إِنَّمَا أَشْرَكَ آبَاؤُنَا مِن قَبْلُ وَكُنَّا ذُرِّيَّةً مِّن بَعْدِهِمْ ۖ أَفَتُهْلِكُنَا بِمَا فَعَلَ الْمُبْطِلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Atau agar kamu mengatakan, “Sesungguhnya nenek moyang kami telah mempersekutukan Tuhan sejak dahulu, sedang kami adalah keturunan yang (datang) setelah mereka. Maka apakah Engkau akan membinasakan kami karena perbuatan orang-orang (dahulu) yang sesat?”"
      },
      {
        "language_name": "english",
        "text": "Or [lest] you say, \"It was only that our fathers associated [others in worship] with Allah before, and we were but descendants after them. Then would You destroy us for what the falsifiers have done?\""
      }
    ],
    "verse_number": 173
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَكَذَٰلِكَ نُفَصِّلُ الْآيَاتِ وَلَعَلَّهُمْ يَرْجِعُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan demikianlah Kami menjelaskan ayat-ayat itu, agar mereka kembali (kepada kebenaran)."
      },
      {
        "language_name": "english",
        "text": "And thus do We [explain in] detail the verses, and perhaps they will return."
      }
    ],
    "verse_number": 174
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَاتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْنَاهُ آيَاتِنَا فَانسَلَخَ مِنْهَا فَأَتْبَعَهُ الشَّيْطَانُ فَكَانَ مِنَ الْغَاوِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And recite to them, [O Muhammad], the news of him to whom we gave [knowledge of] Our signs, but he detached himself from them; so Satan pursued him, and he became of the deviators."
      },
      {
        "language_name": "indonesian",
        "text": "Dan bacakanlah (Muhammad) kepada mereka, berita orang yang telah Kami berikan ayat-ayat Kami kepadanya, kemudian dia melepaskan diri dari ayat-ayat itu, lalu dia diikuti oleh setan (sampai dia tergoda), maka jadilah dia termasuk orang yang sesat."
      }
    ],
    "verse_number": 175
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَوْ شِئْنَا لَرَفَعْنَاهُ بِهَا وَلَٰكِنَّهُ أَخْلَدَ إِلَى الْأَرْضِ وَاتَّبَعَ هَوَاهُ ۚ فَمَثَلُهُ كَمَثَلِ الْكَلْبِ إِن تَحْمِلْ عَلَيْهِ يَلْهَثْ أَوْ تَتْرُكْهُ يَلْهَث ۚ ذَّٰلِكَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۚ فَاقْصُصِ الْقَصَصَ لَعَلَّهُمْ يَتَفَكَّرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan sekiranya Kami menghendaki niscaya Kami tinggikan (derajat)nya dengan (ayat-ayat) itu, tetapi dia cenderung kepada dunia dan mengikuti keinginannya (yang rendah), maka perumpamaannya seperti anjing, jika kamu menghalaunya dijulurkan lidahnya dan jika kamu membiarkannya dia menjulurkan lidahnya (juga). Demikianlah perumpamaan orang-orang yang mendustakan ayat-ayat Kami. Maka ceritakanlah kisah-kisah itu agar mereka berpikir."
      },
      {
        "language_name": "english",
        "text": "And if We had willed, we could have elevated him thereby, but he adhered [instead] to the earth and followed his own desire. So his example is like that of the dog: if you chase him, he pants, or if you leave him, he [still] pants. That is the example of the people who denied Our signs. So relate the stories that perhaps they will give thought."
      }
    ],
    "verse_number": 176
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "سَاءَ مَثَلًا الْقَوْمُ الَّذِينَ كَذَّبُوا بِآيَاتِنَا وَأَنفُسَهُمْ كَانُوا يَظْلِمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sangat buruk perumpamaan orang-orang yang mendustakan ayat-ayat Kami; mereka menzhalimi diri sendiri."
      },
      {
        "language_name": "english",
        "text": "How evil an example [is that of] the people who denied Our signs and used to wrong themselves."
      }
    ],
    "verse_number": 177
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "مَن يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِي ۖ وَمَن يُضْلِلْ فَأُولَٰئِكَ هُمُ الْخَاسِرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Whoever Allah guides -  he is the [rightly] guided; and whoever He sends astray -  it is those who are the losers."
      },
      {
        "language_name": "indonesian",
        "text": "Barangsiapa diberi petunjuk oleh Allah, maka dialah yang mendapat petunjuk; dan barangsiapa disesatkan Allah, maka merekalah orang-orang yang rugi."
      }
    ],
    "verse_number": 178
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَقَدْ ذَرَأْنَا لِجَهَنَّمَ كَثِيرًا مِّنَ الْجِنِّ وَالْإِنسِ ۖ لَهُمْ قُلُوبٌ لَّا يَفْقَهُونَ بِهَا وَلَهُمْ أَعْيُنٌ لَّا يُبْصِرُونَ بِهَا وَلَهُمْ آذَانٌ لَّا يَسْمَعُونَ بِهَا ۚ أُولَٰئِكَ كَالْأَنْعَامِ بَلْ هُمْ أَضَلُّ ۚ أُولَٰئِكَ هُمُ الْغَافِلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We have certainly created for Hell many of the jinn and mankind. They have hearts with which they do not understand, they have eyes with which they do not see, and they have ears with which they do not hear. Those are like livestock; rather, they are more astray. It is they who are the heedless."
      },
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, akan Kami isi neraka Jahanam banyak dari kalangan jin dan manusia. Mereka memiliki hati, tetapi tidak dipergunakannya untuk memahami (ayat-ayat Allah) dan mereka memiliki mata (tetapi) tidak dipergunakannya untuk melihat (tanda-tanda kekuasaan Allah), dan mereka mempunyai telinga (tetapi) tidak dipergunakannya untuk mendengarkan (ayat-ayat Allah). Mereka seperti hewan ternak, bahkan lebih sesat lagi. Mereka itulah orang-orang yang lengah."
      }
    ],
    "verse_number": 179
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ فَادْعُوهُ بِهَا ۖ وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمَائِهِ ۚ سَيُجْزَوْنَ مَا كَانُوا يَعْمَلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And to Allah belong the best names, so invoke Him by them. And leave [the company of] those who practice deviation concerning His names. They will be recompensed for what they have been doing."
      },
      {
        "language_name": "indonesian",
        "text": "Dan Allah memiliki Asma\u0027ul-Husna (nama-nama yang terbaik), maka bermohonlah kepada-Nya dengan menyebutnya Asma\u0027ul-Husna itu dan tinggalkanlah orang-orang yang menyalahartikan nama-nama-Nya. Mereka kelak akan mendapat balasan terhadap apa yang telah mereka kerjakan."
      }
    ],
    "verse_number": 180
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَمِمَّنْ خَلَقْنَا أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَبِهِ يَعْدِلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan di antara orang-orang yang telah Kami ciptakan ada umat yang memberi petunjuk dengan (dasar) kebenaran, dan dengan itu (pula) mereka berlaku adil."
      },
      {
        "language_name": "english",
        "text": "And among those We created is a community which guides by truth and thereby establishes justice."
      }
    ],
    "verse_number": 181
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا سَنَسْتَدْرِجُهُم مِّنْ حَيْثُ لَا يَعْلَمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But those who deny Our signs -  We will progressively lead them [to destruction] from where they do not know."
      },
      {
        "language_name": "indonesian",
        "text": "Dan orang-orang yang mendustakan ayat-ayat Kami, akan Kami biarkan mereka berangsur-angsur (ke arah kebinasaan), dengan cara yang tidak mereka ketahui."
      }
    ],
    "verse_number": 182
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَأُمْلِي لَهُمْ ۚ إِنَّ كَيْدِي مَتِينٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "And I will give them time. Indeed, my plan is firm."
      },
      {
        "language_name": "indonesian",
        "text": "Dan Aku akan memberikan tenggang waktu kepada mereka. Sungguh, rencana-Ku sangat teguh."
      }
    ],
    "verse_number": 183
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "أَوَلَمْ يَتَفَكَّرُوا ۗ مَا بِصَاحِبِهِم مِّن جِنَّةٍ ۚ إِنْ هُوَ إِلَّا نَذِيرٌ مُّبِينٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan apakah mereka tidak merenungkan bahwa teman mereka (Muhammad) tidak gila. Dia (Muhammad) tidak lain hanyalah seorang pemberi peringatan yang jelas."
      },
      {
        "language_name": "english",
        "text": "Then do they not give thought? There is in their companion [Muhammad] no madness. He is not but a clear warner."
      }
    ],
    "verse_number": 184
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "أَوَلَمْ يَنظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ وَمَا خَلَقَ اللَّهُ مِن شَيْءٍ وَأَنْ عَسَىٰ أَن يَكُونَ قَدِ اقْتَرَبَ أَجَلُهُمْ ۖ فَبِأَيِّ حَدِيثٍ بَعْدَهُ يُؤْمِنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Do they not look into the realm of the heavens and the earth and everything that Allah has created and [think] that perhaps their appointed time has come near? So in what statement hereafter will they believe?"
      },
      {
        "language_name": "indonesian",
        "text": "Dan apakah mereka tidak memperhatikan kerajaan langit dan bumi dan segala apa yang diciptakan Allah, dan kemungkinan telah dekatnya waktu (kebinasaan) mereka? Lalu berita mana lagi setelah ini yang akan mereka percayai?"
      }
    ],
    "verse_number": 185
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "مَن يُضْلِلِ اللَّهُ فَلَا هَادِيَ لَهُ ۚ وَيَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Barangsiapa dibiarkan sesat oleh Allah, maka tidak ada yang mampu memberi petunjuk. Allah membiarkannya terombang-ambing dalam kesesatan."
      },
      {
        "language_name": "english",
        "text": "Whoever Allah sends astray -  there is no guide for him. And He leaves them in their transgression, wandering blindly."
      }
    ],
    "verse_number": 186
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "يَسْأَلُونَكَ عَنِ السَّاعَةِ أَيَّانَ مُرْسَاهَا ۖ قُلْ إِنَّمَا عِلْمُهَا عِندَ رَبِّي ۖ لَا يُجَلِّيهَا لِوَقْتِهَا إِلَّا هُوَ ۚ ثَقُلَتْ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ لَا تَأْتِيكُمْ إِلَّا بَغْتَةً ۗ يَسْأَلُونَكَ كَأَنَّكَ حَفِيٌّ عَنْهَا ۖ قُلْ إِنَّمَا عِلْمُهَا عِندَ اللَّهِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Mereka menanyakan kepadamu (Muhammad) tentang Kiamat, “Kapan terjadi?” Katakanlah, “Sesungguhnya pengetahuan tentang Kiamat itu ada pada Tuhanku; tidak ada (seorang pun) yang dapat menjelaskan waktu terjadinya selain Dia. (Kiamat) itu sangat berat (huru-haranya bagi makhluk) yang di langit dan di bumi, tidak akan datang kepadamu kecuali secara tiba-tiba.” Mereka bertanya kepadamu seakan-akan engkau mengetahuinya. Katakanlah (Muhammad), “Sesungguhnya pengetahuan tentang (hari Kiamat) ada pada Allah, tetapi kebanyakan manusia tidak mengetahui.”"
      },
      {
        "language_name": "english",
        "text": "They ask you, [O Muhammad], about the Hour: when is its arrival? Say, \"Its knowledge is only with my Lord. None will reveal its time except Him. It lays heavily upon the heavens and the earth. It will not come upon you except unexpectedly.\" They ask you as if you are familiar with it. Say, \"Its knowledge is only with Allah, but most of the people do not know.\""
      }
    ],
    "verse_number": 187
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "قُل لَّا أَمْلِكُ لِنَفْسِي نَفْعًا وَلَا ضَرًّا إِلَّا مَا شَاءَ اللَّهُ ۚ وَلَوْ كُنتُ أَعْلَمُ الْغَيْبَ لَاسْتَكْثَرْتُ مِنَ الْخَيْرِ وَمَا مَسَّنِيَ السُّوءُ ۚ إِنْ أَنَا إِلَّا نَذِيرٌ وَبَشِيرٌ لِّقَوْمٍ يُؤْمِنُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Katakanlah (Muhammad), “Aku tidak kuasa mendatangkan manfaat maupun menolak mudarat bagi diriku kecuali apa yang dikehendaki Allah. Sekiranya aku mengetahui yang gaib, niscaya aku membuat kebajikan sebanyak-banyaknya dan tidak akan ditimpa bahaya. Aku hanyalah pemberi peringatan, dan pembawa berita gembira bagi orang-orang yang beriman.”"
      },
      {
        "language_name": "english",
        "text": "Say, \"I hold not for myself [the power of] benefit or harm, except what Allah has willed. And if I knew the unseen, I could have acquired much wealth, and no harm would have touched me. I am not except a warner and a bringer of good tidings to a people who believe.\""
      }
    ],
    "verse_number": 188
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "هُوَ الَّذِي خَلَقَكُم مِّن نَّفْسٍ وَاحِدَةٍ وَجَعَلَ مِنْهَا زَوْجَهَا لِيَسْكُنَ إِلَيْهَا ۖ فَلَمَّا تَغَشَّاهَا حَمَلَتْ حَمْلًا خَفِيفًا فَمَرَّتْ بِهِ ۖ فَلَمَّا أَثْقَلَت دَّعَوَا اللَّهَ رَبَّهُمَا لَئِنْ آتَيْتَنَا صَالِحًا لَّنَكُونَنَّ مِنَ الشَّاكِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dialah yang menciptakan kamu dari jiwa yang satu (Adam) dan daripadanya Dia menciptakan pasangannya, agar dia merasa senang kepadanya. Maka setelah dicampurinya, (istrinya) mengandung kandungan yang ringan, dan teruslah dia merasa ringan (beberapa waktu). Kemudian ketika dia merasa berat, keduanya (suami istri) bermohon kepada Allah, Tuhan Mereka (seraya berkata), “Jika Engkau memberi kami anak yang shalih, tentulah kami akan selalu bersyukur.”"
      },
      {
        "language_name": "english",
        "text": "It is He who created you from one soul and created from it its mate that he might dwell in security with her. And when he covers her, she carries a light burden and continues therein. And when it becomes heavy, they both invoke Allah, their Lord, \"If You should give us a good [child], we will surely be among the grateful.\""
      }
    ],
    "verse_number": 189
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "فَلَمَّا آتَاهُمَا صَالِحًا جَعَلَا لَهُ شُرَكَاءَ فِيمَا آتَاهُمَا ۚ فَتَعَالَى اللَّهُ عَمَّا يُشْرِكُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But when He gives them a good [child], they ascribe partners to Him concerning that which He has given them. Exalted is Allah above what they associate with Him."
      },
      {
        "language_name": "indonesian",
        "text": "Maka setelah Dia memberi keduanya seorang anak yang shalih, mereka menjadikan sekutu bagi Allah terhadap anak yang telah dianugerahkan-Nya itu. Maka Mahatinggi Allah dari apa yang mereka persekutukan."
      }
    ],
    "verse_number": 190
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "أَيُشْرِكُونَ مَا لَا يَخْلُقُ شَيْئًا وَهُمْ يُخْلَقُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Mengapa mereka mempersekutukan (Allah dengan) sesuatu (berhala) yang tidak dapat menciptakan sesuatu apa pun? Padahal (berhala) itu sendiri diciptakan."
      },
      {
        "language_name": "english",
        "text": "Do they associate with Him those who create nothing and they are [themselves] created?"
      }
    ],
    "verse_number": 191
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَلَا يَسْتَطِيعُونَ لَهُمْ نَصْرًا وَلَا أَنفُسَهُمْ يَنصُرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan (berhala) itu tidak dapat memberikan pertolongan kepada penyembahnya, dan kepada dirinya sendiri pun mereka tidak dapat memberi pertolongan."
      },
      {
        "language_name": "english",
        "text": "And the false deities are unable to [give] them help, nor can they help themselves."
      }
    ],
    "verse_number": 192
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِن تَدْعُوهُمْ إِلَى الْهُدَىٰ لَا يَتَّبِعُوكُمْ ۚ سَوَاءٌ عَلَيْكُمْ أَدَعَوْتُمُوهُمْ أَمْ أَنتُمْ صَامِتُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan jika kamu (wahai orang-orang musyrik) menyerunya (berhala-berhala) untuk memberi petunjuk kepadamu, tidaklah berhala-berhala itu dapat memperkenankan seruanmu; sama saja (hasilnya) buat kamu menyeru mereka atau berdiam diri."
      },
      {
        "language_name": "english",
        "text": "And if you [believers] invite them to guidance, they will not follow you. It is all the same for you whether you invite them or you are silent."
      }
    ],
    "verse_number": 193
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "إِنَّ الَّذِينَ تَدْعُونَ مِن دُونِ اللَّهِ عِبَادٌ أَمْثَالُكُمْ ۖ فَادْعُوهُمْ فَلْيَسْتَجِيبُوا لَكُمْ إِن كُنتُمْ صَادِقِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sesungguhnya mereka (berhala-berhala) yang kamu seru selain Allah adalah makhluk (yang lemah) yang serupa juga dengan kamu. Maka serulah mereka lalu biarkanlah mereka memperkenankan permintaanmu, jika kamu orang yang benar."
      },
      {
        "language_name": "english",
        "text": "Indeed, those you [polytheists] call upon besides Allah are servants like you. So call upon them and let them respond to you, if you should be truthful."
      }
    ],
    "verse_number": 194
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "أَلَهُمْ أَرْجُلٌ يَمْشُونَ بِهَا ۖ أَمْ لَهُمْ أَيْدٍ يَبْطِشُونَ بِهَا ۖ أَمْ لَهُمْ أَعْيُنٌ يُبْصِرُونَ بِهَا ۖ أَمْ لَهُمْ آذَانٌ يَسْمَعُونَ بِهَا ۗ قُلِ ادْعُوا شُرَكَاءَكُمْ ثُمَّ كِيدُونِ فَلَا تُنظِرُونِ",
    "translations": [
      {
        "language_name": "english",
        "text": "Do they have feet by which they walk? Or do they have hands by which they strike? Or do they have eyes by which they see? Or do they have ears by which they hear? Say, [O Muhammad], \"Call your \u0027partners\u0027 and then conspire against me and give me no respite."
      },
      {
        "language_name": "indonesian",
        "text": "Apakah mereka (berhala-berhala) mempunyai kaki untuk berjalan, atau mempunyai tangan untuk memegang dengan keras, atau mempunyai mata untuk melihat, atau mempunyai telinga untuk mendengar? Katakanlah (Muhammad), “Panggillah (berhala-berhalamu) yang kamu anggap sekutu Allah, kemudian lakukanlah tipu daya (untuk mencelakakan)ku, dan jangan kamu tunda lagi."
      }
    ],
    "verse_number": 195
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "إِنَّ وَلِيِّيَ اللَّهُ الَّذِي نَزَّلَ الْكِتَابَ ۖ وَهُوَ يَتَوَلَّى الصَّالِحِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Indeed, my protector is Allah, who has sent down the Book; and He is an ally to the righteous."
      },
      {
        "language_name": "indonesian",
        "text": "Sesungguhnya pelindungku adalah Allah yang telah menurunkan Kitab (Al-Qur\u0027an). Dia melindungi orang-orang shalih."
      }
    ],
    "verse_number": 196
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَالَّذِينَ تَدْعُونَ مِن دُونِهِ لَا يَسْتَطِيعُونَ نَصْرَكُمْ وَلَا أَنفُسَهُمْ يَنصُرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan berhala-berhala yang kamu seru selain Allah tidaklah sanggup menolongmu, bahkan tidak dapat menolong dirinya sendiri.”"
      },
      {
        "language_name": "english",
        "text": "And those you call upon besides Him are unable to help you, nor can they help themselves.\""
      }
    ],
    "verse_number": 197
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِن تَدْعُوهُمْ إِلَى الْهُدَىٰ لَا يَسْمَعُوا ۖ وَتَرَاهُمْ يَنظُرُونَ إِلَيْكَ وَهُمْ لَا يُبْصِرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And if you invite them to guidance, they do not hear; and you see them looking at you while they do not see."
      },
      {
        "language_name": "indonesian",
        "text": "Dan jika kamu menyeru mereka (berhala-berhala) untuk memberi petunjuk, mereka tidak dapat mendengarnya. Dan kamu lihat mereka memandangmu padahal mereka tidak melihat."
      }
    ],
    "verse_number": 198
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Take what is given freely, enjoin what is good, and turn away from the ignorant."
      },
      {
        "language_name": "indonesian",
        "text": "Jadilah pemaaf dan suruhlah orang mengerjakan yang makruf, serta jangan pedulikan orang-orang yang bodoh."
      }
    ],
    "verse_number": 199
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِمَّا يَنزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ ۚ إِنَّهُ سَمِيعٌ عَلِيمٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan jika setan datang menggodamu, maka berlindunglah kepada Allah. Sungguh, Dia Maha Mendengar, Maha Mengetahui."
      },
      {
        "language_name": "english",
        "text": "And if an evil suggestion comes to you from Satan, then seek refuge in Allah . Indeed, He is Hearing and Knowing."
      }
    ],
    "verse_number": 200
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "إِنَّ الَّذِينَ اتَّقَوْا إِذَا مَسَّهُمْ طَائِفٌ مِّنَ الشَّيْطَانِ تَذَكَّرُوا فَإِذَا هُم مُّبْصِرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sesungguhnya orang-orang yang bertakwa apabila mereka dibayang-bayangi pikiran jahat (berbuat dosa) dari setan, mereka pun segera ingat kepada Allah, maka ketika itu juga mereka melihat (kesalahan-kesalahannya)."
      },
      {
        "language_name": "english",
        "text": "Indeed, those who fear Allah -  when an impulse touches them from Satan, they remember [Him] and at once they have insight."
      }
    ],
    "verse_number": 201
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِخْوَانُهُمْ يَمُدُّونَهُمْ فِي الْغَيِّ ثُمَّ لَا يُقْصِرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But their brothers -  the devils increase them in error; then they do not stop short."
      },
      {
        "language_name": "indonesian",
        "text": "Dan teman-teman mereka (orang kafir dan fasik) membantu setan-setan dalam menyesatkan dan mereka tidak henti-hentinya (menyesatkan)."
      }
    ],
    "verse_number": 202
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِذَا لَمْ تَأْتِهِم بِآيَةٍ قَالُوا لَوْلَا اجْتَبَيْتَهَا ۚ قُلْ إِنَّمَا أَتَّبِعُ مَا يُوحَىٰ إِلَيَّ مِن رَّبِّي ۚ هَٰذَا بَصَائِرُ مِن رَّبِّكُمْ وَهُدًى وَرَحْمَةٌ لِّقَوْمٍ يُؤْمِنُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan apabila engkau (Muhammad) tidak membacakan suatu ayat kepada mereka, mereka berkata, “Mengapa tidak engkau buat sendiri ayat itu?” Katakanlah (Muhammad), “Sesungguhnya aku hanya mengikuti apa yang diwahyukan Tuhanku kepadaku. (Al-Qur\u0027an) ini adalah bukti-bukti yang nyata dari Tuhanmu, petunjuk dan rahmat bagi orang-orang yang beriman.”"
      },
      {
        "language_name": "english",
        "text": "And when you, [O Muhammad], do not bring them a sign, they say, \"Why have you not contrived it?\" Say, \"I only follow what is revealed to me from my Lord. This [Qur\u0027an] is enlightenment from your Lord and guidance and mercy for a people who believe.\""
      }
    ],
    "verse_number": 203
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَأَنصِتُوا لَعَلَّكُمْ تُرْحَمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "So when the Qur\u0027an is recited, then listen to it and pay attention that you may receive mercy."
      },
      {
        "language_name": "indonesian",
        "text": "Dan apabila dibacakan Al-Qur\u0027an, maka dengarkanlah dan diamlah, agar kamu mendapat rahmat."
      }
    ],
    "verse_number": 204
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "وَاذْكُر رَّبَّكَ فِي نَفْسِكَ تَضَرُّعًا وَخِيفَةً وَدُونَ الْجَهْرِ مِنَ الْقَوْلِ بِالْغُدُوِّ وَالْآصَالِ وَلَا تَكُن مِّنَ الْغَافِلِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan ingatlah Tuhanmu dalam hatimu dengan rendah hati dan rasa takut, dan dengan tidak mengeraskan suara, pada waktu pagi dan petang, dan janganlah kamu termasuk orang-orang yang lengah."
      },
      {
        "language_name": "english",
        "text": "And remember your Lord within yourself in humility and in fear without being apparent in speech -  in the mornings and the evenings. And do not be among the heedless."
      }
    ],
    "verse_number": 205
  },
  {
    "chapter_id": 7,
    "juz_number": 9,
    "text_madani": "إِنَّ الَّذِينَ عِندَ رَبِّكَ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَيُسَبِّحُونَهُ وَلَهُ يَسْجُدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sesungguhnya orang-orang yang ada di sisi Tuhanmu tidak merasa enggan untuk menyembah Allah dan mereka menyucikan-Nya dan hanya kepada-Nya mereka bersujud."
      },
      {
        "language_name": "english",
        "text": "Indeed, those who are near your Lord are not prevented by arrogance from His worship, and they exalt Him, and to Him they prostrate."
      }
    ],
    "verse_number": 206
  }
]