[
  {
    "chapter_id": 98,
    "juz_number": 30,
    "text_madani": "لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنفَكِّينَ حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ",
    "use_bismillah": true,
    "translations": [
      {
        "language_name": "english",
        "text": "Those who disbelieved among the People of the Scripture and the polytheists were not to be parted [from misbelief] until there came to them clear evidence -"
      },
      {
        "language_name": "indonesian",
        "text": "Orang-orang yang kafir dari golongan Ahli Kitab dan orang-orang musyrik tidak akan meninggalkan (agama mereka) sampai datang kepada mereka bukti yang nyata,"
      }
    ],
    "verse_number": 1
  },
  {
    "chapter_id": 98,
    "juz_number": 30,
    "text_madani": "رَسُولٌ مِّنَ اللَّهِ يَتْلُو صُحُفًا مُّطَهَّرَةً",
    "translations": [
      {
        "language_name": "english",
        "text": "A Messenger from Allah, reciting purified scriptures"
      },
      {
        "language_name": "indonesian",
        "text": "(yaitu) seorang Rasul dari Allah (Muhammad) yang membacakan lembaran-lembaran yang suci (Al-Qur\u0027an),"
      }
    ],
    "verse_number": 2
  },
  {
    "chapter_id": 98,
    "juz_number": 30,
    "text_madani": "فِيهَا كُتُبٌ قَيِّمَةٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "Within which are correct writings."
      },
      {
        "language_name": "indonesian",
        "text": "di dalamnya terdapat (isi) kitab-kitab yang lurus (benar)."
      }
    ],
    "verse_number": 3
  },
  {
    "chapter_id": 98,
    "juz_number": 30,
    "text_madani": "وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan tidaklah terpecah-belah orang-orang Ahli Kitab melainkan setelah datang kepada mereka bukti yang nyata."
      },
      {
        "language_name": "english",
        "text": "Nor did those who were given the Scripture become divided until after there had come to them clear evidence."
      }
    ],
    "verse_number": 4
  },
  {
    "chapter_id": 98,
    "juz_number": 30,
    "text_madani": "وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ ۚ وَذَٰلِكَ دِينُ الْقَيِّمَةِ",
    "translations": [
      {
        "language_name": "english",
        "text": "And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakah. And that is the correct religion."
      },
      {
        "language_name": "indonesian",
        "text": "Padahal mereka hanya diperintah menyembah Allah dengan ikhlas menaati-Nya semata-mata karena (menjalankan) agama, dan juga agar melaksanakan shalat dan menunaikan zakat; dan yang demikian itulah agama yang lurus (benar)."
      }
    ],
    "verse_number": 5
  },
  {
    "chapter_id": 98,
    "juz_number": 30,
    "text_madani": "إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ أُولَٰئِكَ هُمْ شَرُّ الْبَرِيَّةِ",
    "translations": [
      {
        "language_name": "english",
        "text": "Indeed, they who disbelieved among the People of the Scripture and the polytheists will be in the fire of Hell, abiding eternally therein. Those are the worst of creatures."
      },
      {
        "language_name": "indonesian",
        "text": "Sungguh, orang-orang yang kafir dari golongan Ahli Kitab dan orang-orang musyrik (akan masuk) ke neraka Jahanam; mereka kekal di dalamnya selama-lamanya. Mereka itu adalah sejahat-jahat makhluk."
      }
    ],
    "verse_number": 6
  },
  {
    "chapter_id": 98,
    "juz_number": 30,
    "text_madani": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ هُمْ خَيْرُ الْبَرِيَّةِ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sungguh, orang-orang yang beriman dan mengerjakan kebajikan, mereka itu adalah sebaik-baik makhluk."
      },
      {
        "language_name": "english",
        "text": "Indeed, they who have believed and done righteous deeds -  those are the best of creatures."
      }
    ],
    "verse_number": 7
  },
  {
    "chapter_id": 98,
    "juz_number": 30,
    "text_madani": "جَزَاؤُهُمْ عِندَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِيَ رَبَّهُ",
    "translations": [
      {
        "language_name": "english",
        "text": "Their reward with Allah will be gardens of perpetual residence beneath which rivers flow, wherein they will abide forever, Allah being pleased with them and they with Him. That is for whoever has feared his Lord."
      },
      {
        "language_name": "indonesian",
        "text": "Balasan mereka di sisi Tuhan mereka ialah surga ’Adn yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya. Allah ridha terhadap mereka dan mereka pun ridha kepada-Nya. Yang demikian itu adalah (balasan) bagi orang yang takut kepada Tuhannya."
      }
    ],
    "verse_number": 8
  }
]