[
  {
    "chapter_id": 62,
    "juz_number": 28,
    "use_bismillah": true,
    "text_madani": "يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ الْمَلِكِ الْقُدُّوسِ الْعَزِيزِ الْحَكِيمِ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Apa yang ada di langit dan apa yang ada di bumi senantiasa bertasbih kepada Allah. Maharaja, Yang Mahasuci, Yang Mahaperkasa, Mahabijaksana."
      },
      {
        "language_name": "english",
        "text": "Whatever is in the heavens and whatever is on the earth is exalting Allah, the Sovereign, the Pure, the Exalted in Might, the Wise."
      }
    ],
    "verse_number": 1
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِن كَانُوا مِن قَبْلُ لَفِي ضَلَالٍ مُّبِينٍ",
    "translations": [
      {
        "language_name": "english",
        "text": "It is He who has sent among the unlettered a Messenger from themselves reciting to them His verses and purifying them and teaching them the Book and wisdom - although they were before in clear error -"
      },
      {
        "language_name": "indonesian",
        "text": "Dialah yang mengutus seorang Rasul kepada kaum yang buta huruf dari kalangan mereka sendiri, yang membacakan kepada mereka ayat-ayat-Nya, menyucikan (jiwa) mereka dan mengajarkan kepada mereka Kitab dan Hikmah (Sunnah), meskipun sebelumnya, mereka benar-benar dalam kesesatan yang nyata."
      }
    ],
    "verse_number": 2
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan (juga) kepada kaum yang lain dari mereka yang belum berhubungan dengan mereka. Dan Dialah Yang Mahaperkasa, Mahabijaksana."
      },
      {
        "language_name": "english",
        "text": "And [to] others of them who have not yet joined them. And He is the Exalted in Might, the Wise."
      }
    ],
    "verse_number": 3
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَن يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Demikianlah karunia Allah, yang diberikan kepada siapa yang Dia kehendaki; dan Allah memiliki karunia yang besar."
      },
      {
        "language_name": "english",
        "text": "That is the bounty of Allah, which He gives to whom He wills, and Allah is the possessor of great bounty."
      }
    ],
    "verse_number": 4
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا ۚ بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "The example of those who were entrusted with the Torah and then did not take it on is like that of a donkey who carries volumes [of books]. Wretched is the example of the people who deny the signs of Allah . And Allah does not guide the wrongdoing people."
      },
      {
        "language_name": "indonesian",
        "text": "Perumpamaan orang-orang yang diberi tugas membawa Taurat, kemudian mereka tidak membawanya (tidak mengamalkannya) adalah seperti keledai yang membawa kitab-kitab yang tebal. Sangat buruk perumpamaan kaum yang mendustakan ayat-ayat Allah. Dan Allah tidak memberi petunjuk kepada orang-orang yang zhalim."
      }
    ],
    "verse_number": 5
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "قُلْ يَا أَيُّهَا الَّذِينَ هَادُوا إِن زَعَمْتُمْ أَنَّكُمْ أَوْلِيَاءُ لِلَّهِ مِن دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِن كُنتُمْ صَادِقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, \"O you who are Jews, if you claim that you are allies of Allah, excluding the [other] people, then wish for death, if you should be truthful.\""
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah (Muhammad), “Wahai orang-orang Yahudi! Jika kamu mengira bahwa kamulah kekasih Allah, bukan orang-orang yang lain, maka harapkanlah kematianmu, jika kamu orang yang benar.”"
      }
    ],
    "verse_number": 6
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "وَلَا يَتَمَنَّوْنَهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۚ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan mereka tidak akan mengharapkan kematian itu selamanya disebabkan kejahatan yang telah mereka perbuat dengan tangan mereka sendiri. Dan Allah Maha Mengetahui orang-orang yang zhalim."
      },
      {
        "language_name": "english",
        "text": "But they will not wish for it, ever, because of what their hands have put forth. And Allah is Knowing of the wrongdoers."
      }
    ],
    "verse_number": 7
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Katakanlah, “Sesungguhnya kematian yang kamu lari dari padanya, ia pasti menemui kamu, kemudian kamu akan dikembalikan kepada (Allah), yang mengetahui yang gaib dan yang nyata, lalu Dia beritakan kepadamu apa yang telah kamu kerjakan.”"
      },
      {
        "language_name": "english",
        "text": "Say, \"Indeed, the death from which you flee -  indeed, it will meet you. Then you will be returned to the Knower of the unseen and the witnessed, and He will inform you about what you used to do.\""
      }
    ],
    "verse_number": 8
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِن يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَىٰ ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Wahai orang-orang yang beriman! Apabila telah diseru untuk melaksanakan shalat pada hari Jum‘at, maka segeralah kamu mengingat Allah dan tinggalkanlah jual beli. Yang demikian itu lebih baik bagimu jika kamu mengetahui."
      },
      {
        "language_name": "english",
        "text": "O you who have believed, when [the adhan] is called for the prayer on the day of Jumu\u0027ah [Friday], then proceed to the remembrance of Allah and leave trade. That is better for you, if you only knew."
      }
    ],
    "verse_number": 9
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "فَإِذَا قُضِيَتِ الصَّلَاةُ فَانتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِن فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَّعَلَّكُمْ تُفْلِحُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And when the prayer has been concluded, disperse within the land and seek from the bounty of Allah, and remember Allah often that you may succeed."
      },
      {
        "language_name": "indonesian",
        "text": "Apabila shalat telah dilaksanakan, maka bertebaranlah kamu di bumi; carilah karunia Allah dan ingatlah Allah banyak-banyak agar kamu beruntung."
      }
    ],
    "verse_number": 10
  },
  {
    "chapter_id": 62,
    "juz_number": 28,
    "text_madani": "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِندَ اللَّهِ خَيْرٌ مِّنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But when they saw a transaction or a diversion, [O Muhammad], they rushed to it and left you standing. Say, \"What is with Allah is better than diversion and than a transaction, and Allah is the best of providers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan apabila mereka melihat perdagangan atau permainan, mereka segera menuju kepadanya dan mereka tinggalkan engkau (Muhammad) sedang berdiri (berkhotbah). Katakanlah, “Apa yang ada di sisi Allah lebih baik daripada permainan dan perdagangan,” dan Allah pemberi rezeki yang terbaik."
      }
    ],
    "verse_number": 11
  }
]