[
  {
    "chapter_id": 43,
    "juz_number": 25,
    "use_bismillah": true,
    "text_madani": "حم",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Haa Mim"
      },
      {
        "language_name": "english",
        "text": "Ha, Meem."
      }
    ],
    "verse_number": 1
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَالْكِتَابِ الْمُبِينِ",
    "translations": [
      {
        "language_name": "english",
        "text": "By the clear Book,"
      },
      {
        "language_name": "indonesian",
        "text": "Demi Kitab (Al-Qur\u0027an) yang jelas."
      }
    ],
    "verse_number": 2
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Kami menjadikan Al-Qur\u0027an dalam bahasa Arab agar kamu mengerti."
      },
      {
        "language_name": "english",
        "text": "Indeed, We have made it an Arabic Qur\u0027an that you might understand."
      }
    ],
    "verse_number": 3
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَإِنَّهُ فِي أُمِّ الْكِتَابِ لَدَيْنَا لَعَلِيٌّ حَكِيمٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "And indeed it is, in the Mother of the Book with Us, exalted and full of wisdom."
      },
      {
        "language_name": "indonesian",
        "text": "Dan sesungguhnya Al-Qur\u0027an itu dalam Ummul Kitab (Lauh Mahfuzhh) di sisi Kami, benar-benar (bernilai) tinggi dan penuh hikmah."
      }
    ],
    "verse_number": 4
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَفَنَضْرِبُ عَنكُمُ الذِّكْرَ صَفْحًا أَن كُنتُمْ قَوْمًا مُّسْرِفِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Then should We turn the message away, disregarding you, because you are a transgressing people?"
      },
      {
        "language_name": "indonesian",
        "text": "Maka apakah Kami akan berhenti menurunkan ayat-ayat (sebagai peringatan) Al-Qur\u0027an kepadamu, karena kamu kaum yang melampaui batas?"
      }
    ],
    "verse_number": 5
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَكَمْ أَرْسَلْنَا مِن نَّبِيٍّ فِي الْأَوَّلِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And how many a prophet We sent among the former peoples,"
      },
      {
        "language_name": "indonesian",
        "text": "Dan betapa banyak nabi-nabi yang telah Kami utus kepada umat-umat yang terdahulu."
      }
    ],
    "verse_number": 6
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَمَا يَأْتِيهِم مِّن نَّبِيٍّ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan setiap kali seorang nabi datang kepada mereka, mereka selalu memperolok-olokkannya."
      },
      {
        "language_name": "english",
        "text": "But there would not come to them a prophet except that they used to ridicule him."
      }
    ],
    "verse_number": 7
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَأَهْلَكْنَا أَشَدَّ مِنْهُم بَطْشًا وَمَضَىٰ مَثَلُ الْأَوَّلِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We destroyed greater than them in [striking] power, and the example of the former peoples has preceded."
      },
      {
        "language_name": "indonesian",
        "text": "Karena itu Kami binasakan orang-orang yang lebih besar kekuatannya di antara mereka dan telah berlalu contoh umat-umat terdahulu."
      }
    ],
    "verse_number": 8
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ خَلَقَهُنَّ الْعَزِيزُ الْعَلِيمُ",
    "translations": [
      {
        "language_name": "english",
        "text": "And if you should ask them, \"Who has created the heavens and the earth?\" they would surely say, \"They were created by the Exalted in Might, the Knowing.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan jika kamu tanyakan kepada mereka, “Siapakah yang menciptakan langit dan bumi?” Pastilah mereka akan menjawab, “Semuanya diciptakan oleh Yang Mahaperkasa, Maha Mengetahui.”"
      }
    ],
    "verse_number": 9
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "الَّذِي جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا وَجَعَلَ لَكُمْ فِيهَا سُبُلًا لَّعَلَّكُمْ تَهْتَدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Yang menjadikan bumi sebagai tempat menetap bagimu dan Dia menjadikan jalan-jalan di atas bumi untukmu agar kamu mendapat petunjuk."
      },
      {
        "language_name": "english",
        "text": "[The one] who has made for you the earth a bed and made for you upon it roads that you might be guided"
      }
    ],
    "verse_number": 10
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَالَّذِي نَزَّلَ مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَنشَرْنَا بِهِ بَلْدَةً مَّيْتًا ۚ كَذَٰلِكَ تُخْرَجُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And who sends down rain from the sky in measured amounts, and We revive thereby a dead land -  thus will you be brought forth -"
      },
      {
        "language_name": "indonesian",
        "text": "Dan yang menurunkan air dari langit menurut ukuran (yang diperlukan) lalu dengan air itu Kami hidupkan negeri yang mati (tandus). Seperti itulah kamu akan dikeluarkan (dari kubur)."
      }
    ],
    "verse_number": 11
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَالَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا وَجَعَلَ لَكُم مِّنَ الْفُلْكِ وَالْأَنْعَامِ مَا تَرْكَبُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And who created the species, all of them, and has made for you of ships and animals those which you mount."
      },
      {
        "language_name": "indonesian",
        "text": "Dan yang menciptakan semua berpasang-pasangan dan menjadikan kapal untukmu dan hewan ternak yang kamu tunggangi."
      }
    ],
    "verse_number": 12
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "لِتَسْتَوُوا عَلَىٰ ظُهُورِهِ ثُمَّ تَذْكُرُوا نِعْمَةَ رَبِّكُمْ إِذَا اسْتَوَيْتُمْ عَلَيْهِ وَتَقُولُوا سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Agar kamu duduk di atas punggungnya kemudian kamu ingat nikmat Tuhanmu apabila kamu telah duduk di atasnya; dan agar kamu mengucapkan, “Maha-suci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya,"
      },
      {
        "language_name": "english",
        "text": "That you may settle yourselves upon their backs and then remember the favor of your Lord when you have settled upon them and say. \"Exalted is He who has subjected this to us, and we could not have [otherwise] subdued it."
      }
    ],
    "verse_number": 13
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "dan sesungguhnya kami akan kembali kepada Tuhan kami.”"
      },
      {
        "language_name": "english",
        "text": "And indeed we, to our Lord, will [surely] return.\""
      }
    ],
    "verse_number": 14
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَجَعَلُوا لَهُ مِنْ عِبَادِهِ جُزْءًا ۚ إِنَّ الْإِنسَانَ لَكَفُورٌ مُّبِينٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "But they have attributed to Him from His servants a portion. Indeed, man is clearly ungrateful."
      },
      {
        "language_name": "indonesian",
        "text": "Dan mereka menjadikan sebagian dari hamba-hamba-Nya sebagai bagian dari-Nya. Sungguh, manusia itu pengingkar (nikmat Tuhan) yang nyata."
      }
    ],
    "verse_number": 15
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَمِ اتَّخَذَ مِمَّا يَخْلُقُ بَنَاتٍ وَأَصْفَاكُم بِالْبَنِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Pantaskah Dia mengambil anak perempuan dari yang diciptakan-Nya dan memberikan anak laki-laki kepadamu?"
      },
      {
        "language_name": "english",
        "text": "Or has He taken, out of what He has created, daughters and chosen you for [having] sons?"
      }
    ],
    "verse_number": 16
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَإِذَا بُشِّرَ أَحَدُهُم بِمَا ضَرَبَ لِلرَّحْمَٰنِ مَثَلًا ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "And when one of them is given good tidings of that which he attributes to the Most Merciful in comparison, his face becomes dark, and he suppresses grief."
      },
      {
        "language_name": "indonesian",
        "text": "Dan apabila salah seorang di antara mereka diberi kabar gembira dengan apa (kelahiran anak perempuan) yang dijadikan sebagai perumpamaan bagi (Allah) Yang Maha Pengasih, jadilah wajahnya hitam pekat, karena menahan sedih (dan marah)."
      }
    ],
    "verse_number": 17
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَوَمَن يُنَشَّأُ فِي الْحِلْيَةِ وَهُوَ فِي الْخِصَامِ غَيْرُ مُبِينٍ",
    "translations": [
      {
        "language_name": "english",
        "text": "So is one brought up in ornaments while being during conflict unevident [attributed to Allah ]?"
      },
      {
        "language_name": "indonesian",
        "text": "Dan apakah patut (menjadi anak Allah) orang yang dibesarkan sebagai perhiasan sedang dia tidak mampu memberi alasan yang tegas dan jelas dalam pertengkaran."
      }
    ],
    "verse_number": 18
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَجَعَلُوا الْمَلَائِكَةَ الَّذِينَ هُمْ عِبَادُ الرَّحْمَٰنِ إِنَاثًا ۚ أَشَهِدُوا خَلْقَهُمْ ۚ سَتُكْتَبُ شَهَادَتُهُمْ وَيُسْأَلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan mereka menjadikan malaikat-malaikat hamba-hamba (Allah) Yang Maha Pengasih itu sebagai jenis perempuan. Apakah mereka menyaksikan penciptaan (malaikat-malaikat itu)? Kelak akan dituliskan kesaksian mereka dan akan dimintakan pertanggungjawaban."
      },
      {
        "language_name": "english",
        "text": "And they have made the angels, who are servants of the Most Merciful, females. Did they witness their creation? Their testimony will be recorded, and they will be questioned."
      }
    ],
    "verse_number": 19
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَقَالُوا لَوْ شَاءَ الرَّحْمَٰنُ مَا عَبَدْنَاهُم ۗ مَّا لَهُم بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَخْرُصُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And they said, \"If the Most Merciful had willed, we would not have worshipped them.\" They have of that no knowledge. They are not but falsifying."
      },
      {
        "language_name": "indonesian",
        "text": "Dan mereka berkata, “Sekiranya (Allah) Yang Maha Pengasih menghendaki, tentulah kami tidak menyembah mereka (malaikat).” Mereka tidak mempunyai ilmu sedikit pun tentang itu. Tidak lain mereka hanyalah menduga-duga belaka."
      }
    ],
    "verse_number": 20
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَمْ آتَيْنَاهُمْ كِتَابًا مِّن قَبْلِهِ فَهُم بِهِ مُسْتَمْسِكُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Atau apakah pernah Kami berikan sebuah kitab kepada mereka sebelumnya, lalu mereka berpegang (pada kitab itu)?"
      },
      {
        "language_name": "english",
        "text": "Or have We given them a book before the Qur\u0027an to which they are adhering?"
      }
    ],
    "verse_number": 21
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "بَلْ قَالُوا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِم مُّهْتَدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Bahkan mereka berkata, “Sesungguhnya kami mendapati nenek moyang kami menganut suatu agama, dan kami mendapat petunjuk untuk mengikuti jejak mereka.”"
      },
      {
        "language_name": "english",
        "text": "Rather, they say, \"Indeed, we found our fathers upon a religion, and we are in their footsteps [rightly] guided.\""
      }
    ],
    "verse_number": 22
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَكَذَٰلِكَ مَا أَرْسَلْنَا مِن قَبْلِكَ فِي قَرْيَةٍ مِّن نَّذِيرٍ إِلَّا قَالَ مُتْرَفُوهَا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِم مُّقْتَدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan demikian juga ketika Kami mengutus seorang pemberi peringatan sebelum engkau (Muhammad) dalam suatu negeri, orang-orang yang hidup mewah (di negeri itu) selalu berkata, “Sesungguhnya kami mendapati nenek moyang kami menganut suatu (agama) dan sesungguhnya kami sekedar pengikut jejak-jejak mereka.”"
      },
      {
        "language_name": "english",
        "text": "And similarly, We did not send before you any warner into a city except that its affluent said, \"Indeed, we found our fathers upon a religion, and we are, in their footsteps, following.\""
      }
    ],
    "verse_number": 23
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "قَالَ أَوَلَوْ جِئْتُكُم بِأَهْدَىٰ مِمَّا وَجَدتُّمْ عَلَيْهِ آبَاءَكُمْ ۖ قَالُوا إِنَّا بِمَا أُرْسِلْتُم بِهِ كَافِرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "[Each warner] said, \"Even if I brought you better guidance than that [religion] upon which you found your fathers?\" They said, \"Indeed we, in that with which you were sent, are disbelievers.\""
      },
      {
        "language_name": "indonesian",
        "text": "(Rasul itu) berkata, “Apakah (kamu akan mengikutinya juga) sekalipun aku membawa untukmu (agama) yang lebih baik daripada apa yang kamu peroleh dari (agama) yang dianut nenek moyangmu.” Mereka menjawab, “Sesungguhnya kami mengingkari (agama) yang kamu diperintahkan untuk menyampaikannya.”"
      }
    ],
    "verse_number": 24
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَانتَقَمْنَا مِنْهُمْ ۖ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Lalu Kami binasakan mereka, maka perhatikanlah bagaimana kesudahan orang-orang yang mendustakan (kebenaran)."
      },
      {
        "language_name": "english",
        "text": "So we took retribution from them; then see how was the end of the deniers."
      }
    ],
    "verse_number": 25
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ وَقَوْمِهِ إِنَّنِي بَرَاءٌ مِّمَّا تَعْبُدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan (ingatlah) ketika Ibrahim berkata kepada ayahnya dan kaumnya, “Sesungguhnya aku berlepas diri dari apa yang kamu sembah,"
      },
      {
        "language_name": "english",
        "text": "And [mention, O Muhammad], when Abraham said to his father and his people, \"Indeed, I am disassociated from that which you worship"
      }
    ],
    "verse_number": 26
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "إِلَّا الَّذِي فَطَرَنِي فَإِنَّهُ سَيَهْدِينِ",
    "translations": [
      {
        "language_name": "english",
        "text": "Except for He who created me; and indeed, He will guide me.\""
      },
      {
        "language_name": "indonesian",
        "text": "kecuali (kamu menyembah) Allah yang menciptakanku; karena sungguh, Dia akan memberi petunjuk kepadaku.”"
      }
    ],
    "verse_number": 27
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَجَعَلَهَا كَلِمَةً بَاقِيَةً فِي عَقِبِهِ لَعَلَّهُمْ يَرْجِعُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And he made it a word remaining among his descendants that they might return [to it]."
      },
      {
        "language_name": "indonesian",
        "text": "Dan (Ibrahim) menjadikan (kalimat tauhid) itu kalimat yang kekal pada keturunannya agar mereka kembali (kepada kalimat tauhid itu)."
      }
    ],
    "verse_number": 28
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "بَلْ مَتَّعْتُ هَٰؤُلَاءِ وَآبَاءَهُمْ حَتَّىٰ جَاءَهُمُ الْحَقُّ وَرَسُولٌ مُّبِينٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Bahkan Aku telah memberikan kenikmatan hidup kepada mereka dan nenek moyang mereka sampai kebenaran (Al-Qur\u0027an) datang kepada mereka beserta seorang Rasul yang memberi penjelasan."
      },
      {
        "language_name": "english",
        "text": "However, I gave enjoyment to these [people of Makkah] and their fathers until there came to them the truth and a clear Messenger."
      }
    ],
    "verse_number": 29
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَمَّا جَاءَهُمُ الْحَقُّ قَالُوا هَٰذَا سِحْرٌ وَإِنَّا بِهِ كَافِرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But when the truth came to them, they said, \"This is magic, and indeed we are, concerning it, disbelievers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Tetapi ketika kebenaran (Al-Qur\u0027an) itu datang kepada mereka, mereka berkata, “Ini adalah sihir dan sesungguhnya kami mengingkarinya.”"
      }
    ],
    "verse_number": 30
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَقَالُوا لَوْلَا نُزِّلَ هَٰذَا الْقُرْآنُ عَلَىٰ رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيمٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan mereka (juga) berkata, “Mengapa Al-Qur\u0027an ini tidak diturunkan kepada orang besar (kaya dan berpengaruh) dari salah satu dua negeri ini (Mekah dan Taif)?”"
      },
      {
        "language_name": "english",
        "text": "And they said, \"Why was this Qur\u0027an not sent down upon a great man from [one of] the two cities?\""
      }
    ],
    "verse_number": 31
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَهُمْ يَقْسِمُونَ رَحْمَتَ رَبِّكَ ۚ نَحْنُ قَسَمْنَا بَيْنَهُم مَّعِيشَتَهُمْ فِي الْحَيَاةِ الدُّنْيَا ۚ وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِّيَتَّخِذَ بَعْضُهُم بَعْضًا سُخْرِيًّا ۗ وَرَحْمَتُ رَبِّكَ خَيْرٌ مِّمَّا يَجْمَعُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Apakah mereka yang membagi-bagi rahmat Tuhanmu? Kamilah yang menentukan penghidupan mereka dalam kehidupan dunia, dan Kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain. Dan rahmat Tuhanmu lebih baik dari apa yang mereka kumpulkan."
      },
      {
        "language_name": "english",
        "text": "Do they distribute the mercy of your Lord? It is We who have apportioned among them their livelihood in the life of this world and have raised some of them above others in degrees [of rank] that they may make use of one another for service. But the mercy of your Lord is better than whatever they accumulate."
      }
    ],
    "verse_number": 32
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَوْلَا أَن يَكُونَ النَّاسُ أُمَّةً وَاحِدَةً لَّجَعَلْنَا لِمَن يَكْفُرُ بِالرَّحْمَٰنِ لِبُيُوتِهِمْ سُقُفًا مِّن فِضَّةٍ وَمَعَارِجَ عَلَيْهَا يَظْهَرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And if it were not that the people would become one community [of disbelievers], We would have made for those who disbelieve in the Most Merciful -  for their houses - ceilings and stairways of silver upon which to mount"
      },
      {
        "language_name": "indonesian",
        "text": "Dan sekiranya bukan karena menghindarkan manusia menjadi umat yang satu (dalam kekafiran), pastilah sudah Kami buatkan bagi orang-orang yang kafir kepada (Allah) Yang Maha Pengasih, loteng-loteng rumah mereka dari perak, demikian pula tangga-tangga yang mereka naiki,"
      }
    ],
    "verse_number": 33
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلِبُيُوتِهِمْ أَبْوَابًا وَسُرُرًا عَلَيْهَا يَتَّكِئُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And for their houses -  doors and couches [of silver] upon which to recline"
      },
      {
        "language_name": "indonesian",
        "text": "dan (Kami buatkan pula) pintu-pintu (perak) bagi rumah-rumah mereka, dan (begitu pula) dipan-dipan tempat mereka bersandar,"
      }
    ],
    "verse_number": 34
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَزُخْرُفًا ۚ وَإِن كُلُّ ذَٰلِكَ لَمَّا مَتَاعُ الْحَيَاةِ الدُّنْيَا ۚ وَالْآخِرَةُ عِندَ رَبِّكَ لِلْمُتَّقِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "dan (Kami buatkan pula) perhiasan-perhiasan dari emas. Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia, sedangkan kehidupan akhirat di sisi Tuhanmu disediakan bagi orang-orang yang bertakwa."
      },
      {
        "language_name": "english",
        "text": "And gold ornament. But all that is not but the enjoyment of worldly life. And the Hereafter with your Lord is for the righteous."
      }
    ],
    "verse_number": 35
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَمَن يَعْشُ عَن ذِكْرِ الرَّحْمَٰنِ نُقَيِّضْ لَهُ شَيْطَانًا فَهُوَ لَهُ قَرِينٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan barangsiapa berpaling dari pengajaran Allah Yang Maha Pengasih (Al-Qur\u0027an), Kami biarkan setan (menyesatkannya) dan menjadi teman karibnya."
      },
      {
        "language_name": "english",
        "text": "And whoever is blinded from remembrance of the Most Merciful -  We appoint for him a devil, and he is to him a companion."
      }
    ],
    "verse_number": 36
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَإِنَّهُمْ لَيَصُدُّونَهُمْ عَنِ السَّبِيلِ وَيَحْسَبُونَ أَنَّهُم مُّهْتَدُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And indeed, the devils avert them from the way [of guidance] while they think that they are [rightly] guided"
      },
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, mereka (setan-setan itu) benar-benar menghalang-halangi mereka dari jalan yang benar, sedang mereka menyangka bahwa mereka mendapat petunjuk."
      }
    ],
    "verse_number": 37
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "حَتَّىٰ إِذَا جَاءَنَا قَالَ يَا لَيْتَ بَيْنِي وَبَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ فَبِئْسَ الْقَرِينُ",
    "translations": [
      {
        "language_name": "english",
        "text": "Until, when he comes to Us [at Judgement], he says [to his companion], \"Oh, I wish there was between me and you the distance between the east and west -  how wretched a companion.\""
      },
      {
        "language_name": "indonesian",
        "text": "Sehingga apabila orang–orang yang berpaling itu datang kepada Kami (pada hari Kiamat) dia berkata, “Wahai! Sekiranya (jarak) antara aku dan kamu seperti jarak antara timur dan barat! Memang (setan itu) teman yang paling jahat (bagi manusia).”"
      }
    ],
    "verse_number": 38
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَن يَنفَعَكُمُ الْيَوْمَ إِذ ظَّلَمْتُمْ أَنَّكُمْ فِي الْعَذَابِ مُشْتَرِكُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan (harapanmu itu) sekali-kali tidak akan memberi manfaat kepadamu pada hari itu karena kamu telah menzhalimi (dirimu sendiri). Sesungguhnya kamu pantas bersama-sama dalam azab itu."
      },
      {
        "language_name": "english",
        "text": "And never will it benefit you that Day, when you have wronged, that you are [all] sharing in the punishment."
      }
    ],
    "verse_number": 39
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَفَأَنتَ تُسْمِعُ الصُّمَّ أَوْ تَهْدِي الْعُمْيَ وَمَن كَانَ فِي ضَلَالٍ مُّبِينٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka apakah engkau (Muhammad) dapat menjadikan orang yang tuli bisa mendengar, atau (dapatkah) engkau memberi petunjuk kepada orang yang buta (hatinya) dan kepada orang yang tetap dalam kesesatan yang nyata?"
      },
      {
        "language_name": "english",
        "text": "Then will you make the deaf hear, [O Muhammad], or guide the blind or he who is in clear error?"
      }
    ],
    "verse_number": 40
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَإِمَّا نَذْهَبَنَّ بِكَ فَإِنَّا مِنْهُم مُّنتَقِمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka sungguh, sekiranya Kami mewafatkanmu (sebelum engkau mencapai kemenangan), maka sesungguhnya Kami akan tetap memberikan azab kepada mereka (di akhirat),"
      },
      {
        "language_name": "english",
        "text": "And whether [or not] We take you away [in death], indeed, We will take retribution upon them."
      }
    ],
    "verse_number": 41
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَوْ نُرِيَنَّكَ الَّذِي وَعَدْنَاهُمْ فَإِنَّا عَلَيْهِم مُّقْتَدِرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Or whether [or not] We show you that which We have promised them, indeed, We are Perfect in Ability."
      },
      {
        "language_name": "indonesian",
        "text": "atau Kami perlihatkan kepadamu (azab) yang telah Kami ancamkan kepada mereka. Maka sungguh, Kami berkuasa atas mereka."
      }
    ],
    "verse_number": 42
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَاسْتَمْسِكْ بِالَّذِي أُوحِيَ إِلَيْكَ ۖ إِنَّكَ عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka berpegang teguhlah engkau kepada (agama) yang telah diwahyukan kepadamu. Sungguh, engkau berada di jalan yang lurus."
      },
      {
        "language_name": "english",
        "text": "So adhere to that which is revealed to you. Indeed, you are on a straight path."
      }
    ],
    "verse_number": 43
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَإِنَّهُ لَذِكْرٌ لَّكَ وَلِقَوْمِكَ ۖ وَسَوْفَ تُسْأَلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, Al-Qur\u0027an itu benar-benar suatu peringatan bagimu dan bagi kaummu, dan kelak kamu akan diminta pertanggungjawaban."
      },
      {
        "language_name": "english",
        "text": "And indeed, it is a remembrance for you and your people, and you [all] are going to be questioned."
      }
    ],
    "verse_number": 44
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَاسْأَلْ مَنْ أَرْسَلْنَا مِن قَبْلِكَ مِن رُّسُلِنَا أَجَعَلْنَا مِن دُونِ الرَّحْمَٰنِ آلِهَةً يُعْبَدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan tanyakanlah (Muhammad) kepada rasul-rasul Kami yang telah Kami utus sebelum engkau, “Apakah Kami menentukan tuhan-tuhan selain (Allah) Yang Maha Pengasih untuk disembah?”"
      },
      {
        "language_name": "english",
        "text": "And ask those We sent before you of Our messengers; have We made besides the Most Merciful deities to be worshipped?"
      }
    ],
    "verse_number": 45
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَقَالَ إِنِّي رَسُولُ رَبِّ الْعَالَمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And certainly did We send Moses with Our signs to Pharaoh and his establishment, and he said, \"Indeed, I am the messenger of the Lord of the worlds.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, Kami telah mengutus Musa dengan membawa mukjizat-mukjizat Kami kepada Fir’aun dan pemuka-pemuka kaumnya. Maka dia (Musa) berkata, “Sesungguhnya aku adalah utusan dari Tuhan seluruh alam.”"
      }
    ],
    "verse_number": 46
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَلَمَّا جَاءَهُم بِآيَاتِنَا إِذَا هُم مِّنْهَا يَضْحَكُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka ketika dia (Musa) datang kepada mereka membawa mukjizat-mukjizat Kami, seketika itu mereka menertawakannya."
      },
      {
        "language_name": "english",
        "text": "But when he brought them Our signs, at once they laughed at them."
      }
    ],
    "verse_number": 47
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَمَا نُرِيهِم مِّنْ آيَةٍ إِلَّا هِيَ أَكْبَرُ مِنْ أُخْتِهَا ۖ وَأَخَذْنَاهُم بِالْعَذَابِ لَعَلَّهُمْ يَرْجِعُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We showed them not a sign except that it was greater than its sister, and We seized them with affliction that perhaps they might return [to faith]."
      },
      {
        "language_name": "indonesian",
        "text": "Dan tidaklah Kami perlihatkan suatu mukjizat kepada mereka kecuali (mukjizat itu) lebih besar dari mukjizat-mukjizat (yang sebelumnya). Dan Kami timpakan kepada mereka azab agar mereka kembali (ke jalan yang benar)."
      }
    ],
    "verse_number": 48
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَقَالُوا يَا أَيُّهَ السَّاحِرُ ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِندَكَ إِنَّنَا لَمُهْتَدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan mereka berkata, “Wahai pesihir! Berdoalah kepada Tuhanmu untuk (melepaskan) kami sesuai dengan apa yang telah dijanjikan-Nya kepadamu; sesungguhnya kami (jika doamu dikabulkan) akan menjadi orang yang mendapat petunjuk.”"
      },
      {
        "language_name": "english",
        "text": "And they said [to Moses], \"O magician, invoke for us your Lord by what He has promised you. Indeed, we will be guided.\""
      }
    ],
    "verse_number": 49
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ إِذَا هُمْ يَنكُثُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But when We removed from them the affliction, at once they broke their word."
      },
      {
        "language_name": "indonesian",
        "text": "Maka ketika Kami hilangkan azab itu dari mereka, seketika itu (juga) mereka ingkar janji."
      }
    ],
    "verse_number": 50
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَنَادَىٰ فِرْعَوْنُ فِي قَوْمِهِ قَالَ يَا قَوْمِ أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَٰذِهِ الْأَنْهَارُ تَجْرِي مِن تَحْتِي ۖ أَفَلَا تُبْصِرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And Pharaoh called out among his people; he said, \"O my people, does not the kingdom of Egypt belong to me, and these rivers flowing beneath me; then do you not see?"
      },
      {
        "language_name": "indonesian",
        "text": "Dan Fir‘aun berseru kepada kaumnya (seraya) berkata, “Wahai kaumku! Bukankah kerajaan Mesir itu milikku dan (bukankah) sungai-sungai ini mengalir di bawahku; apakah kamu tidak melihat?"
      }
    ],
    "verse_number": 51
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَمْ أَنَا خَيْرٌ مِّنْ هَٰذَا الَّذِي هُوَ مَهِينٌ وَلَا يَكَادُ يُبِينُ",
    "translations": [
      {
        "language_name": "english",
        "text": "Or am I [not] better than this one who is insignificant and hardly makes himself clear?"
      },
      {
        "language_name": "indonesian",
        "text": "Bukankah aku lebih baik dari orang (Musa) yang hina ini dan yang hampir tidak dapat menjelaskan (perkataannya)?"
      }
    ],
    "verse_number": 52
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَلَوْلَا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ مِّن ذَهَبٍ أَوْ جَاءَ مَعَهُ الْمَلَائِكَةُ مُقْتَرِنِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Then why have there not been placed upon him bracelets of gold or come with him the angels in conjunction?\""
      },
      {
        "language_name": "indonesian",
        "text": "Maka mengapa dia (Musa) tidak dipakaikan gelang dari emas atau malaikat datang bersama-sama dia untuk mengiringkannya?”"
      }
    ],
    "verse_number": 53
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَاسْتَخَفَّ قَوْمَهُ فَأَطَاعُوهُ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "So he bluffed his people, and they obeyed him. Indeed, they were [themselves] a people defiantly disobedient [of Allah ]."
      },
      {
        "language_name": "indonesian",
        "text": "Maka (Fir‘aun) dengan perkataan itu telah mempengaruhi kaumnya, sehingga mereka patuh kepadanya. Sungguh, mereka adalah kaum yang fasik."
      }
    ],
    "verse_number": 54
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَلَمَّا آسَفُونَا انتَقَمْنَا مِنْهُمْ فَأَغْرَقْنَاهُمْ أَجْمَعِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And when they angered Us, We took retribution from them and drowned them all."
      },
      {
        "language_name": "indonesian",
        "text": "Maka ketika mereka membuat Kami murka, Kami hukum mereka, lalu Kami tenggelamkan mereka semuanya (di laut),"
      }
    ],
    "verse_number": 55
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَجَعَلْنَاهُمْ سَلَفًا وَمَثَلًا لِّلْآخِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We made them a precedent and an example for the later peoples."
      },
      {
        "language_name": "indonesian",
        "text": "maka Kami jadikan mereka sebagai (kaum) terdahulu dan pelajaran bagi orang-orang yang kemudian."
      }
    ],
    "verse_number": 56
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا إِذَا قَوْمُكَ مِنْهُ يَصِدُّونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And when the son of Mary was presented as an example, immediately your people laughed aloud."
      },
      {
        "language_name": "indonesian",
        "text": "Dan ketika putra Maryam (Isa) dijadikan perumpamaan, tiba-tiba kaummu (Suku Quraisy) bersorak karenanya."
      }
    ],
    "verse_number": 57
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَقَالُوا أَآلِهَتُنَا خَيْرٌ أَمْ هُوَ ۚ مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا ۚ بَلْ هُمْ قَوْمٌ خَصِمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan mereka berkata, “Manakah yang lebih baik tuhan-tuhan kami atau dia (Isa)?” Mereka tidak memberikan (perumpamaan itu) kepadamu melainkan dengan maksud membantah saja, sebenarnya mereka adalah kaum yang suka bertengkar."
      },
      {
        "language_name": "english",
        "text": "And they said, \"Are our gods better, or is he?\" They did not present the comparison except for [mere] argument. But, [in fact], they are a people prone to dispute."
      }
    ],
    "verse_number": 58
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "إِنْ هُوَ إِلَّا عَبْدٌ أَنْعَمْنَا عَلَيْهِ وَجَعَلْنَاهُ مَثَلًا لِّبَنِي إِسْرَائِيلَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Jesus was not but a servant upon whom We bestowed favor, and We made him an example for the Children of Israel."
      },
      {
        "language_name": "indonesian",
        "text": "Dia (Isa) tidak lain hanyalah seorang hamba yang Kami berikan nikmat (kenabian) kepadanya dan Kami jadikan dia sebagai contoh pelajaran bagi Bani Israil."
      }
    ],
    "verse_number": 59
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَوْ نَشَاءُ لَجَعَلْنَا مِنكُم مَّلَائِكَةً فِي الْأَرْضِ يَخْلُفُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And if We willed, We could have made [instead] of you angels succeeding [one another] on the earth."
      },
      {
        "language_name": "indonesian",
        "text": "Dan sekiranya Kami menghendaki, niscaya ada di antara kamu yang Kami jadikan malaikat-malaikat (yang turun temurun) sebagai pengganti kamu di bumi."
      }
    ],
    "verse_number": 60
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَإِنَّهُ لَعِلْمٌ لِّلسَّاعَةِ فَلَا تَمْتَرُنَّ بِهَا وَاتَّبِعُونِ ۚ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, dia (Isa) itu benar-benar menjadi pertanda akan datangnya hari Kiamat. Karena itu, janganlah kamu ragu-ragu tentang (Kiamat) itu dan ikutilah Aku. Inilah jalan yang lurus."
      },
      {
        "language_name": "english",
        "text": "And indeed, Jesus will be [a sign for] knowledge of the Hour, so be not in doubt of it, and follow Me. This is a straight path."
      }
    ],
    "verse_number": 61
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَا يَصُدَّنَّكُمُ الشَّيْطَانُ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "And never let Satan avert you. Indeed, he is to you a clear enemy."
      },
      {
        "language_name": "indonesian",
        "text": "Dan janganlah kamu sekali-kali dipalingkan oleh setan; sungguh, setan itu musuh yang nyata bagimu."
      }
    ],
    "verse_number": 62
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَمَّا جَاءَ عِيسَىٰ بِالْبَيِّنَاتِ قَالَ قَدْ جِئْتُكُم بِالْحِكْمَةِ وَلِأُبَيِّنَ لَكُم بَعْضَ الَّذِي تَخْتَلِفُونَ فِيهِ ۖ فَاتَّقُوا اللَّهَ وَأَطِيعُونِ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan ketika Isa datang membawa keterangan, dia berkata, “Sungguh, aku datang kepadamu dengan membawa hikmah dan untuk menjelaskan kepadamu sebagian dari apa yang kamu perselisihkan, maka bertakwalah kepada Allah dan taatlah kepadaku."
      },
      {
        "language_name": "english",
        "text": "And when Jesus brought clear proofs, he said, \"I have come to you with wisdom and to make clear to you some of that over which you differ, so fear Allah and obey me."
      }
    ],
    "verse_number": 63
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "إِنَّ اللَّهَ هُوَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۚ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "Indeed, Allah is my Lord and your Lord, so worship Him. This is a straight path.\""
      },
      {
        "language_name": "indonesian",
        "text": "Sungguh Allah, Dia Tuhanku dan Tuhanmu, maka sembahlah Dia. Ini adalah jalan yang lurus.”"
      }
    ],
    "verse_number": 64
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَاخْتَلَفَ الْأَحْزَابُ مِن بَيْنِهِمْ ۖ فَوَيْلٌ لِّلَّذِينَ ظَلَمُوا مِنْ عَذَابِ يَوْمٍ أَلِيمٍ",
    "translations": [
      {
        "language_name": "english",
        "text": "But the denominations from among them differed [and separated], so woe to those who have wronged from the punishment of a painful Day."
      },
      {
        "language_name": "indonesian",
        "text": "Tetapi golongan-golongan (yang ada) saling berselisih di antara mereka; maka celakalah orang-orang yang zhalim karena azab pada hari yang pedih (Kiamat)."
      }
    ],
    "verse_number": 65
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "هَلْ يَنظُرُونَ إِلَّا السَّاعَةَ أَن تَأْتِيَهُم بَغْتَةً وَهُمْ لَا يَشْعُرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Are they waiting except for the Hour to come upon them suddenly while they perceive not?"
      },
      {
        "language_name": "indonesian",
        "text": "Apakah mereka hanya menunggu saja kedatangan hari Kiamat yang datang kepada mereka secara mendadak sedang mereka tidak menyadarinya?"
      }
    ],
    "verse_number": 66
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "الْأَخِلَّاءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا الْمُتَّقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Close friends, that Day, will be enemies to each other, except for the righteous"
      },
      {
        "language_name": "indonesian",
        "text": "Teman-teman karib pada hari itu saling bermusuhan satu sama lain, kecuali mereka yang bertakwa."
      }
    ],
    "verse_number": 67
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "يَا عِبَادِ لَا خَوْفٌ عَلَيْكُمُ الْيَوْمَ وَلَا أَنتُمْ تَحْزَنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "[To whom Allah will say], \"O My servants, no fear will there be concerning you this Day, nor will you grieve,"
      },
      {
        "language_name": "indonesian",
        "text": "”Wahai hamba-hamba-Ku! Tidak ada ketakutan bagimu pada hari itu dan tidak pula kamu bersedih hati."
      }
    ],
    "verse_number": 68
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "الَّذِينَ آمَنُوا بِآيَاتِنَا وَكَانُوا مُسْلِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Yaitu) orang-orang yang beriman kepada ayat-ayat Kami dan mereka berserah diri."
      },
      {
        "language_name": "english",
        "text": "[You] who believed in Our verses and were Muslims."
      }
    ],
    "verse_number": 69
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "ادْخُلُوا الْجَنَّةَ أَنتُمْ وَأَزْوَاجُكُمْ تُحْبَرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Enter Paradise, you and your kinds, delighted.\""
      },
      {
        "language_name": "indonesian",
        "text": "Masuklah kamu ke dalam surga, kamu dan pasanganmu akan digembirakan.”"
      }
    ],
    "verse_number": 70
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "يُطَافُ عَلَيْهِم بِصِحَافٍ مِّن ذَهَبٍ وَأَكْوَابٍ ۖ وَفِيهَا مَا تَشْتَهِيهِ الْأَنفُسُ وَتَلَذُّ الْأَعْيُنُ ۖ وَأَنتُمْ فِيهَا خَالِدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Kepada mereka diedarkan piring-piring dan gelas-gelas dari emas, dan di dalam surga itu terdapat apa yang diingini oleh hati dan segala yang sedap (dipandang) mata. Dan kamu kekal di dalamnya."
      },
      {
        "language_name": "english",
        "text": "Circulated among them will be plates and vessels of gold. And therein is whatever the souls desire and [what] delights the eyes, and you will abide therein eternally."
      }
    ],
    "verse_number": 71
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَتِلْكَ الْجَنَّةُ الَّتِي أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan itulah surga yang diwariskan kepada kamu disebabkan amal perbuatan yang telah kamu kerjakan."
      },
      {
        "language_name": "english",
        "text": "And that is Paradise which you are made to inherit for what you used to do."
      }
    ],
    "verse_number": 72
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "لَكُمْ فِيهَا فَاكِهَةٌ كَثِيرَةٌ مِّنْهَا تَأْكُلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "For you therein is much fruit from which you will eat."
      },
      {
        "language_name": "indonesian",
        "text": "Di dalam surga itu terdapat banyak buah-buahan untukmu yang sebagiannya kamu makan."
      }
    ],
    "verse_number": 73
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "إِنَّ الْمُجْرِمِينَ فِي عَذَابِ جَهَنَّمَ خَالِدُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Indeed, the criminals will be in the punishment of Hell, abiding eternally."
      },
      {
        "language_name": "indonesian",
        "text": "Sungguh, orang-orang yang berdosa itu kekal di dalam azab neraka Jahanam."
      }
    ],
    "verse_number": 74
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "لَا يُفَتَّرُ عَنْهُمْ وَهُمْ فِيهِ مُبْلِسُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "It will not be allowed to subside for them, and they, therein, are in despair."
      },
      {
        "language_name": "indonesian",
        "text": "Tidak diringankan (azab) itu dari mereka, dan mereka berputus asa di dalamnya."
      }
    ],
    "verse_number": 75
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَمَا ظَلَمْنَاهُمْ وَلَٰكِن كَانُوا هُمُ الظَّالِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan tidaklah Kami menzhalimi mereka, tetapi merekalah yang menzhalimi diri mereka sendiri."
      },
      {
        "language_name": "english",
        "text": "And We did not wrong them, but it was they who were the wrongdoers."
      }
    ],
    "verse_number": 76
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ ۖ قَالَ إِنَّكُم مَّاكِثُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan mereka berseru, “Wahai (Malaikat) Malik! Biarlah Tuhanmu mematikan kami saja.” Dia menjawab, “Sungguh, kamu akan tetap tinggal (di neraka ini).”"
      },
      {
        "language_name": "english",
        "text": "And they will call, \"O Malik, let your Lord put an end to us!\" He will say, \"Indeed, you will remain.\""
      }
    ],
    "verse_number": 77
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "لَقَدْ جِئْنَاكُم بِالْحَقِّ وَلَٰكِنَّ أَكْثَرَكُمْ لِلْحَقِّ كَارِهُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "We had certainly brought you the truth, but most of you, to the truth, were averse."
      },
      {
        "language_name": "indonesian",
        "text": "Sungguh, Kami telah datang membawa kebenaran kepada kamu tetapi kebanyakan di antara kamu benci pada kebenaran itu."
      }
    ],
    "verse_number": 78
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَمْ أَبْرَمُوا أَمْرًا فَإِنَّا مُبْرِمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Or have they devised [some] affair? But indeed, We are devising [a plan]."
      },
      {
        "language_name": "indonesian",
        "text": "Ataukah mereka telah merencanakan suatu tipu daya (jahat), maka sesungguhnya Kami telah berencana (mengatasi tipu daya mereka)."
      }
    ],
    "verse_number": 79
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "أَمْ يَحْسَبُونَ أَنَّا لَا نَسْمَعُ سِرَّهُمْ وَنَجْوَاهُم ۚ بَلَىٰ وَرُسُلُنَا لَدَيْهِمْ يَكْتُبُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Ataukah mereka mengira, bahwa Kami tidak mendengar rahasia dan bisikan-bisikan mereka? Sebenarnya (Kami mendengar), dan utusan-utusan Kami (malaikat) selalu mencatat di sisi mereka."
      },
      {
        "language_name": "english",
        "text": "Or do they think that We hear not their secrets and their private conversations? Yes, [We do], and Our messengers are with them recording."
      }
    ],
    "verse_number": 80
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "قُلْ إِن كَانَ لِلرَّحْمَٰنِ وَلَدٌ فَأَنَا أَوَّلُ الْعَابِدِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Katakanlah (Muhammad), “Jika benar Tuhan Yang Maha Pengasih mempunyai anak, maka akulah orang yang mula-mula memuliakan (anak itu)."
      },
      {
        "language_name": "english",
        "text": "Say, [O Muhammad], \"If the Most Merciful had a son, then I would be the first of [his] worshippers.\""
      }
    ],
    "verse_number": 81
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "سُبْحَانَ رَبِّ السَّمَاوَاتِ وَالْأَرْضِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Exalted is the Lord of the heavens and the earth, Lord of the Throne, above what they describe."
      },
      {
        "language_name": "indonesian",
        "text": "Mahasuci Tuhan pemilik langit dan bumi, Tuhan pemilik ‘Arsy, dari apa yang mereka sifatkan itu.”"
      }
    ],
    "verse_number": 82
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّىٰ يُلَاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka biarkanlah mereka tenggelam (dalam kesesatan) dan bermain-main sampai mereka menemui hari yang dijanjikan kepada mereka."
      },
      {
        "language_name": "english",
        "text": "So leave them to converse vainly and amuse themselves until they meet their Day which they are promised."
      }
    ],
    "verse_number": 83
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَهُوَ الَّذِي فِي السَّمَاءِ إِلَٰهٌ وَفِي الْأَرْضِ إِلَٰهٌ ۚ وَهُوَ الْحَكِيمُ الْعَلِيمُ",
    "translations": [
      {
        "language_name": "english",
        "text": "And it is Allah who is [the only] deity in the heaven, and on the earth [the only] deity. And He is the Wise, the Knowing."
      },
      {
        "language_name": "indonesian",
        "text": "Dan Dialah Tuhan (yang disembah) di langit dan Tuhan (yang disembah) di bumi dan Dialah Yang Mahabijaksana, Maha Mengetahui."
      }
    ],
    "verse_number": 84
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَتَبَارَكَ الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَعِندَهُ عِلْمُ السَّاعَةِ وَإِلَيْهِ تُرْجَعُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan Mahasuci (Allah) yang memiliki kerajaan langit dan bumi, dan apa yang ada di antara keduanya; dan di sisi-Nyalah ilmu tentang hari Kiamat dan hanya kepada-Nyalah kamu dikembalikan."
      },
      {
        "language_name": "english",
        "text": "And blessed is He to whom belongs the dominion of the heavens and the earth and whatever is between them and with whom is knowledge of the Hour and to whom you will be returned."
      }
    ],
    "verse_number": 85
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَا يَمْلِكُ الَّذِينَ يَدْعُونَ مِن دُونِهِ الشَّفَاعَةَ إِلَّا مَن شَهِدَ بِالْحَقِّ وَهُمْ يَعْلَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan orang-orang yang menyeru kepada selain Allah tidak mendapat syafaat (pertolongan di akhirat); kecuali orang yang mengakui yang hak (tauhid) dan mereka meyakini."
      },
      {
        "language_name": "english",
        "text": "And those they invoke besides Him do not possess [power of] intercession; but only those who testify to the truth [can benefit], and they know."
      }
    ],
    "verse_number": 86
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And if you asked them who created them, they would surely say, \" Allah .\" So how are they deluded?"
      },
      {
        "language_name": "indonesian",
        "text": "Dan jika engkau bertanya kepada mereka, “Siapakah yang menciptakan mereka, niscaya mereka menjawab, “Allah,” jadi bagaimana mereka dapat dipalingkan (dari menyembah Allah),”"
      }
    ],
    "verse_number": 87
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "وَقِيلِهِ يَا رَبِّ إِنَّ هَٰؤُلَاءِ قَوْمٌ لَّا يُؤْمِنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And [ Allah acknowledges] his saying, \"O my Lord, indeed these are a people who do not believe.\""
      },
      {
        "language_name": "indonesian",
        "text": "dan (Allah mengetahui) ucapannya (Muhammad), “Ya Tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman.”"
      }
    ],
    "verse_number": 88
  },
  {
    "chapter_id": 43,
    "juz_number": 25,
    "text_madani": "فَاصْفَحْ عَنْهُمْ وَقُلْ سَلَامٌ ۚ فَسَوْفَ يَعْلَمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "So turn aside from them and say, \"Peace.\" But they are going to know."
      },
      {
        "language_name": "indonesian",
        "text": "Maka berpalinglah dari mereka dan katakanlah, “Salam (selamat tinggal).” Kelak mereka akan mengetahui (nasib mereka yang buruk)."
      }
    ],
    "verse_number": 89
  }
]