[
  {
    "chapter_id": 39,
    "juz_number": 23,
    "use_bismillah": true,
    "text_madani": "تَنزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ",
    "translations": [
      {
        "language_name": "english",
        "text": "The revelation of the Qur\u0027an is from Allah, the Exalted in Might, the Wise."
      },
      {
        "language_name": "indonesian",
        "text": "Kitab (Al-Qur\u0027an) ini diturunkan oleh Allah Yang Mahamulia, Mahabijaksana."
      }
    ],
    "verse_number": 1
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "إِنَّا أَنزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ فَاعْبُدِ اللَّهَ مُخْلِصًا لَّهُ الدِّينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sesungguhnya Kami menurunkan Kitab (Al-Qur\u0027an) kepadamu (Muhammad) dengan (membawa) kebenaran. Maka sembahlah Allah dengan tulus ikhlas beragama kepada-Nya."
      },
      {
        "language_name": "english",
        "text": "Indeed, We have sent down to you the Book, [O Muhammad], in truth. So worship Allah, [being] sincere to Him in religion."
      }
    ],
    "verse_number": 2
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "أَلَا لِلَّهِ الدِّينُ الْخَالِصُ ۚ وَالَّذِينَ اتَّخَذُوا مِن دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "Unquestionably, for Allah is the pure religion. And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allah in position.\" Indeed, Allah will judge between them concerning that over which they differ. Indeed, Allah does not guide he who is a liar and [confirmed] disbeliever."
      },
      {
        "language_name": "indonesian",
        "text": "Ingatlah! Hanya milik Allah agama yang murni (dari syirik). Dan orang-orang yang mengambil pelindung selain Dia (berkata), “Kami tidak menyembah mereka melainkan (berharap) agar mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya.” Sungguh, Allah akan memberi putusan di antara mereka tentang apa yang mereka perselisihkan. Sungguh, Allah tidak memberi petunjuk kepada pendusta dan orang yang sangat ingkar."
      }
    ],
    "verse_number": 3
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "لَّوْ أَرَادَ اللَّهُ أَن يَتَّخِذَ وَلَدًا لَّاصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَاءُ ۚ سُبْحَانَهُ ۖ هُوَ اللَّهُ الْوَاحِدُ الْقَهَّارُ",
    "translations": [
      {
        "language_name": "english",
        "text": "If Allah had intended to take a son, He could have chosen from what He creates whatever He willed. Exalted is He; He is Allah, the One, the Prevailing."
      },
      {
        "language_name": "indonesian",
        "text": "Sekiranya Allah hendak mengambil anak, tentu Dia akan memilih apa yang Dia kehendaki dari apa yang telah diciptakan-Nya. Mahasuci Dia. Dialah Allah Yang Maha Esa, Mahaperkasa."
      }
    ],
    "verse_number": 4
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۖ يُكَوِّرُ اللَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى اللَّيْلِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُّسَمًّى ۗ أَلَا هُوَ الْعَزِيزُ الْغَفَّارُ",
    "translations": [
      {
        "language_name": "english",
        "text": "He created the heavens and earth in truth. He wraps the night over the day and wraps the day over the night and has subjected the sun and the moon, each running [its course] for a specified term. Unquestionably, He is the Exalted in Might, the Perpetual Forgiver."
      },
      {
        "language_name": "indonesian",
        "text": "Dia menciptakan langit dan bumi dengan (tujuan) yang benar; Dia memasukkan malam atas siang dan memasukkan siang atas malam dan menundukkan matahari dan bulan, masing-masing berjalan menurut waktu yang ditentukan. Ingatlah! Dialah Yang Mahamulia, Maha Pengampun."
      }
    ],
    "verse_number": 5
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "خَلَقَكُم مِّن نَّفْسٍ وَاحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَأَنزَلَ لَكُم مِّنَ الْأَنْعَامِ ثَمَانِيَةَ أَزْوَاجٍ ۚ يَخْلُقُكُمْ فِي بُطُونِ أُمَّهَاتِكُمْ خَلْقًا مِّن بَعْدِ خَلْقٍ فِي ظُلُمَاتٍ ثَلَاثٍ ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُصْرَفُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "He created you from one soul. Then He made from it its mate, and He produced for you from the grazing livestock eight mates. He creates you in the wombs of your mothers, creation after creation, within three darknesses. That is Allah, your Lord; to Him belongs dominion. There is no deity except Him, so how are you averted?"
      },
      {
        "language_name": "indonesian",
        "text": "Dia menciptakan kamu dari diri yang satu (Adam) kemudian darinya Dia jadikan pasangannya dan Dia menurunkan delapan pasang hewan ternak untukmu. Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian dalam tiga kegelapan. Yang (berbuat) demikian itu adalah Allah, Tuhan kamu, Tuhan yang memiliki kerajaan. Tidak ada tuhan selain Dia; maka mengapa kamu dapat dipalingkan?"
      }
    ],
    "verse_number": 6
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "إِن تَكْفُرُوا فَإِنَّ اللَّهَ غَنِيٌّ عَنكُمْ ۖ وَلَا يَرْضَىٰ لِعِبَادِهِ الْكُفْرَ ۖ وَإِن تَشْكُرُوا يَرْضَهُ لَكُمْ ۗ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ ثُمَّ إِلَىٰ رَبِّكُم مَّرْجِعُكُمْ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
    "translations": [
      {
        "language_name": "english",
        "text": "If you disbelieve -  indeed, Allah is Free from need of you. And He does not approve for His servants disbelief. And if you are grateful, He approves it for you; and no bearer of burdens will bear the burden of another. Then to your Lord is your return, and He will inform you about what you used to do. Indeed, He is Knowing of that within the breasts."
      },
      {
        "language_name": "indonesian",
        "text": "Jika kamu kafir (ketahuilah) maka sesungguhnya Allah tidak memerlukanmu dan Dia tidak meridhai kekafiran hamba-hamba-Nya. Jika kamu bersyukur, Dia meridhai kesyukuranmu itu. Seseorang yang berdosa tidak memikul dosa orang lain. Kemudian kepada Tuhanmulah kembalimu lalu Dia beritakan kepadamu apa yang telah kamu kerjakan. Sungguh, Dia Maha Mengetahui apa yang tersimpan dalam dada(mu)."
      }
    ],
    "verse_number": 7
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "وَإِذَا مَسَّ الْإِنسَانَ ضُرٌّ دَعَا رَبَّهُ مُنِيبًا إِلَيْهِ ثُمَّ إِذَا خَوَّلَهُ نِعْمَةً مِّنْهُ نَسِيَ مَا كَانَ يَدْعُو إِلَيْهِ مِن قَبْلُ وَجَعَلَ لِلَّهِ أَندَادًا لِّيُضِلَّ عَن سَبِيلِهِ ۚ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا ۖ إِنَّكَ مِنْ أَصْحَابِ النَّارِ",
    "translations": [
      {
        "language_name": "english",
        "text": "And when adversity touches man, he calls upon his Lord, turning to Him [alone]; then when He bestows on him a favor from Himself, he forgets Him whom he called upon before, and he attributes to Allah equals to mislead [people] from His way. Say, \"Enjoy your disbelief for a little; indeed, you are of the companions of the Fire.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan apabila manusia ditimpa bencana, dia memohon (pertolongan) kepada Tuhannya dengan kembali (taat) kepada-Nya; tetapi apabila Dia memberikan nikmat kepadanya dia lupa (akan bencana) yang pernah dia berdoa kepada Allah sebelum itu, dan diadakannya sekutu-sekutu bagi Allah untuk menyesatkan (manusia) dari jalan-Nya. Katakanlah, “Bersenang-senanglah kamu dengan kekafiranmu itu untuk sementara waktu. Sungguh, kamu termasuk penghuni neraka.”"
      }
    ],
    "verse_number": 8
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "أَمَّنْ هُوَ قَانِتٌ آنَاءَ اللَّيْلِ سَاجِدًا وَقَائِمًا يَحْذَرُ الْآخِرَةَ وَيَرْجُو رَحْمَةَ رَبِّهِ ۗ قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ ۗ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Apakah kamu orang musyrik yang lebih beruntung) ataukah orang yang beribadah pada waktu malam dengan sujud dan berdiri, karena takut kepada (azab) akhirat dan mengharapkan rahmat Tuhannya? Katakanlah, “Apakah sama orang-orang yang mengetahui dengan orang-orang yang tidak mengetahui?” Sebenarnya hanya orang yang berakal sehat yang dapat menerima pelajaran."
      },
      {
        "language_name": "english",
        "text": "Is one who is devoutly obedient during periods of the night, prostrating and standing [in prayer], fearing the Hereafter and hoping for the mercy of his Lord, [like one who does not]? Say, \"Are those who know equal to those who do not know?\" Only they will remember [who are] people of understanding."
      }
    ],
    "verse_number": 9
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, \"O My servants who have believed, fear your Lord. For those who do good in this world is good, and the earth of Allah is spacious. Indeed, the patient will be given their reward without account.\""
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah (Muhammad), “Wahai hamba-hamba-Ku yang beriman! Bertakwalah kepada Tuhanmu.” Bagi orang-orang yang berbuat baik di dunia ini akan memperoleh kebaikan. Dan bumi Allah itu luas. Hanya orang-orang yang bersabarlah yang disempurnakan pahalanya tanpa batas."
      }
    ],
    "verse_number": 10
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "قُلْ إِنِّي أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ مُخْلِصًا لَّهُ الدِّينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, [O Muhammad], \"Indeed, I have been commanded to worship Allah, [being] sincere to Him in religion."
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah, “Sesungguhnya aku diperintahkan agar menyembah Allah dengan penuh ketaatan kepada-Nya dalam (menjalankan) agama."
      }
    ],
    "verse_number": 11
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ الْمُسْلِمِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan aku diperintahkan agar menjadi orang yang pertama-tama berserah diri.”"
      },
      {
        "language_name": "english",
        "text": "And I have been commanded to be the first [among you] of the Muslims.\""
      }
    ],
    "verse_number": 12
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "قُلْ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\""
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah, “Sesungguhnya aku takut akan azab pada hari yang besar jika aku durhaka kepada Tuhanku.”"
      }
    ],
    "verse_number": 13
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "قُلِ اللَّهَ أَعْبُدُ مُخْلِصًا لَّهُ دِينِي",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Katakanlah, “Hanya Allah yang aku sembah dengan penuh ketaatan kepada-Nya dalam (menjalankan) agamaku.”"
      },
      {
        "language_name": "english",
        "text": "Say, \" Allah [alone] do I worship, sincere to Him in my religion,"
      }
    ],
    "verse_number": 14
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "فَاعْبُدُوا مَا شِئْتُم مِّن دُونِهِ ۗ قُلْ إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ ۗ أَلَا ذَٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka sembahlah selain Dia sesukamu! (wahai orang-orang musyrik). Katakanlah, “Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari Kiamat.” Ingatlah! Yang demikian itu adalah kerugian yang nyata."
      },
      {
        "language_name": "english",
        "text": "So worship what you will besides Him.\" Say, \"Indeed, the losers are the ones who will lose themselves and their families on the Day of Resurrection. Unquestionably, that is the manifest loss.\""
      }
    ],
    "verse_number": 15
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "لَهُم مِّن فَوْقِهِمْ ظُلَلٌ مِّنَ النَّارِ وَمِن تَحْتِهِمْ ظُلَلٌ ۚ ذَٰلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ ۚ يَا عِبَادِ فَاتَّقُونِ",
    "translations": [
      {
        "language_name": "english",
        "text": "They will have canopies of fire above them and below them, canopies. By that Allah threatens His servants. O My servants, then fear Me."
      },
      {
        "language_name": "indonesian",
        "text": "Di atas mereka ada lapisan-lapisan dari api dan di bawahnya juga ada lapisan-lapisan yang disediakan bagi mereka. Demikianlah Allah mengancam hamba-hamba-Nya (dengan azab itu). “Wahai hamba-hamba-Ku, maka bertakwalah kepada-Ku.”"
      }
    ],
    "verse_number": 16
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "وَالَّذِينَ اجْتَنَبُوا الطَّاغُوتَ أَن يَعْبُدُوهَا وَأَنَابُوا إِلَى اللَّهِ لَهُمُ الْبُشْرَىٰ ۚ فَبَشِّرْ عِبَادِ",
    "translations": [
      {
        "language_name": "english",
        "text": "But those who have avoided Taghut, lest they worship it, and turned back to Allah -  for them are good tidings. So give good tidings to My servants"
      },
      {
        "language_name": "indonesian",
        "text": "Dan orang-orang yang menjauhi °agut (yaitu) tidak menyembahnya dan kembali kepada Allah, mereka pantas mendapat berita gembira; sebab itu sampaikanlah kabar gembira itu kepada hamba-hamba-Ku,"
      }
    ],
    "verse_number": 17
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ ۚ أُولَٰئِكَ الَّذِينَ هَدَاهُمُ اللَّهُ ۖ وَأُولَٰئِكَ هُمْ أُولُو الْأَلْبَابِ",
    "translations": [
      {
        "language_name": "english",
        "text": "Who listen to speech and follow the best of it. Those are the ones Allah has guided, and those are people of understanding."
      },
      {
        "language_name": "indonesian",
        "text": "(yaitu) mereka yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya. Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah dan mereka itulah orang-orang yang mempunyai akal sehat."
      }
    ],
    "verse_number": 18
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِ أَفَأَنتَ تُنقِذُ مَن فِي النَّارِ",
    "translations": [
      {
        "language_name": "english",
        "text": "Then, is one who has deserved the decree of punishment [to be guided]? Then, can you save one who is in the Fire?"
      },
      {
        "language_name": "indonesian",
        "text": "Maka apakah (engkau hendak mengubah nasib) orang-orang yang telah dipastikan mendapat azab? Apakah engkau (Muhammad) akan menyelamatkan orang yang berada dalam api neraka?"
      }
    ],
    "verse_number": 19
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "لَٰكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِّن فَوْقِهَا غُرَفٌ مَّبْنِيَّةٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ وَعْدَ اللَّهِ ۖ لَا يُخْلِفُ اللَّهُ الْمِيعَادَ",
    "translations": [
      {
        "language_name": "english",
        "text": "But those who have feared their Lord -  for them are chambers, above them chambers built high, beneath which rivers flow. [This is] the promise of Allah . Allah does not fail in [His] promise."
      },
      {
        "language_name": "indonesian",
        "text": "Tetapi orang-orang yang bertakwa kepada Tuhannya, mereka mendapat kamar-kamar (di surga), di atasnya terdapat pula kamar-kamar yang dibangun (bertingkat-tingkat), yang mengalir di bawahnya sungai-sungai. (Itulah) janji Allah. Allah tidak akan memungkiri janji(-Nya)."
      }
    ],
    "verse_number": 20
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "أَلَمْ تَرَ أَنَّ اللَّهَ أَنزَلَ مِنَ السَّمَاءِ مَاءً فَسَلَكَهُ يَنَابِيعَ فِي الْأَرْضِ ثُمَّ يُخْرِجُ بِهِ زَرْعًا مُّخْتَلِفًا أَلْوَانُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَجْعَلُهُ حُطَامًا ۚ إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِأُولِي الْأَلْبَابِ",
    "translations": [
      {
        "language_name": "english",
        "text": "Do you not see that Allah sends down rain from the sky and makes it flow as springs [and rivers] in the earth; then He produces thereby crops of varying colors; then they dry and you see them turned yellow; then He makes them [scattered] debris. Indeed in that is a reminder for those of understanding."
      },
      {
        "language_name": "indonesian",
        "text": "Apakah engkau tidak memperhatikan, bahwa Allah menurunkan air dari langit, lalu diaturnya menjadi sumber-sumber air di bumi, kemudian dengan air itu ditumbuhkan-Nya tanam-tanaman yang bermacam-macam warnanya, kemudian menjadi kering, lalu engkau melihatnya kekuning-kuningan, kemudian dijadikan-Nya hancur berderai-derai. Sungguh, pada yang demikian itu terdapat pelajaran bagi orang-orang yang mempunyai akal sehat."
      }
    ],
    "verse_number": 21
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "أَفَمَن شَرَحَ اللَّهُ صَدْرَهُ لِلْإِسْلَامِ فَهُوَ عَلَىٰ نُورٍ مِّن رَّبِّهِ ۚ فَوَيْلٌ لِّلْقَاسِيَةِ قُلُوبُهُم مِّن ذِكْرِ اللَّهِ ۚ أُولَٰئِكَ فِي ضَلَالٍ مُّبِينٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka apakah orang-orang yang dibukakan hatinya oleh Allah untuk (menerima) agama Islam lalu dia mendapat cahaya dari Tuhannya (sama dengan orang yang hatinya membatu)? Maka celakalah mereka yang hatinya telah membatu untuk mengingat Allah. Mereka itu dalam kesesatan yang nyata."
      },
      {
        "language_name": "english",
        "text": "So is one whose breast Allah has expanded to [accept] Islam and he is upon a light from his Lord [like one whose heart rejects it]? Then woe to those whose hearts are hardened against the remembrance of Allah . Those are in manifest error."
      }
    ],
    "verse_number": 22
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "اللَّهُ نَزَّلَ أَحْسَنَ الْحَدِيثِ كِتَابًا مُّتَشَابِهًا مَّثَانِيَ تَقْشَعِرُّ مِنْهُ جُلُودُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ اللَّهِ ۚ ذَٰلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَن يَشَاءُ ۚ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Allah telah menurunkan perkataan yang paling baik (yaitu) Al-Qur\u0027an yang serupa (ayat-ayatnya) lagi berulang-ulang, gemetar karenanya kulit orang-orang yang takut kepada Tuhannya, kemudian menjadi tenang kulit dan hati mereka ketika mengingat Allah. Itulah petunjuk Allah, dengan Kitab itu Dia memberi petunjuk kepada siapa yang Dia kehendaki. Dan barangsiapa dibiarkan sesat oleh Allah, maka tidak seorang pun yang dapat memberi petunjuk."
      },
      {
        "language_name": "english",
        "text": "Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah . That is the guidance of Allah by which He guides whom He wills. And one whom Allah leaves astray -  for him there is no guide."
      }
    ],
    "verse_number": 23
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "أَفَمَن يَتَّقِي بِوَجْهِهِ سُوءَ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَقِيلَ لِلظَّالِمِينَ ذُوقُوا مَا كُنتُمْ تَكْسِبُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka apakah orang-orang yang melindungi wajahnya menghindari azab yang buruk pada hari Kiamat (sama dengan orang mukmin yang tidak kena azab)? Dan dikatakan kepada orang-orang yang zhalim, “Rasakanlah olehmu balasan apa yang telah kamu kerjakan.”"
      },
      {
        "language_name": "english",
        "text": "Then is he who will shield with his face the worst of the punishment on the Day of Resurrection [like one secure from it]? And it will be said to the wrongdoers, \"Taste what you used to earn.\""
      }
    ],
    "verse_number": 24
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ فَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Orang-orang yang sebelum mereka telah mendustakan (rasul-rasul), maka datanglah kepada mereka azab dari arah yang tidak mereka sangka."
      },
      {
        "language_name": "english",
        "text": "Those before them denied, and punishment came upon them from where they did not perceive."
      }
    ],
    "verse_number": 25
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "فَأَذَاقَهُمُ اللَّهُ الْخِزْيَ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Maka Allah menimpakan kepada mereka kehinaan pada kehidupan dunia. Dan sungguh, azab akhirat lebih besar, kalau (saja) mereka mengetahui."
      },
      {
        "language_name": "english",
        "text": "So Allah made them taste disgrace in worldly life. But the punishment of the Hereafter is greater, if they only knew."
      }
    ],
    "verse_number": 26
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِي هَٰذَا الْقُرْآنِ مِن كُلِّ مَثَلٍ لَّعَلَّهُمْ يَتَذَكَّرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And We have certainly presented for the people in this Qur\u0027an from every [kind of] example -  that they might remember."
      },
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, telah Kami buatkan dalam Al-Qur\u0027an ini segala macam perumpamaan bagi manusia agar mereka dapat pelajaran."
      }
    ],
    "verse_number": 27
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "قُرْآنًا عَرَبِيًّا غَيْرَ ذِي عِوَجٍ لَّعَلَّهُمْ يَتَّقُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "(Yaitu) Al-Qur\u0027an dalam bahasa Arab, tidak ada kebengkokan (di dalamnya) agar mereka bertakwa."
      },
      {
        "language_name": "english",
        "text": "[It is] an Arabic Qur\u0027an, without any deviance that they might become righteous."
      }
    ],
    "verse_number": 28
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "ضَرَبَ اللَّهُ مَثَلًا رَّجُلًا فِيهِ شُرَكَاءُ مُتَشَاكِسُونَ وَرَجُلًا سَلَمًا لِّرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Allah presents an example: a slave owned by quarreling partners and another belonging exclusively to one man -  are they equal in comparison? Praise be to Allah ! But most of them do not know."
      },
      {
        "language_name": "indonesian",
        "text": "Allah membuat perumpamaan (yaitu) seorang laki-laki (hamba sahaya) yang dimiliki oleh beberapa orang yang berserikat yang dalam perselisihan, dan seorang hamba sahaya yang menjadi milik penuh dari seorang (saja). Adakah kedua hamba sahaya itu sama keadaannya? Segala puji bagi Allah, tetapi kebanyakan mereka tidak mengetahui."
      }
    ],
    "verse_number": 29
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "إِنَّكَ مَيِّتٌ وَإِنَّهُم مَّيِّتُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sesungguhnya engkau (Muhammad) akan mati dan mereka akan mati (pula)."
      },
      {
        "language_name": "english",
        "text": "Indeed, you are to die, and indeed, they are to die."
      }
    ],
    "verse_number": 30
  },
  {
    "chapter_id": 39,
    "juz_number": 23,
    "text_madani": "ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ عِندَ رَبِّكُمْ تَخْتَصِمُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Kemudian sesungguhnya kamu pada hari Kiamat akan berbantah-bantahan di hadapan Tuhanmu."
      },
      {
        "language_name": "english",
        "text": "Then indeed you, on the Day of Resurrection, before your Lord, will dispute."
      }
    ],
    "verse_number": 31
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "فَمَنْ أَظْلَمُ مِمَّن كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِّلْكَافِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "So who is more unjust than one who lies about Allah and denies the truth when it has come to him? Is there not in Hell a residence for the disbelievers?"
      },
      {
        "language_name": "indonesian",
        "text": "Maka siapakah yang lebih zhalim daripada orang yang membuat-buat kebohongan terhadap Allah dan mendustakan kebenaran yang datang kepadanya? Bukankah di neraka Jahanam tempat tinggal bagi orang-orang kafir?"
      }
    ],
    "verse_number": 32
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ ۙ أُولَٰئِكَ هُمُ الْمُتَّقُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan orang yang membawa kebenaran (Muhammad) dan orang yang membenarkannya, mereka itulah orang yang bertakwa."
      },
      {
        "language_name": "english",
        "text": "And the one who has brought the truth and [they who] believed in it -  those are the righteous."
      }
    ],
    "verse_number": 33
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "لَهُم مَّا يَشَاءُونَ عِندَ رَبِّهِمْ ۚ ذَٰلِكَ جَزَاءُ الْمُحْسِنِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Mereka memperoleh apa yang mereka kehendaki di sisi Tuhannya. Demikianlah balasan bagi orang-orang yang berbuat baik,"
      },
      {
        "language_name": "english",
        "text": "They will have whatever they desire with their Lord. That is the reward of the doers of good -"
      }
    ],
    "verse_number": 34
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "لِيُكَفِّرَ اللَّهُ عَنْهُمْ أَسْوَأَ الَّذِي عَمِلُوا وَيَجْزِيَهُمْ أَجْرَهُم بِأَحْسَنِ الَّذِي كَانُوا يَعْمَلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "That Allah may remove from them the worst of what they did and reward them their due for the best of what they used to do."
      },
      {
        "language_name": "indonesian",
        "text": "agar Allah menghapus perbuatan mereka yang paling buruk yang pernah mereka lakukan dan memberi pahala kepada mereka dengan yang lebih baik daripada apa yang mereka kerjakan."
      }
    ],
    "verse_number": 35
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "أَلَيْسَ اللَّهُ بِكَافٍ عَبْدَهُ ۖ وَيُخَوِّفُونَكَ بِالَّذِينَ مِن دُونِهِ ۚ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Bukankah Allah yang mencukupi hamba-Nya? Mereka menakut-nakutimu dengan (sesembahan) yang selain Dia. Barangsiapa dibiarkan sesat oleh Allah maka tidak seorang pun yang dapat memberi petunjuk kepadanya."
      },
      {
        "language_name": "english",
        "text": "Is not Allah sufficient for His Servant [Prophet Muhammad]? And [yet], they threaten you with those [they worship] other than Him. And whoever Allah leaves astray -  for him there is no guide."
      }
    ],
    "verse_number": 36
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَمَن يَهْدِ اللَّهُ فَمَا لَهُ مِن مُّضِلٍّ ۗ أَلَيْسَ اللَّهُ بِعَزِيزٍ ذِي انتِقَامٍ",
    "translations": [
      {
        "language_name": "english",
        "text": "And whoever Allah guides -  for him there is no misleader. Is not Allah Exalted in Might and Owner of Retribution?"
      },
      {
        "language_name": "indonesian",
        "text": "Dan barangsiapa diberi petunjuk oleh Allah, maka tidak seorang pun yang dapat menyesatkannya. Bukankah Allah Mahaperkasa dan mempunyai (kekuasaan untuk) menghukum?"
      }
    ],
    "verse_number": 37
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلْ أَفَرَأَيْتُم مَّا تَدْعُونَ مِن دُونِ اللَّهِ إِنْ أَرَادَنِيَ اللَّهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّهِ أَوْ أَرَادَنِي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِهِ ۚ قُلْ حَسْبِيَ اللَّهُ ۖ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And if you asked them, \"Who created the heavens and the earth?\" they would surely say, \" Allah .\" Say, \"Then have you considered what you invoke besides Allah ? If Allah intended me harm, are they removers of His harm; or if He intended me mercy, are they withholders of His mercy?\" Say, \"Sufficient for me is Allah ; upon Him [alone] rely the [wise] reliers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, jika engkau tanyakan kepada mereka, “Siapakah yang menciptakan langit dan bumi?” Niscaya mereka menjawab, “Allah.” Katakanlah, “Kalau begitu tahukah kamu tentang apa yang kamu sembah selain Allah, jika Allah hendak mendatangkan bencana kepadaku, apakah mereka mampu menghilangkan bencana itu, atau jika Allah hendak memberi rahmat kepadaku, apakah mereka dapat mencegah rahmat-Nya?” Katakanlah, “Cukuplah Allah bagiku. Kepada-Nyalah orang-orang yang bertawakal berserah diri.”"
      }
    ],
    "verse_number": 38
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "قُلْ يَا قَوْمِ اعْمَلُوا عَلَىٰ مَكَانَتِكُمْ إِنِّي عَامِلٌ ۖ فَسَوْفَ تَعْلَمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, \"O my people, work according to your position, [for] indeed, I am working; and you are going to know"
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah (Muhammad), “Wahai kaumku! Berbuatlah menurut kedudukanmu, aku pun berbuat (demikian). Kelak kamu akan mengetahui,"
      }
    ],
    "verse_number": 39
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ",
    "translations": [
      {
        "language_name": "english",
        "text": "To whom will come a torment disgracing him and on whom will descend an enduring punishment.\""
      },
      {
        "language_name": "indonesian",
        "text": "siapa yang mendapat siksa yang menghinakan dan kepadanya ditimpakan azab yang kekal.”"
      }
    ],
    "verse_number": 40
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "إِنَّا أَنزَلْنَا عَلَيْكَ الْكِتَابَ لِلنَّاسِ بِالْحَقِّ ۖ فَمَنِ اهْتَدَىٰ فَلِنَفْسِهِ ۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَا أَنتَ عَلَيْهِم بِوَكِيلٍ",
    "translations": [
      {
        "language_name": "english",
        "text": "Indeed, We sent down to you the Book for the people in truth. So whoever is guided -  it is for [the benefit of] his soul; and whoever goes astray only goes astray to its detriment. And you are not a manager over them."
      },
      {
        "language_name": "indonesian",
        "text": "Sungguh, Kami menurunkan kepadamu Kitab (Al-Qur\u0027an) dengan membawa kebenaran untuk manusia; barangsiapa mendapat petunjuk maka (petunjuk itu) untuk dirinya sendiri, dan siapa sesat maka sesungguhnya kesesatan itu untuk dirinya sendiri, dan engkau bukanlah orang yang bertanggung jawab terhadap mereka."
      }
    ],
    "verse_number": 41
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "اللَّهُ يَتَوَفَّى الْأَنفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا ۖ فَيُمْسِكُ الَّتِي قَضَىٰ عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْأُخْرَىٰ إِلَىٰ أَجَلٍ مُّسَمًّى ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Allah memegang nyawa (seseorang) pada saat kematiannya dan nyawa (seseorang) yang belum mati ketika dia tidur; maka Dia tahan nyawa (orang) yang telah Dia tetapkan kematiannya dan Dia lepaskan nyawa yang lain sampai waktu yang ditentukan. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran) Allah bagi kaum yang berpikir."
      },
      {
        "language_name": "english",
        "text": "Allah takes the souls at the time of their death, and those that do not die [He takes] during their sleep. Then He keeps those for which He has decreed death and releases the others for a specified term. Indeed in that are signs for a people who give thought."
      }
    ],
    "verse_number": 42
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "أَمِ اتَّخَذُوا مِن دُونِ اللَّهِ شُفَعَاءَ ۚ قُلْ أَوَلَوْ كَانُوا لَا يَمْلِكُونَ شَيْئًا وَلَا يَعْقِلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Ataukah mereka mengambil penolong selain Allah. Katakanlah, “Apakah (kamu mengambilnya juga) meskipun mereka tidak memiliki sesuatu apa pun dan tidak mengerti?”"
      },
      {
        "language_name": "english",
        "text": "Or have they taken other than Allah as intercessors? Say, \"Even though they do not possess [power over] anything, nor do they reason?\""
      }
    ],
    "verse_number": 43
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "قُل لِّلَّهِ الشَّفَاعَةُ جَمِيعًا ۖ لَّهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, \"To Allah belongs [the right to allow] intercession entirely. To Him belongs the dominion of the heavens and the earth. Then to Him you will be returned.\""
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah, “Pertolongan itu hanya milik Allah semuanya. Dia memiliki kerajaan langit dan bumi. Kemudian kepada-Nya kamu dikembalikan.”"
      }
    ],
    "verse_number": 44
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ ۖ وَإِذَا ذُكِرَ الَّذِينَ مِن دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan apabila yang disebut hanya nama Allah, kesal sekali hati orang-orang yang tidak beriman kepada akhirat. Namun apabila nama-nama sembahan selain Allah yang disebut, tiba-tiba mereka menjadi bergembira."
      },
      {
        "language_name": "english",
        "text": "And when Allah is mentioned alone, the hearts of those who do not believe in the Hereafter shrink with aversion, but when those [worshipped] other than Him are mentioned, immediately they rejoice."
      }
    ],
    "verse_number": 45
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "قُلِ اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِي مَا كَانُوا فِيهِ يَخْتَلِفُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, \"O Allah, Creator of the heavens and the earth, Knower of the unseen and the witnessed, You will judge between your servants concerning that over which they used to differ.\""
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah, “Ya Allah, Pencipta langit dan bumi, yang mengetahui segala yang gaib dan yang nyata, Engkaulah yang memutuskan di antara hamba-hamba-Mu tentang apa yang selalu mereka perselisihkan.”"
      }
    ],
    "verse_number": 46
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُوا مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ مِن سُوءِ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَبَدَا لَهُم مِّنَ اللَّهِ مَا لَمْ يَكُونُوا يَحْتَسِبُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And if those who did wrong had all that is in the earth entirely and the like of it with it, they would [attempt to] ransom themselves thereby from the worst of the punishment on the Day of Resurrection. And there will appear to them from Allah that which they had not taken into account."
      },
      {
        "language_name": "indonesian",
        "text": "Dan sekiranya orang-orang yang zhalim mempunyai segala apa yang ada di bumi dan ditambah lagi sebanyak itu, niscaya mereka akan menebus dirinya dengan itu dari azab yang buruk pada hari Kiamat. Dan jelaslah bagi mereka azab dari Allah yang dahulu tidak pernah mereka perkirakan."
      }
    ],
    "verse_number": 47
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَبَدَا لَهُمْ سَيِّئَاتُ مَا كَسَبُوا وَحَاقَ بِهِم مَّا كَانُوا بِهِ يَسْتَهْزِئُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan jelaslah bagi mereka kejahatan apa yang telah mereka kerjakan dan mereka diliputi oleh apa yang dahulu mereka selalu memperolok-olokkannya."
      },
      {
        "language_name": "english",
        "text": "And there will appear to them the evils they had earned, and they will be enveloped by what they used to ridicule."
      }
    ],
    "verse_number": 48
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "فَإِذَا مَسَّ الْإِنسَانَ ضُرٌّ دَعَانَا ثُمَّ إِذَا خَوَّلْنَاهُ نِعْمَةً مِّنَّا قَالَ إِنَّمَا أُوتِيتُهُ عَلَىٰ عِلْمٍ ۚ بَلْ هِيَ فِتْنَةٌ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And when adversity touches man, he calls upon Us; then when We bestow on him a favor from Us, he says, \"I have only been given it because of [my] knowledge.\" Rather, it is a trial, but most of them do not know."
      },
      {
        "language_name": "indonesian",
        "text": "Maka apabila manusia ditimpa bencana dia menyeru Kami, kemudian apabila Kami berikan nikmat Kami kepadanya dia berkata, “Sesungguhnya aku diberi nikmat ini hanyalah karena kepintaranku.” Sebenarnya, itu adalah ujian, tetapi kebanyakan mereka tidak mengetahui."
      }
    ],
    "verse_number": 49
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "قَدْ قَالَهَا الَّذِينَ مِن قَبْلِهِمْ فَمَا أَغْنَىٰ عَنْهُم مَّا كَانُوا يَكْسِبُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Those before them had already said it, but they were not availed by what they used to earn."
      },
      {
        "language_name": "indonesian",
        "text": "Sungguh, orang-orang yang sebelum mereka pun telah mengatakan hal itu, maka tidak berguna lagi bagi mereka apa yang dahulu mereka kerjakan."
      }
    ],
    "verse_number": 50
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "فَأَصَابَهُمْ سَيِّئَاتُ مَا كَسَبُوا ۚ وَالَّذِينَ ظَلَمُوا مِنْ هَٰؤُلَاءِ سَيُصِيبُهُمْ سَيِّئَاتُ مَا كَسَبُوا وَمَا هُم بِمُعْجِزِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And the evil consequences of what they earned struck them. And those who have wronged of these [people] will be afflicted by the evil consequences of what they earned; and they will not cause failure."
      },
      {
        "language_name": "indonesian",
        "text": "Lalu mereka ditimpa (bencana) dari akibat buruk apa yang mereka perbuat. Dan orang-orang yang zhalim di antara mereka juga akan ditimpa (bencana) dari akibat buruk apa yang mereka kerjakan dan mereka tidak dapat melepaskan diri."
      }
    ],
    "verse_number": 51
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "أَوَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ وَيَقْدِرُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يُؤْمِنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Do they not know that Allah extends provision for whom He wills and restricts [it]? Indeed in that are signs for a people who believe."
      },
      {
        "language_name": "indonesian",
        "text": "Dan tidakkah mereka mengetahui bahwa Allah melapangkan rezeki bagi siapa yang Dia kehendaki dan membatasinya (bagi siapa yang Dia kehendaki)? Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang beriman."
      }
    ],
    "verse_number": 52
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
    "translations": [
      {
        "language_name": "english",
        "text": "Say, \"O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah . Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.\""
      },
      {
        "language_name": "indonesian",
        "text": "Katakanlah, “Wahai hamba-hamba-Ku yang melampaui batas terhadap diri mereka sendiri! Janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sungguh, Dialah Yang Maha Pengampun, Maha Penyayang."
      }
    ],
    "verse_number": 53
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَأَنِيبُوا إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا لَهُ مِن قَبْلِ أَن يَأْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنصَرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And return [in repentance] to your Lord and submit to Him before the punishment comes upon you; then you will not be helped."
      },
      {
        "language_name": "indonesian",
        "text": "Dan kembalilah kamu kepada Tuhanmu, dan berserah dirilah kepada-Nya sebelum datang azab kepadamu, kemudian kamu tidak dapat ditolong."
      }
    ],
    "verse_number": 54
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَاتَّبِعُوا أَحْسَنَ مَا أُنزِلَ إِلَيْكُم مِّن رَّبِّكُم مِّن قَبْلِ أَن يَأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَأَنتُمْ لَا تَشْعُرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And follow the best of what was revealed to you from your Lord before the punishment comes upon you suddenly while you do not perceive,"
      },
      {
        "language_name": "indonesian",
        "text": "Dan ikutilah sebaik-baik apa yang telah diturunkan kepadamu (Al-Qur\u0027an) dari Tuhanmu sebelum datang azab kepadamu secara mendadak, sedang kamu tidak menyadarinya,"
      }
    ],
    "verse_number": 55
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "أَن تَقُولَ نَفْسٌ يَا حَسْرَتَا عَلَىٰ مَا فَرَّطتُ فِي جَنبِ اللَّهِ وَإِن كُنتُ لَمِنَ السَّاخِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "agar jangan ada orang yang mengatakan, ‘Alangkah besar penyesalanku atas kelalaianku dalam (menunaikan kewajiban) terhadap Allah, dan sesungguhnya aku termasuk orang-orang yang memperolok-olokkan (agama Allah),’"
      },
      {
        "language_name": "english",
        "text": "Lest a soul should say, \"Oh [how great is] my regret over what I neglected in regard to Allah and that I was among the mockers.\""
      }
    ],
    "verse_number": 56
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "أَوْ تَقُولَ لَوْ أَنَّ اللَّهَ هَدَانِي لَكُنتُ مِنَ الْمُتَّقِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Or [lest] it say, \"If only Allah had guided me, I would have been among the righteous.\""
      },
      {
        "language_name": "indonesian",
        "text": "atau (agar jangan) ada yang berkata, ‘Sekiranya Allah memberi petunjuk kepadaku tentulah aku termasuk orang-orang yang bertakwa,’"
      }
    ],
    "verse_number": 57
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "أَوْ تَقُولَ حِينَ تَرَى الْعَذَابَ لَوْ أَنَّ لِي كَرَّةً فَأَكُونَ مِنَ الْمُحْسِنِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "Or [lest] it say when it sees the punishment, \"If only I had another turn so I could be among the doers of good.\""
      },
      {
        "language_name": "indonesian",
        "text": "atau (agar jangan) ada yang berkata ketika melihat azab, ‘Sekiranya aku dapat kembali (ke dunia), tentu aku termasuk orang-orang yang berbuat baik.’"
      }
    ],
    "verse_number": 58
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "بَلَىٰ قَدْ جَاءَتْكَ آيَاتِي فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنتَ مِنَ الْكَافِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Sungguh, sebenarnya keterangan-keterangan-Ku telah datang kepadamu, tetapi kamu mendustakannya, malah kamu menyombongkan diri dan termasuk orang kafir.”"
      },
      {
        "language_name": "english",
        "text": "But yes, there had come to you My verses, but you denied them and were arrogant, and you were among the disbelievers."
      }
    ],
    "verse_number": 59
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَيَوْمَ الْقِيَامَةِ تَرَى الَّذِينَ كَذَبُوا عَلَى اللَّهِ وُجُوهُهُم مُّسْوَدَّةٌ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِّلْمُتَكَبِّرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And on the Day of Resurrection you will see those who lied about Allah [with] their faces blackened. Is there not in Hell a residence for the arrogant?"
      },
      {
        "language_name": "indonesian",
        "text": "Dan pada hari Kiamat engkau akan melihat orang-orang yang berbuat dusta terhadap Allah, wajahnya menghitam. Bukankah neraka Jahanam itu tempat tinggal bagi orang yang menyombongkan diri?"
      }
    ],
    "verse_number": 60
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَيُنَجِّي اللَّهُ الَّذِينَ اتَّقَوْا بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ السُّوءُ وَلَا هُمْ يَحْزَنُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And Allah will save those who feared Him by their attainment; no evil will touch them, nor will they grieve."
      },
      {
        "language_name": "indonesian",
        "text": "Dan Allah menyelamatkan orang-orang yang bertakwa karena kemenangan mereka. Mereka tidak disentuh oleh azab dan tidak bersedih hati."
      }
    ],
    "verse_number": 61
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "اللَّهُ خَالِقُ كُلِّ شَيْءٍ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ وَكِيلٌ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Allah pencipta segala sesuatu dan Dia Maha Pemelihara atas segala sesuatu."
      },
      {
        "language_name": "english",
        "text": "Allah is the Creator of all things, and He is, over all things, Disposer of affairs."
      }
    ],
    "verse_number": 62
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "لَّهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَالَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Milik-Nyalah kunci-kunci (perbenda-haraan) langit dan bumi. Dan orang-orang yang kafir terhadap ayat-ayat Allah, mereka itulah orang yang rugi."
      },
      {
        "language_name": "english",
        "text": "To Him belong the keys of the heavens and the earth. And they who disbelieve in the verses of Allah -  it is those who are the losers."
      }
    ],
    "verse_number": 63
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "قُلْ أَفَغَيْرَ اللَّهِ تَأْمُرُونِّي أَعْبُدُ أَيُّهَا الْجَاهِلُونَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Katakanlah (Muhammad), “Apakah kamu menyuruh aku menyembah selain Allah, wahai orang-orang yang bodoh?”"
      },
      {
        "language_name": "english",
        "text": "Say, [O Muhammad], \"Is it other than Allah that you order me to worship, O ignorant ones?\""
      }
    ],
    "verse_number": 64
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِن قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And it was already revealed to you and to those before you that if you should associate [anything] with Allah, your work would surely become worthless, and you would surely be among the losers.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan sungguh, telah diwahyukan kepadamu dan kepada (nabi-nabi) yang sebelummu, “Sungguh, jika engkau mempersekutukan (Allah), niscaya akan hapuslah amalmu dan tentulah engkau termasuk orang yang rugi."
      }
    ],
    "verse_number": 65
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "بَلِ اللَّهَ فَاعْبُدْ وَكُن مِّنَ الشَّاكِرِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Karena itu, hendaklah Allah saja yang engkau sembah dan hendaklah engkau termasuk orang yang bersyukur.”"
      },
      {
        "language_name": "english",
        "text": "Rather, worship [only] Allah and be among the grateful."
      }
    ],
    "verse_number": 66
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "They have not appraised Allah with true appraisal, while the earth entirely will be [within] His grip on the Day of Resurrection, and the heavens will be folded in His right hand. Exalted is He and high above what they associate with Him."
      },
      {
        "language_name": "indonesian",
        "text": "Dan mereka tidak mengagungkan Allah sebagaimana mestinya padahal bumi seluruhnya dalam genggaman-Nya pada hari Kiamat dan langit digulung dengan tangan kanan-Nya. Mahasuci Dia dan Mahatinggi Dia dari apa yang mereka persekutukan."
      }
    ],
    "verse_number": 67
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ إِلَّا مَن شَاءَ اللَّهُ ۖ ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنظُرُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And the Horn will be blown, and whoever is in the heavens and whoever is on the earth will fall dead except whom Allah wills. Then it will be blown again, and at once they will be standing, looking on."
      },
      {
        "language_name": "indonesian",
        "text": "Dan sangkakala pun ditiup, maka matilah semua (makhluk) yang di langit dan di bumi kecuali mereka yang dikehendaki Allah. Kemudian ditiup sekali lagi (sangkakala itu) maka seketika itu mereka bangun (dari kuburnya) menunggu (keputusan Allah)."
      }
    ],
    "verse_number": 68
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ الْكِتَابُ وَجِيءَ بِالنَّبِيِّينَ وَالشُّهَدَاءِ وَقُضِيَ بَيْنَهُم بِالْحَقِّ وَهُمْ لَا يُظْلَمُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And the earth will shine with the light of its Lord, and the record [of deeds] will be placed, and the prophets and the witnesses will be brought, and it will be judged between them in truth, and they will not be wronged."
      },
      {
        "language_name": "indonesian",
        "text": "Dan bumi (padang Mahsyar) menjadi terang benderang dengan cahaya (keadilan) Tuhannya; dan buku-buku (perhitungan perbuatan mereka) diberikan (kepada masing-masing), nabi-nabi dan saksi-saksi pun dihadirkan, lalu diberikan keputusan di antara mereka secara adil, sedang mereka tidak dirugikan."
      }
    ],
    "verse_number": 69
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And every soul will be fully compensated [for] what it did; and He is most knowing of what they do."
      },
      {
        "language_name": "indonesian",
        "text": "Dan kepada setiap jiwa diberi balasan dengan sempurna sesuai dengan apa yang telah dikerjakannya dan Dia lebih mengetahui apa yang mereka kerjakan."
      }
    ],
    "verse_number": 70
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَسِيقَ الَّذِينَ كَفَرُوا إِلَىٰ جَهَنَّمَ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا فُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنكُمْ يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ وَيُنذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا ۚ قَالُوا بَلَىٰ وَلَٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكَافِرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And those who disbelieved will be driven to Hell in groups until, when they reach it, its gates are opened and its keepers will say, \"Did there not come to you messengers from yourselves, reciting to you the verses of your Lord and warning you of the meeting of this Day of yours?\" They will say, \"Yes, but the word of punishment has come into effect upon the disbelievers."
      },
      {
        "language_name": "indonesian",
        "text": "Orang-orang yang kafir digiring ke neraka Jahanam secara berombongan. Sehingga apabila mereka sampai kepadanya (neraka) pintu-pintunya dibukakan dan penjaga-penjaga berkata kepada mereka, “Apakah belum pernah datang kepadamu rasul-rasul dari kalangan kamu yang membacakan ayat-ayat Tuhanmu dan memperingatkan kepadamu akan pertemuan (dengan) harimu ini?” Mereka menjawab, “Benar, ada,” tetapi ketetapan azab pasti berlaku terhadap orang-orang kafir."
      }
    ],
    "verse_number": 71
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "قِيلَ ادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "[To them] it will be said, \"Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dikatakan (kepada mereka), “Masukilah pintu-pintu neraka Jahanam itu, (kamu) kekal di dalamnya.” Maka (neraka Jahanam) itulah seburuk-buruk tempat tinggal bagi orang-orang yang menyombongkan diri."
      }
    ],
    "verse_number": 72
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَسِيقَ الَّذِينَ اتَّقَوْا رَبَّهُمْ إِلَى الْجَنَّةِ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا وَفُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَامٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوهَا خَالِدِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan orang-orang yang bertakwa kepada Tuhannya diantar ke dalam surga secara berombongan. Sehingga apabila mereka sampai kepadanya (surga) dan pintu-pintunya telah dibukakan, penjaga-penjaganya berkata kepada mereka, “Kesejahteraan (dilimpahkan) atasmu, berbahagialah kamu! Maka masuklah, kamu kekal di dalamnya.”"
      },
      {
        "language_name": "english",
        "text": "But those who feared their Lord will be driven to Paradise in groups until, when they reach it while its gates have been opened and its keepers say, \"Peace be upon you; you have become pure; so enter it to abide eternally therein,\" [they will enter]."
      }
    ],
    "verse_number": 73
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ وَأَوْرَثَنَا الْأَرْضَ نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ ۖ فَنِعْمَ أَجْرُ الْعَامِلِينَ",
    "translations": [
      {
        "language_name": "indonesian",
        "text": "Dan mereka berkata, “Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami dan telah memberikan tempat ini kepada kami sedang kami (diperkenankan) menempati surga di mana saja yang kami kehendaki.” Maka (surga itulah) sebaik-baik balasan bagi orang-orang yang beramal."
      },
      {
        "language_name": "english",
        "text": "And they will say, \"Praise to Allah, who has fulfilled for us His promise and made us inherit the earth [so] we may settle in Paradise wherever we will. And excellent is the reward of [righteous] workers.\""
      }
    ],
    "verse_number": 74
  },
  {
    "chapter_id": 39,
    "juz_number": 24,
    "text_madani": "وَتَرَى الْمَلَائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ۖ وَقُضِيَ بَيْنَهُم بِالْحَقِّ وَقِيلَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
    "translations": [
      {
        "language_name": "english",
        "text": "And you will see the angels surrounding the Throne, exalting [ Allah ] with praise of their Lord. And it will be judged between them in truth, and it will be said, \"[All] praise to Allah, Lord of the worlds.\""
      },
      {
        "language_name": "indonesian",
        "text": "Dan engkau (Muhammad) akan melihat malaikat-malaikat melingkar di sekeliling ‘Arsy, bertasbih sambil memuji Tuhannya; lalu diberikan keputusan di antara mereka (hamba-hamba Allah) secara adil dan dikatakan, “Segala puji bagi Allah, Tuhan seluruh alam.”"
      }
    ],
    "verse_number": 75
  }
]