[{"chapter_id":38,"juz_number":23,"text_madani":"ص ۚ وَالْقُرْآنِ ذِي الذِّكْرِ","translations":[{"language_name":"english","text":"Sad. By the Qur\u0027an containing reminder..."},{"language_name":"indonesian","text":"Sad, demi Al-Qur\u0027an yang mengandung peringatan."}],"verse_number":1},{"chapter_id":38,"juz_number":23,"text_madani":"بَلِ الَّذِينَ كَفَرُوا فِي عِزَّةٍ وَشِقَاقٍ","translations":[{"language_name":"indonesian","text":"Tetapi orang-orang yang kafir (berada) dalam kesombongan dan permusuhan."},{"language_name":"english","text":"But those who disbelieve are in pride and dissension."}],"verse_number":2},{"chapter_id":38,"juz_number":23,"text_madani":"كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ فَنَادَوا وَّلَاتَ حِينَ مَنَاصٍ","translations":[{"language_name":"indonesian","text":"Betapa banyak umat sebelum mereka yang telah Kami binasakan, lalu mereka meminta tolong padahal (waktu itu) bukanlah saat untuk lari melepaskan diri."},{"language_name":"english","text":"How many a generation have We destroyed before them, and they [then] called out; but it was not a time for escape."}],"verse_number":3},{"chapter_id":38,"juz_number":23,"text_madani":"وَعَجِبُوا أَن جَاءَهُم مُّنذِرٌ مِّنْهُمْ ۖ وَقَالَ الْكَافِرُونَ هَٰذَا سَاحِرٌ كَذَّابٌ","translations":[{"language_name":"english","text":"And they wonder that there has come to them a warner from among themselves. And the disbelievers say, \"This is a magician and a liar."},{"language_name":"indonesian","text":"Dan mereka heran karena mereka kedatangan seorang pemberi peringatan (rasul) dari kalangan mereka; dan orang-orang kafir berkata, “Orang ini adalah pesihir yang banyak berdusta.”"}],"verse_number":4},{"chapter_id":38,"juz_number":23,"text_madani":"أَجَعَلَ الْآلِهَةَ إِلَٰهًا وَاحِدًا ۖ إِنَّ هَٰذَا لَشَيْءٌ عُجَابٌ","translations":[{"language_name":"english","text":"Has he made the gods [only] one God? Indeed, this is a curious thing.\""},{"language_name":"indonesian","text":"Apakah dia menjadikan tuhan-tuhan itu Tuhan yang satu saja? Sungguh, ini benar-benar sesuatu yang sangat mengherankan."}],"verse_number":5},{"chapter_id":38,"juz_number":23,"text_madani":"وَانطَلَقَ الْمَلَأُ مِنْهُمْ أَنِ امْشُوا وَاصْبِرُوا عَلَىٰ آلِهَتِكُمْ ۖ إِنَّ هَٰذَا لَشَيْءٌ يُرَادُ","translations":[{"language_name":"english","text":"And the eminent among them went forth, [saying], \"Continue, and be patient over [the defense of] your gods. Indeed, this is a thing intended."},{"language_name":"indonesian","text":"Lalu pergilah pemimpin-pemimpin mereka (seraya berkata), “Pergilah kamu dan tetaplah (menyembah) tuhan-tuhanmu, sesungguhnya ini benar-benar suatu hal yang dikehendaki."}],"verse_number":6},{"chapter_id":38,"juz_number":23,"text_madani":"مَا سَمِعْنَا بِهَٰذَا فِي الْمِلَّةِ الْآخِرَةِ إِنْ هَٰذَا إِلَّا اخْتِلَاقٌ","translations":[{"language_name":"english","text":"We have not heard of this in the latest religion. This is not but a fabrication."},{"language_name":"indonesian","text":"Kami tidak pernah mendengar hal ini dalam agama yang terakhir; ini (mengesakan Allah), tidak lain hanyalah (dusta) yang diada-adakan,"}],"verse_number":7},{"chapter_id":38,"juz_number":23,"text_madani":"أَأُنزِلَ عَلَيْهِ الذِّكْرُ مِن بَيْنِنَا ۚ بَلْ هُمْ فِي شَكٍّ مِّن ذِكْرِي ۖ بَل لَّمَّا يَذُوقُوا عَذَابِ","translations":[{"language_name":"indonesian","text":"mengapa Al-Qur\u0027an itu diturunkan kepada dia di antara kita?” Sebenarnya mereka ragu-ragu terhadap Al-Qur\u0027an-Ku, tetapi mereka belum merasakan azab(-Ku)."},{"language_name":"english","text":"Has the message been revealed to him out of [all of] us?\" Rather, they are in doubt about My message. Rather, they have not yet tasted My punishment."}],"verse_number":8},{"chapter_id":38,"juz_number":23,"text_madani":"أَمْ عِندَهُمْ خَزَائِنُ رَحْمَةِ رَبِّكَ الْعَزِيزِ الْوَهَّابِ","translations":[{"language_name":"indonesian","text":"Atau apakah mereka itu mempunyai perbendaharaan rahmat Tuhanmu Yang Mahaperkasa, Maha Pemberi?"},{"language_name":"english","text":"Or do they have the depositories of the mercy of your Lord, the Exalted in Might, the Bestower?"}],"verse_number":9},{"chapter_id":38,"juz_number":23,"text_madani":"أَمْ لَهُم مُّلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ فَلْيَرْتَقُوا فِي الْأَسْبَابِ","translations":[{"language_name":"english","text":"Or is theirs the dominion of the heavens and the earth and what is between them? Then let them ascend through [any] ways of access."},{"language_name":"indonesian","text":"Atau apakah mereka mempunyai kerajaan langit dan bumi dan apa yang ada di antara keduanya? (Jika ada), maka biarlah mereka menaiki tangga-tangga (ke langit)."}],"verse_number":10},{"chapter_id":38,"juz_number":23,"text_madani":"جُندٌ مَّا هُنَالِكَ مَهْزُومٌ مِّنَ الْأَحْزَابِ","translations":[{"language_name":"english","text":"[They are but] soldiers [who will be] defeated there among the companies [of disbelievers]."},{"language_name":"indonesian","text":"(Mereka itu) kelompok besar bala tentara yang berada di sana yang akan dikalahkan."}],"verse_number":11},{"chapter_id":38,"juz_number":23,"text_madani":"كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو الْأَوْتَادِ","translations":[{"language_name":"english","text":"The people of Noah denied before them, and [the tribe of] \u0027Aad and Pharaoh, the owner of stakes,"},{"language_name":"indonesian","text":"Sebelum mereka itu, kaum Nuh, ‘Ad dan Fir’aun yang mempunyai bala tentara yang banyak, juga telah mendustakan (rasul-rasul),"}],"verse_number":12},{"chapter_id":38,"juz_number":23,"text_madani":"وَثَمُودُ وَقَوْمُ لُوطٍ وَأَصْحَابُ الْأَيْكَةِ ۚ أُولَٰئِكَ الْأَحْزَابُ","translations":[{"language_name":"english","text":"And [the tribe of] Thamud and the people of Lot and the companions of the thicket. Those are the companies."},{"language_name":"indonesian","text":"dan (begitu juga) Tsamud, kaum Luth dan penduduk Aikah. Mereka itulah golongan-golongan yang bersekutu (menentang rasul-rasul)."}],"verse_number":13},{"chapter_id":38,"juz_number":23,"text_madani":"إِن كُلٌّ إِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ","translations":[{"language_name":"indonesian","text":"Semua mereka itu mendustakan rasul-rasul, maka pantas mereka merasakan azab-Ku."},{"language_name":"english","text":"Each of them denied the messengers, so My penalty was justified."}],"verse_number":14},{"chapter_id":38,"juz_number":23,"text_madani":"وَمَا يَنظُرُ هَٰؤُلَاءِ إِلَّا صَيْحَةً وَاحِدَةً مَّا لَهَا مِن فَوَاقٍ","translations":[{"language_name":"english","text":"And these [disbelievers] await not but one blast [of the Horn]; for it there will be no delay."},{"language_name":"indonesian","text":"Dan sebenarnya yang mereka tunggu adalah satu teriakan saja, yang tidak ada selanya."}],"verse_number":15},{"chapter_id":38,"juz_number":23,"text_madani":"وَقَالُوا رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبْلَ يَوْمِ الْحِسَابِ","translations":[{"language_name":"indonesian","text":"Dan mereka berkata, “Ya Tuhan kami, segerakanlah azab yang diperuntukkan bagi kami sebelum hari perhitungan.”"},{"language_name":"english","text":"And they say, \"Our Lord, hasten for us our share [of the punishment] before the Day of Account\""}],"verse_number":16},{"chapter_id":38,"juz_number":23,"text_madani":"اصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاذْكُرْ عَبْدَنَا دَاوُودَ ذَا الْأَيْدِ ۖ إِنَّهُ أَوَّابٌ","translations":[{"language_name":"english","text":"Be patient over what they say and remember Our servant, David, the possessor of strength; indeed, he was one who repeatedly turned back [to Allah ]."},{"language_name":"indonesian","text":"Bersabarlah atas apa yang mereka katakan; dan ingatlah akan hamba Kami Dawud yang mempunyai kekuatan; sungguh dia sangat taat (kepada Allah)."}],"verse_number":17},{"chapter_id":38,"juz_number":23,"text_madani":"إِنَّا سَخَّرْنَا الْجِبَالَ مَعَهُ يُسَبِّحْنَ بِالْعَشِيِّ وَالْإِشْرَاقِ","translations":[{"language_name":"english","text":"Indeed, We subjected the mountains [to praise] with him, exalting [ Allah ] in the [late] afternoon and [after] sunrise."},{"language_name":"indonesian","text":"Sungguh, Kamilah yang menundukkan gunung-gunung untuk bertasbih bersama dia (Dawud) pada waktu petang dan pagi,"}],"verse_number":18},{"chapter_id":38,"juz_number":23,"text_madani":"وَالطَّيْرَ مَحْشُورَةً ۖ كُلٌّ لَّهُ أَوَّابٌ","translations":[{"language_name":"english","text":"And the birds were assembled, all with him repeating [praises]."},{"language_name":"indonesian","text":"dan (Kami tundukkan pula) burung-burung dalam keadaan terkumpul. Masing-masing sangat taat (kepada Allah)."}],"verse_number":19},{"chapter_id":38,"juz_number":23,"text_madani":"وَشَدَدْنَا مُلْكَهُ وَآتَيْنَاهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ","translations":[{"language_name":"english","text":"And We strengthened his kingdom and gave him wisdom and discernment in speech."},{"language_name":"indonesian","text":"Dan Kami kuatkan kerajaannya dan Kami berikan hikmah kepadanya serta kebijaksanaan dalam memutuskan perkara."}],"verse_number":20},{"chapter_id":38,"juz_number":23,"text_madani":"وَهَلْ أَتَاكَ نَبَأُ الْخَصْمِ إِذْ تَسَوَّرُوا الْمِحْرَابَ","translations":[{"language_name":"indonesian","text":"Dan apakah telah sampai kepadamu berita orang-orang yang berselisih ketika mereka memanjat dinding mihrab?"},{"language_name":"english","text":"And has there come to you the news of the adversaries, when they climbed over the wall of [his] prayer chamber -"}],"verse_number":21},{"chapter_id":38,"juz_number":23,"text_madani":"إِذْ دَخَلُوا عَلَىٰ دَاوُودَ فَفَزِعَ مِنْهُمْ ۖ قَالُوا لَا تَخَفْ ۖ خَصْمَانِ بَغَىٰ بَعْضُنَا عَلَىٰ بَعْضٍ فَاحْكُم بَيْنَنَا بِالْحَقِّ وَلَا تُشْطِطْ وَاهْدِنَا إِلَىٰ سَوَاءِ الصِّرَاطِ","translations":[{"language_name":"indonesian","text":"ketika mereka masuk menemui Dawud lalu dia terkejut karena (kedatangan) mereka. Mereka berkata, “Janganlah takut! (Kami) berdua sedang berselisih, sebagian dari kami berbuat zhalim kepada yang lain; maka berilah keputusan di antara kami secara adil dan janganlah menyimpang dari kebenaran serta tunjukilah kami ke jalan yang lurus."},{"language_name":"english","text":"When they entered upon David and he was alarmed by them? They said, \"Fear not. [We are] two adversaries, one of whom has wronged the other, so judge between us with truth and do not exceed [it] and guide us to the sound path."}],"verse_number":22},{"chapter_id":38,"juz_number":23,"text_madani":"إِنَّ هَٰذَا أَخِي لَهُ تِسْعٌ وَتِسْعُونَ نَعْجَةً وَلِيَ نَعْجَةٌ وَاحِدَةٌ فَقَالَ أَكْفِلْنِيهَا وَعَزَّنِي فِي الْخِطَابِ","translations":[{"language_name":"indonesian","text":"Sesungguhnya saudaraku ini mempunyai sembilan puluh sembilan ekor kambing betina dan aku mempunyai seekor saja, lalu dia berkata, “Serahkanlah (kambingmu) itu kepadaku! Dan dia mengalahkan aku dalam perdebatan.”"},{"language_name":"english","text":"Indeed this, my brother, has ninety-nine ewes, and I have one ewe; so he said, \u0027Entrust her to me,\u0027 and he overpowered me in speech.\""}],"verse_number":23},{"chapter_id":38,"juz_number":23,"text_madani":"قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَىٰ نِعَاجِهِ ۖ وَإِنَّ كَثِيرًا مِّنَ الْخُلَطَاءِ لَيَبْغِي بَعْضُهُمْ عَلَىٰ بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَلِيلٌ مَّا هُمْ ۗ وَظَنَّ دَاوُودُ أَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ","translations":[{"language_name":"english","text":"[David] said, \"He has certainly wronged you in demanding your ewe [in addition] to his ewes. And indeed, many associates oppress one another, except for those who believe and do righteous deeds -  and few are they.\" And David became certain that We had tried him, and he asked forgiveness of his Lord and fell down bowing [in prostration] and turned in repentance [to Allah ]."},{"language_name":"indonesian","text":"Dia (Dawud) berkata, “Sungguh, dia telah berbuat zhalim kepadamu dengan meminta kambingmu itu untuk (ditambahkan) kepada kambingnya. Memang banyak di antara orang-orang yang bersekutu itu berbuat zhalim kepada yang lain, kecuali orang-orang yang beriman dan mengerjakan kebajikan; dan hanya sedikitlah mereka yang begitu.” Dan Dawud menduga bahwa Kami mengujinya; maka dia memohon ampunan kepada Tuhannya lalu menyungkur sujud dan bertobat."}],"verse_number":24},{"chapter_id":38,"juz_number":23,"text_madani":"فَغَفَرْنَا لَهُ ذَٰلِكَ ۖ وَإِنَّ لَهُ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَآبٍ","translations":[{"language_name":"english","text":"So We forgave him that; and indeed, for him is nearness to Us and a good place of return."},{"language_name":"indonesian","text":"Lalu Kami mengampuni (kesalahannya) itu. Dan sungguh, dia mempunyai kedudukan yang benar-benar dekat di sisi Kami dan tempat kembali yang baik."}],"verse_number":25},{"chapter_id":38,"juz_number":23,"text_madani":"يَا دَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُم بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ ۚ إِنَّ الَّذِينَ يَضِلُّونَ عَن سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ","translations":[{"language_name":"indonesian","text":"(Allah berfirman), “Wahai Dawud! Sesungguhnya engkau Kami jadikan khalifah (penguasa) di bumi, maka berilah keputusan (perkara) di antara manusia dengan adil dan janganlah engkau mengikuti hawa nafsu, karena akan menyesatkan engkau dari jalan Allah. Sungguh, orang-orang yang sesat dari jalan Allah akan mendapat azab yang berat, karena mereka melupakan hari perhitungan.”"},{"language_name":"english","text":"[We said], \"O David, indeed We have made you a successor upon the earth, so judge between the people in truth and do not follow [your own] desire, as it will lead you astray from the way of Allah .\" Indeed, those who go astray from the way of Allah will have a severe punishment for having forgotten the Day of Account."}],"verse_number":26},{"chapter_id":38,"juz_number":23,"text_madani":"وَمَا خَلَقْنَا السَّمَاءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا بَاطِلًا ۚ ذَٰلِكَ ظَنُّ الَّذِينَ كَفَرُوا ۚ فَوَيْلٌ لِّلَّذِينَ كَفَرُوا مِنَ النَّارِ","translations":[{"language_name":"indonesian","text":"Dan Kami tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya dengan sia-sia. Itu anggapan orang-orang kafir, maka celakalah orang-orang yang kafir itu karena mereka akan masuk neraka."},{"language_name":"english","text":"And We did not create the heaven and the earth and that between them aimlessly. That is the assumption of those who disbelieve, so woe to those who disbelieve from the Fire."}],"verse_number":27},{"chapter_id":38,"juz_number":23,"text_madani":"أَمْ نَجْعَلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَالْمُفْسِدِينَ فِي الْأَرْضِ أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ","translations":[{"language_name":"english","text":"Or should we treat those who believe and do righteous deeds like corrupters in the land? Or should We treat those who fear Allah like the wicked?"},{"language_name":"indonesian","text":"Pantaskah Kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan sama dengan orang-orang yang berbuat kerusakan di bumi? Atau pantaskah Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang jahat?"}],"verse_number":28},{"chapter_id":38,"juz_number":23,"text_madani":"كِتَابٌ أَنزَلْنَاهُ إِلَيْكَ مُبَارَكٌ لِّيَدَّبَّرُوا آيَاتِهِ وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ","translations":[{"language_name":"english","text":"[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded."},{"language_name":"indonesian","text":"Kitab (Al-Qur\u0027an) yang Kami turunkan kepadamu penuh berkah agar mereka menghayati ayat-ayatnya dan agar orang-orang yang berakal sehat mendapat pelajaran."}],"verse_number":29},{"chapter_id":38,"juz_number":23,"text_madani":"وَوَهَبْنَا لِدَاوُودَ سُلَيْمَانَ ۚ نِعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ","translations":[{"language_name":"english","text":"And to David We gave Solomon. An excellent servant, indeed he was one repeatedly turning back [to Allah ]."},{"language_name":"indonesian","text":"Dan kepada Dawud Kami karuniakan (anak bernama) Sulaiman; dia adalah sebaik-baik hamba. Sungguh, dia sangat taat (kepada Allah)."}],"verse_number":30},{"chapter_id":38,"juz_number":23,"text_madani":"إِذْ عُرِضَ عَلَيْهِ بِالْعَشِيِّ الصَّافِنَاتُ الْجِيَادُ","translations":[{"language_name":"english","text":"[Mention] when there were exhibited before him in the afternoon the poised [standing] racehorses."},{"language_name":"indonesian","text":"(Ingatlah) ketika pada suatu sore dipertunjukkan kepadanya (kuda-kuda) yang jinak, (tetapi) sangat cepat larinya,"}],"verse_number":31},{"chapter_id":38,"juz_number":23,"text_madani":"فَقَالَ إِنِّي أَحْبَبْتُ حُبَّ الْخَيْرِ عَن ذِكْرِ رَبِّي حَتَّىٰ تَوَارَتْ بِالْحِجَابِ","translations":[{"language_name":"english","text":"And he said, \"Indeed, I gave preference to the love of good [things] over the remembrance of my Lord until the sun disappeared into the curtain [of darkness].\""},{"language_name":"indonesian","text":"maka dia berkata, “Sesungguhnya aku menyukai segala yang baik (kuda), yang membuat aku ingat akan (kebesaran) Tuhanku, sampai matahari terbenam.”"}],"verse_number":32},{"chapter_id":38,"juz_number":23,"text_madani":"رُدُّوهَا عَلَيَّ ۖ فَطَفِقَ مَسْحًا بِالسُّوقِ وَالْأَعْنَاقِ","translations":[{"language_name":"english","text":"[He said], \"Return them to me,\" and set about striking [their] legs and necks."},{"language_name":"indonesian","text":"”Bawalah semua kuda itu kembali kepadaku.” Lalu dia mengusap-usap kaki dan leher kuda itu."}],"verse_number":33},{"chapter_id":38,"juz_number":23,"text_madani":"وَلَقَدْ فَتَنَّا سُلَيْمَانَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ جَسَدًا ثُمَّ أَنَابَ","translations":[{"language_name":"english","text":"And We certainly tried Solomon and placed on his throne a body; then he returned."},{"language_name":"indonesian","text":"Dan sungguh, Kami telah menguji Sulaiman dan Kami jadikan (dia) tergeletak di atas kursinya sebagai tubuh (yang lemah karena sakit), kemudian dia bertobat."}],"verse_number":34},{"chapter_id":38,"juz_number":23,"text_madani":"قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ","translations":[{"language_name":"english","text":"He said, \"My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, You are the Bestower.\""},{"language_name":"indonesian","text":"Dia berkata, “Ya Tuhanku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak dimiliki oleh siapa pun setelahku. Sungguh, Engkaulah Yang Maha Pemberi.”"}],"verse_number":35},{"chapter_id":38,"juz_number":23,"text_madani":"فَسَخَّرْنَا لَهُ الرِّيحَ تَجْرِي بِأَمْرِهِ رُخَاءً حَيْثُ أَصَابَ","translations":[{"language_name":"indonesian","text":"Kemudian Kami tundukkan kepadanya angin yang berhembus dengan baik menurut perintahnya ke mana saja yang dikehendakinya,"},{"language_name":"english","text":"So We subjected to him the wind blowing by his command, gently, wherever he directed,"}],"verse_number":36},{"chapter_id":38,"juz_number":23,"text_madani":"وَالشَّيَاطِينَ كُلَّ بَنَّاءٍ وَغَوَّاصٍ","translations":[{"language_name":"english","text":"And [also] the devils [of jinn] -  every builder and diver"},{"language_name":"indonesian","text":"dan (Kami tundukkan pula kepadanya) setan-setan, semuanya ahli bangunan dan penyelam,"}],"verse_number":37},{"chapter_id":38,"juz_number":23,"text_madani":"وَآخَرِينَ مُقَرَّنِينَ فِي الْأَصْفَادِ","translations":[{"language_name":"indonesian","text":"dan (setan) yang lain yang terikat dalam belenggu."},{"language_name":"english","text":"And others bound together in shackles."}],"verse_number":38},{"chapter_id":38,"juz_number":23,"text_madani":"هَٰذَا عَطَاؤُنَا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ","translations":[{"language_name":"english","text":"[We said], \"This is Our gift, so grant or withhold without account.\""},{"language_name":"indonesian","text":"Inilah anugerah Kami; maka berikanlah (kepada orang lain) atau tahanlah (untuk dirimu sendiri) tanpa perhitungan."}],"verse_number":39},{"chapter_id":38,"juz_number":23,"text_madani":"وَإِنَّ لَهُ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَآبٍ","translations":[{"language_name":"indonesian","text":"Dan sungguh, dia mempunyai kedudukan yang dekat pada sisi Kami dan tempat kembali yang baik."},{"language_name":"english","text":"And indeed, for him is nearness to Us and a good place of return."}],"verse_number":40},{"chapter_id":38,"juz_number":23,"text_madani":"وَاذْكُرْ عَبْدَنَا أَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ","translations":[{"language_name":"english","text":"And remember Our servant Job, when he called to his Lord, \"Indeed, Satan has touched me with hardship and torment.\""},{"language_name":"indonesian","text":"Dan ingatlah akan hamba Kami Ayyub ketika dia menyeru Tuhannya, “Sesungguhnya aku diganggu setan dengan penderitaan dan bencana.”"}],"verse_number":41},{"chapter_id":38,"juz_number":23,"text_madani":"ارْكُضْ بِرِجْلِكَ ۖ هَٰذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ","translations":[{"language_name":"english","text":"[So he was told], \"Strike [the ground] with your foot; this is a [spring for] a cool bath and drink.\""},{"language_name":"indonesian","text":"(Allah berfirman), “Hentakkanlah kakimu; inilah air yang sejuk untuk mandi dan untuk minum.”"}],"verse_number":42},{"chapter_id":38,"juz_number":23,"text_madani":"وَوَهَبْنَا لَهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنَّا وَذِكْرَىٰ لِأُولِي الْأَلْبَابِ","translations":[{"language_name":"indonesian","text":"Dan Kami anugerahi dia (dengan mengumpulkan kembali) keluarganya dan Kami lipatgandakan jumlah mereka, sebagai rahmat dari Kami dan pelajaran bagi orang-orang yang berpikiran sehat."},{"language_name":"english","text":"And We granted him his family and a like [number] with them as mercy from Us and a reminder for those of understanding."}],"verse_number":43},{"chapter_id":38,"juz_number":23,"text_madani":"وَخُذْ بِيَدِكَ ضِغْثًا فَاضْرِب بِّهِ وَلَا تَحْنَثْ ۗ إِنَّا وَجَدْنَاهُ صَابِرًا ۚ نِّعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ","translations":[{"language_name":"english","text":"[We said], \"And take in your hand a bunch [of grass] and strike with it and do not break your oath.\" Indeed, We found him patient, an excellent servant. Indeed, he was one repeatedly turning back [to Allah ]."},{"language_name":"indonesian","text":"Dan ambillah seikat (rumput) dengan tanganmu, lalu pukullah dengan itu dan janganlah engkau melanggar sumpah. Sesungguhnya Kami dapati dia (Ayyub) seorang yang sabar. Dialah sebaik-baik hamba. Sungguh, dia sangat taat (kepada Allah)."}],"verse_number":44},{"chapter_id":38,"juz_number":23,"text_madani":"وَاذْكُرْ عِبَادَنَا إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ أُولِي الْأَيْدِي وَالْأَبْصَارِ","translations":[{"language_name":"english","text":"And remember Our servants, Abraham, Isaac and Jacob -  those of strength and [religious] vision."},{"language_name":"indonesian","text":"Dan ingatlah hamba-hamba Kami: Ibrahim, Ishak dan Yakub yang mempunyai kekuatan-kekuatan yang besar dan ilmu-ilmu (yang tinggi)."}],"verse_number":45},{"chapter_id":38,"juz_number":23,"text_madani":"إِنَّا أَخْلَصْنَاهُم بِخَالِصَةٍ ذِكْرَى الدَّارِ","translations":[{"language_name":"indonesian","text":"Sungguh, Kami telah menyucikan mereka dengan (menganugerahkan) akhlak yang tinggi kepadanya yaitu selalu mengingatkan (manusia) kepada negeri akhirat."},{"language_name":"english","text":"Indeed, We chose them for an exclusive quality: remembrance of the home [of the Hereafter]."}],"verse_number":46},{"chapter_id":38,"juz_number":23,"text_madani":"وَإِنَّهُمْ عِندَنَا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيَارِ","translations":[{"language_name":"english","text":"And indeed they are, to Us, among the chosen and outstanding."},{"language_name":"indonesian","text":"Dan sungguh, di sisi Kami mereka termasuk orang-orang pilihan yang paling baik."}],"verse_number":47},{"chapter_id":38,"juz_number":23,"text_madani":"وَاذْكُرْ إِسْمَاعِيلَ وَالْيَسَعَ وَذَا الْكِفْلِ ۖ وَكُلٌّ مِّنَ الْأَخْيَارِ","translations":[{"language_name":"indonesian","text":"Dan ingatlah Ismail, Ilyasa‘ dan Zulkifli. Semuanya termasuk orang-orang yang paling baik."},{"language_name":"english","text":"And remember Ishmael, Elisha and Dhul-Kifl, and all are among the outstanding."}],"verse_number":48},{"chapter_id":38,"juz_number":23,"text_madani":"هَٰذَا ذِكْرٌ ۚ وَإِنَّ لِلْمُتَّقِينَ لَحُسْنَ مَآبٍ","translations":[{"language_name":"english","text":"This is a reminder. And indeed, for the righteous is a good place of return"},{"language_name":"indonesian","text":"Ini adalah kehormatan (bagi mereka). Dan sungguh, bagi orang-orang yang bertakwa (disediakan) tempat kembali yang terbaik,"}],"verse_number":49},{"chapter_id":38,"juz_number":23,"text_madani":"جَنَّاتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ الْأَبْوَابُ","translations":[{"language_name":"english","text":"Gardens of perpetual residence, whose doors will be opened to them."},{"language_name":"indonesian","text":"(yaitu) surga ’Adn yang pintu-pintunya terbuka bagi mereka,"}],"verse_number":50},{"chapter_id":38,"juz_number":23,"text_madani":"مُتَّكِئِينَ فِيهَا يَدْعُونَ فِيهَا بِفَاكِهَةٍ كَثِيرَةٍ وَشَرَابٍ","translations":[{"language_name":"english","text":"Reclining within them, they will call therein for abundant fruit and drink."},{"language_name":"indonesian","text":"di dalamnya mereka bersandar (di atas dipan-dipan) sambil meminta buah-buahan yang banyak dan minuman (di surga itu)."}],"verse_number":51},{"chapter_id":38,"juz_number":23,"text_madani":"وَعِندَهُمْ قَاصِرَاتُ الطَّرْفِ أَتْرَابٌ","translations":[{"language_name":"indonesian","text":"dan di samping mereka (ada bidadari-bidadari) yang redup pandangannya dan sebaya umurnya."},{"language_name":"english","text":"And with them will be women limiting [their] glances and of equal age."}],"verse_number":52},{"chapter_id":38,"juz_number":23,"text_madani":"هَٰذَا مَا تُوعَدُونَ لِيَوْمِ الْحِسَابِ","translations":[{"language_name":"indonesian","text":"Inilah apa yang dijanjikan kepadamu pada hari perhitungan."},{"language_name":"english","text":"This is what you, [the righteous], are promised for the Day of Account."}],"verse_number":53},{"chapter_id":38,"juz_number":23,"text_madani":"إِنَّ هَٰذَا لَرِزْقُنَا مَا لَهُ مِن نَّفَادٍ","translations":[{"language_name":"english","text":"Indeed, this is Our provision; for it there is no depletion."},{"language_name":"indonesian","text":"Sungguh, inilah rezeki dari Kami yang tidak ada habis-habisnya."}],"verse_number":54},{"chapter_id":38,"juz_number":23,"text_madani":"هَٰذَا ۚ وَإِنَّ لِلطَّاغِينَ لَشَرَّ مَآبٍ","translations":[{"language_name":"indonesian","text":"Beginilah (keadaan mereka). Dan sungguh, bagi orang-orang yang durhaka pasti (disediakan) tempat kembali yang buruk,"},{"language_name":"english","text":"This [is so]. But indeed, for the transgressors is an evil place of return -"}],"verse_number":55},{"chapter_id":38,"juz_number":23,"text_madani":"جَهَنَّمَ يَصْلَوْنَهَا فَبِئْسَ الْمِهَادُ","translations":[{"language_name":"indonesian","text":"(yaitu) neraka Jahanam yang mereka masuki; maka itulah seburuk-buruk tempat tinggal."},{"language_name":"english","text":"Hell, which they will [enter to] burn, and wretched is the resting place."}],"verse_number":56},{"chapter_id":38,"juz_number":23,"text_madani":"هَٰذَا فَلْيَذُوقُوهُ حَمِيمٌ وَغَسَّاقٌ","translations":[{"language_name":"indonesian","text":"Inilah (azab neraka), maka biarlah mereka merasakannya, (minuman mereka) air yang sangat panas dan air yang sangat dingin,"},{"language_name":"english","text":"This -  so let them taste it -  is scalding water and [foul] purulence."}],"verse_number":57},{"chapter_id":38,"juz_number":23,"text_madani":"وَآخَرُ مِن شَكْلِهِ أَزْوَاجٌ","translations":[{"language_name":"indonesian","text":"dan berbagai macam (azab) yang lain yang serupa itu."},{"language_name":"english","text":"And other [punishments] of its type [in various] kinds."}],"verse_number":58},{"chapter_id":38,"juz_number":23,"text_madani":"هَٰذَا فَوْجٌ مُّقْتَحِمٌ مَّعَكُمْ ۖ لَا مَرْحَبًا بِهِمْ ۚ إِنَّهُمْ صَالُو النَّارِ","translations":[{"language_name":"indonesian","text":"(Dikatakan kepada mereka), “Ini rombongan besar (pengikut-pengikutmu) yang masuk berdesak-desak bersama kamu (ke neraka).” Tidak ada ucapan selamat datang bagi mereka karena sesungguhnya mereka akan masuk neraka (kata pemimpin-pemimpin mereka)."},{"language_name":"english","text":"[Its inhabitants will say], \"This is a company bursting in with you. No welcome for them. Indeed, they will burn in the Fire.\""}],"verse_number":59},{"chapter_id":38,"juz_number":23,"text_madani":"قَالُوا بَلْ أَنتُمْ لَا مَرْحَبًا بِكُمْ ۖ أَنتُمْ قَدَّمْتُمُوهُ لَنَا ۖ فَبِئْسَ الْقَرَارُ","translations":[{"language_name":"english","text":"They will say, \"Nor you! No welcome for you. You, [our leaders], brought this upon us, and wretched is the settlement.\""},{"language_name":"indonesian","text":"(Para pengikut mereka menjawab), “Sebenarnya kamulah yang (lebih pan-tas) tidak menerima ucapan selamat datang, karena kamulah yang menjerumuskan kami ke dalam azab, maka itulah seburuk-buruk tempat menetap.”"}],"verse_number":60},{"chapter_id":38,"juz_number":23,"text_madani":"قَالُوا رَبَّنَا مَن قَدَّمَ لَنَا هَٰذَا فَزِدْهُ عَذَابًا ضِعْفًا فِي النَّارِ","translations":[{"language_name":"english","text":"They will say, \"Our Lord, whoever brought this upon us -  increase for him double punishment in the Fire.\""},{"language_name":"indonesian","text":"Mereka berkata (lagi), “Ya Tuhan kami, barangsiapa menjerumuskan kami ke dalam (azab) ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka.”"}],"verse_number":61},{"chapter_id":38,"juz_number":23,"text_madani":"وَقَالُوا مَا لَنَا لَا نَرَىٰ رِجَالًا كُنَّا نَعُدُّهُم مِّنَ الْأَشْرَارِ","translations":[{"language_name":"indonesian","text":"Dan (orang-orang durhaka) berkata, “Mengapa kami tidak melihat orang-orang yang dahulu (di dunia) kami anggap sebagai orang-orang yang jahat (hina)."},{"language_name":"english","text":"And they will say, \"Why do we not see men whom we used to count among the worst?"}],"verse_number":62},{"chapter_id":38,"juz_number":23,"text_madani":"أَتَّخَذْنَاهُمْ سِخْرِيًّا أَمْ زَاغَتْ عَنْهُمُ الْأَبْصَارُ","translations":[{"language_name":"english","text":"Is it [because] we took them in ridicule, or has [our] vision turned away from them?\""},{"language_name":"indonesian","text":"Dahulu kami menjadikan mereka olok-olokan, ataukah karena penglihatan kami yang tidak melihat mereka?”"}],"verse_number":63},{"chapter_id":38,"juz_number":23,"text_madani":"إِنَّ ذَٰلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ النَّارِ","translations":[{"language_name":"english","text":"Indeed, that is truth -  the quarreling of the people of the Fire."},{"language_name":"indonesian","text":"Sungguh, yang demikian benar-benar terjadi, (yaitu) pertengkaran di antara penghuni neraka."}],"verse_number":64},{"chapter_id":38,"juz_number":23,"text_madani":"قُلْ إِنَّمَا أَنَا مُنذِرٌ ۖ وَمَا مِنْ إِلَٰهٍ إِلَّا اللَّهُ الْوَاحِدُ الْقَهَّارُ","translations":[{"language_name":"indonesian","text":"Katakanlah (Muhammad), “Sesungguhnya aku hanya seorang pemberi peringatan, tidak ada tuhan selain Allah Yang Maha Esa, Mahaperkasa,"},{"language_name":"english","text":"Say, [O Muhammad], \"I am only a warner, and there is not any deity except Allah, the One, the Prevailing."}],"verse_number":65},{"chapter_id":38,"juz_number":23,"text_madani":"رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيزُ الْغَفَّارُ","translations":[{"language_name":"english","text":"Lord of the heavens and the earth and whatever is between them, the Exalted in Might, the Perpetual Forgiver.\""},{"language_name":"indonesian","text":"(yaitu) Tuhan langit dan bumi dan apa yang ada di antara keduanya, Yang Mahaperkasa, Maha Pengampun.”"}],"verse_number":66},{"chapter_id":38,"juz_number":23,"text_madani":"قُلْ هُوَ نَبَأٌ عَظِيمٌ","translations":[{"language_name":"indonesian","text":"Katakanlah, “Itu (Al-Qur\u0027an) adalah berita besar,"},{"language_name":"english","text":"Say, \"It is great news"}],"verse_number":67},{"chapter_id":38,"juz_number":23,"text_madani":"أَنتُمْ عَنْهُ مُعْرِضُونَ","translations":[{"language_name":"english","text":"From which you turn away."},{"language_name":"indonesian","text":"yang kamu berpaling darinya."}],"verse_number":68},{"chapter_id":38,"juz_number":23,"text_madani":"مَا كَانَ لِيَ مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَىٰ إِذْ يَخْتَصِمُونَ","translations":[{"language_name":"indonesian","text":"Aku tidak mempunyai pengetahuan sedikit pun tentang al-mala’ul a’la (malaikat) itu ketika mereka berbantah-bantahan."},{"language_name":"english","text":"I had no knowledge of the exalted assembly [of angels] when they were disputing [the creation of Adam]."}],"verse_number":69},{"chapter_id":38,"juz_number":23,"text_madani":"إِن يُوحَىٰ إِلَيَّ إِلَّا أَنَّمَا أَنَا نَذِيرٌ مُّبِينٌ","translations":[{"language_name":"english","text":"It has not been revealed to me except that I am a clear warner.\""},{"language_name":"indonesian","text":"Yang diwahyukan kepadaku, bahwa aku hanyalah seorang pemberi peringatan yang nyata.”"}],"verse_number":70},{"chapter_id":38,"juz_number":23,"text_madani":"إِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي خَالِقٌ بَشَرًا مِّن طِينٍ","translations":[{"language_name":"indonesian","text":"(Ingatlah) ketika Tuhanmu berfirman kepada malaikat, “Sesungguhnya Aku akan menciptakan manusia dari tanah."},{"language_name":"english","text":"[So mention] when your Lord said to the angels, \"Indeed, I am going to create a human being from clay."}],"verse_number":71},{"chapter_id":38,"juz_number":23,"text_madani":"فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِن رُّوحِي فَقَعُوا لَهُ سَاجِدِينَ","translations":[{"language_name":"english","text":"So when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration.\""},{"language_name":"indonesian","text":"Kemudian apabila telah Aku sempurnakan kejadiannya dan Aku tiupkan roh (ciptaan)-Ku kepadanya; maka tunduklah kamu dengan bersujud kepadanya.”"}],"verse_number":72},{"chapter_id":38,"juz_number":23,"text_madani":"فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ","translations":[{"language_name":"indonesian","text":"Lalu para malaikat itu bersujud semuanya,"},{"language_name":"english","text":"So the angels prostrated -  all of them entirely."}],"verse_number":73},{"chapter_id":38,"juz_number":23,"text_madani":"إِلَّا إِبْلِيسَ اسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِينَ","translations":[{"language_name":"english","text":"Except Iblees; he was arrogant and became among the disbelievers."},{"language_name":"indonesian","text":"kecuali Iblis; ia menyombongkan diri dan ia termasuk golongan yang kafir."}],"verse_number":74},{"chapter_id":38,"juz_number":23,"text_madani":"قَالَ يَا إِبْلِيسُ مَا مَنَعَكَ أَن تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ ۖ أَسْتَكْبَرْتَ أَمْ كُنتَ مِنَ الْعَالِينَ","translations":[{"language_name":"indonesian","text":"(Allah) berfirman, “Wahai Iblis, apakah yang menghalangi kamu sujud kepada yang telah Aku ciptakan dengan kekuasaan-Ku. Apakah kamu menyombongkan diri atau kamu (merasa) termasuk golongan yang (lebih) tinggi?”"},{"language_name":"english","text":"[ Allah ] said, \"O Iblees, what prevented you from prostrating to that which I created with My hands? Were you arrogant [then], or were you [already] among the haughty?\""}],"verse_number":75},{"chapter_id":38,"juz_number":23,"text_madani":"قَالَ أَنَا خَيْرٌ مِّنْهُ ۖ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ","translations":[{"language_name":"english","text":"He said, \"I am better than him. You created me from fire and created him from clay.\""},{"language_name":"indonesian","text":"(Iblis) berkata, “Aku lebih baik daripadanya, karena Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.”"}],"verse_number":76},{"chapter_id":38,"juz_number":23,"text_madani":"قَالَ فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ","translations":[{"language_name":"english","text":"[ Allah ] said, \"Then get out of Paradise, for indeed, you are expelled."},{"language_name":"indonesian","text":"(Allah) berfirman, “Kalau begitu keluarlah kamu dari surga! Sesungguhnya kamu adalah makhluk yang terkutuk."}],"verse_number":77},{"chapter_id":38,"juz_number":23,"text_madani":"وَإِنَّ عَلَيْكَ لَعْنَتِي إِلَىٰ يَوْمِ الدِّينِ","translations":[{"language_name":"english","text":"And indeed, upon you is My curse until the Day of Recompense.\""},{"language_name":"indonesian","text":"Dan sungguh, kutukan-Ku tetap atasmu sampai hari pembalasan.”"}],"verse_number":78},{"chapter_id":38,"juz_number":23,"text_madani":"قَالَ رَبِّ فَأَنظِرْنِي إِلَىٰ يَوْمِ يُبْعَثُونَ","translations":[{"language_name":"indonesian","text":"(Iblis) berkata, “Ya Tuhanku, tangguhkanlah aku sampai pada hari mereka dibangkitkan.”"},{"language_name":"english","text":"He said, \"My Lord, then reprieve me until the Day they are resurrected.\""}],"verse_number":79},{"chapter_id":38,"juz_number":23,"text_madani":"قَالَ فَإِنَّكَ مِنَ الْمُنظَرِينَ","translations":[{"language_name":"english","text":"[ Allah ] said, \"So indeed, you are of those reprieved"},{"language_name":"indonesian","text":"(Allah) berfirman, “Maka sesungguhnya kamu termasuk golongan yang diberi penangguhan,"}],"verse_number":80},{"chapter_id":38,"juz_number":23,"text_madani":"إِلَىٰ يَوْمِ الْوَقْتِ الْمَعْلُومِ","translations":[{"language_name":"english","text":"Until the Day of the time well-known.\""},{"language_name":"indonesian","text":"sampai pada hari yang telah ditentukan waktunya (hari Kiamat).”"}],"verse_number":81},{"chapter_id":38,"juz_number":23,"text_madani":"قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ","translations":[{"language_name":"english","text":"[Iblees] said, \"By your might, I will surely mislead them all"},{"language_name":"indonesian","text":"(Iblis) menjawab, “Demi kemuliaan-Mu, pasti aku akan menyesatkan mereka semuanya,"}],"verse_number":82},{"chapter_id":38,"juz_number":23,"text_madani":"إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ","translations":[{"language_name":"english","text":"Except, among them, Your chosen servants.\""},{"language_name":"indonesian","text":"kecuali hamba-hamba-Mu yang terpilih di antara mereka.\""}],"verse_number":83},{"chapter_id":38,"juz_number":23,"text_madani":"قَالَ فَالْحَقُّ وَالْحَقَّ أَقُولُ","translations":[{"language_name":"english","text":"[ Allah ] said, \"The truth [is My oath], and the truth I say -"},{"language_name":"indonesian","text":"(Allah) berfirman, “Maka yang benar (adalah sumpahku), dan hanya kebenaran itulah yang Aku katakan."}],"verse_number":84},{"chapter_id":38,"juz_number":23,"text_madani":"لَأَمْلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ","translations":[{"language_name":"english","text":"[That] I will surely fill Hell with you and those of them that follow you all together.\""},{"language_name":"indonesian","text":"Sungguh, Aku akan memenuhi neraka Jahanam dengan kamu dan dengan orang-orang yang mengikutimu di antara mereka semuanya.”"}],"verse_number":85},{"chapter_id":38,"juz_number":23,"text_madani":"قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنَ الْمُتَكَلِّفِينَ","translations":[{"language_name":"english","text":"Say, [O Muhammad], \"I do not ask you for the Qur\u0027an any payment, and I am not of the pretentious"},{"language_name":"indonesian","text":"Katakanlah (Muhammad), “Aku tidak meminta imbalan sedikit pun kepadamu atasnya (dakwahku); dan aku bukanlah termasuk orang yang mengada-ada."}],"verse_number":86},{"chapter_id":38,"juz_number":23,"text_madani":"إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ","translations":[{"language_name":"indonesian","text":"(Al-Qur\u0027an) ini tidak lain hanyalah peringatan bagi seluruh alam."},{"language_name":"english","text":"It is but a reminder to the worlds."}],"verse_number":87},{"chapter_id":38,"juz_number":23,"text_madani":"وَلَتَعْلَمُنَّ نَبَأَهُ بَعْدَ حِينٍ","translations":[{"language_name":"indonesian","text":"Dan sungguh, kamu akan mengetahui (kebenaran) beritanya (Al-Qur\u0027an) setelah beberapa waktu lagi.”"},{"language_name":"english","text":"And you will surely know [the truth of] its information after a time.\""}],"verse_number":88}]