[{"chapter_id":36,"juz_number":22,"text_madani":"يس","translations":[{"language_name":"english","text":"Ya, Seen."},{"language_name":"indonesian","text":"Yasin"}],"verse_number":1},{"chapter_id":36,"juz_number":22,"text_madani":"وَالْقُرْآنِ الْحَكِيمِ","translations":[{"language_name":"english","text":"By the wise Qur\u0027an."},{"language_name":"indonesian","text":"Demi Al-Qur\u0027an yang penuh hikmah,"}],"verse_number":2},{"chapter_id":36,"juz_number":22,"text_madani":"إِنَّكَ لَمِنَ الْمُرْسَلِينَ","translations":[{"language_name":"indonesian","text":"sungguh, engkau (Muhammad) adalah salah seorang dari rasul-rasul,"},{"language_name":"english","text":"Indeed you, [O Muhammad], are from among the messengers,"}],"verse_number":3},{"chapter_id":36,"juz_number":22,"text_madani":"عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","translations":[{"language_name":"english","text":"On a straight path."},{"language_name":"indonesian","text":"(yang berada) di atas jalan yang lurus,"}],"verse_number":4},{"chapter_id":36,"juz_number":22,"text_madani":"تَنزِيلَ الْعَزِيزِ الرَّحِيمِ","translations":[{"language_name":"indonesian","text":"(sebagai wahyu) yang diturunkan oleh (Allah) Yang Mahaperkasa, Maha Penyayang,"},{"language_name":"english","text":"[This is] a revelation of the Exalted in Might, the Merciful,"}],"verse_number":5},{"chapter_id":36,"juz_number":22,"text_madani":"لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ","translations":[{"language_name":"english","text":"That you may warn a people whose forefathers were not warned, so they are unaware."},{"language_name":"indonesian","text":"agar engkau memberi peringatan kepada suatu kaum yang nenek moyangnya belum pernah diberi peringatan, karena itu mereka lalai."}],"verse_number":6},{"chapter_id":36,"juz_number":22,"text_madani":"لَقَدْ حَقَّ الْقَوْلُ عَلَىٰ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ","translations":[{"language_name":"indonesian","text":"Sungguh, pasti berlaku perkataan (hukuman) terhadap kebanyakan mereka, karena mereka tidak beriman."},{"language_name":"english","text":"Already the word has come into effect upon most of them, so they do not believe."}],"verse_number":7},{"chapter_id":36,"juz_number":22,"text_madani":"إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلَالًا فَهِيَ إِلَى الْأَذْقَانِ فَهُم مُّقْمَحُونَ","translations":[{"language_name":"indonesian","text":"Sungguh, Kami telah memasang belenggu di leher mereka, lalu tangan mereka (diangkat) ke dagu, karena itu mereka tertengadah."},{"language_name":"english","text":"Indeed, We have put shackles on their necks, and they are to their chins, so they are with heads [kept] aloft."}],"verse_number":8},{"chapter_id":36,"juz_number":22,"text_madani":"وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ","translations":[{"language_name":"english","text":"And We have put before them a barrier and behind them a barrier and covered them, so they do not see."},{"language_name":"indonesian","text":"Dan Kami jadikan di hadapan mereka sekat (dinding) dan di belakang mereka juga sekat, dan Kami tutup (mata) mereka sehingga mereka tidak dapat melihat."}],"verse_number":9},{"chapter_id":36,"juz_number":22,"text_madani":"وَسَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ","translations":[{"language_name":"english","text":"And it is all the same for them whether you warn them or do not warn them -  they will not believe."},{"language_name":"indonesian","text":"Dan sama saja bagi mereka, apakah engkau memberi peringatan kepada mereka atau engkau tidak memberi peringatan kepada mereka, mereka tidak akan beriman juga."}],"verse_number":10},{"chapter_id":36,"juz_number":22,"text_madani":"إِنَّمَا تُنذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمَٰنَ بِالْغَيْبِ ۖ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ","translations":[{"language_name":"english","text":"You can only warn one who follows the message and fears the Most Merciful unseen. So give him good tidings of forgiveness and noble reward."},{"language_name":"indonesian","text":"Sesungguhnya engkau hanya memberi peringatan kepada orang-orang yang mau mengikuti peringatan dan yang takut kepada Tuhan Yang Maha Pengasih, walaupun mereka tidak melihat-Nya. Maka berilah mereka kabar gembira dengan ampunan dan pahala yang mulia."}],"verse_number":11},{"chapter_id":36,"juz_number":22,"text_madani":"إِنَّا نَحْنُ نُحْيِي الْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ ۚ وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُّبِينٍ","translations":[{"language_name":"english","text":"Indeed, it is We who bring the dead to life and record what they have put forth and what they left behind, and all things We have enumerated in a clear register."},{"language_name":"indonesian","text":"Sungguh, Kamilah yang menghidupkan orang-orang yang mati, dan Kamilah yang mencatat apa yang telah mereka kerjakan dan bekas-bekas yang mereka (tinggalkan). Dan segala sesuatu Kami kumpulkan dalam Kitab yang jelas (Lauh Mahfuzh)."}],"verse_number":12},{"chapter_id":36,"juz_number":22,"text_madani":"وَاضْرِبْ لَهُم مَّثَلًا أَصْحَابَ الْقَرْيَةِ إِذْ جَاءَهَا الْمُرْسَلُونَ","translations":[{"language_name":"indonesian","text":"Dan buatlah suatu perumpamaan bagi mereka, yaitu penduduk suatu negeri, ketika utusan-utusan datang kepada mereka;"},{"language_name":"english","text":"And present to them an example: the people of the city, when the messengers came to it -"}],"verse_number":13},{"chapter_id":36,"juz_number":22,"text_madani":"إِذْ أَرْسَلْنَا إِلَيْهِمُ اثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوا إِنَّا إِلَيْكُم مُّرْسَلُونَ","translations":[{"language_name":"english","text":"When We sent to them two but they denied them, so We strengthened them with a third, and they said, \"Indeed, we are messengers to you.\""},{"language_name":"indonesian","text":"(yaitu) ketika Kami mengutus kepada mereka dua orang utusan, lalu mereka mendustakan keduanya; kemudian Kami kuatkan dengan (utusan) yang ketiga, maka ketiga (utusan itu) berkata, “Sungguh, kami adalah orang-orang yang diutus kepadamu.”"}],"verse_number":14},{"chapter_id":36,"juz_number":22,"text_madani":"قَالُوا مَا أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا وَمَا أَنزَلَ الرَّحْمَٰنُ مِن شَيْءٍ إِنْ أَنتُمْ إِلَّا تَكْذِبُونَ","translations":[{"language_name":"indonesian","text":"Mereka (penduduk negeri) menjawab, “Kamu ini hanyalah manusia seperti kami, dan (Allah) Yang Maha Pengasih tidak menurunkan sesuatu apa pun; kamu hanyalah pendusta belaka.”"},{"language_name":"english","text":"They said, \"You are not but human beings like us, and the Most Merciful has not revealed a thing. You are only telling lies.\""}],"verse_number":15},{"chapter_id":36,"juz_number":22,"text_madani":"قَالُوا رَبُّنَا يَعْلَمُ إِنَّا إِلَيْكُمْ لَمُرْسَلُونَ","translations":[{"language_name":"english","text":"They said, \"Our Lord knows that we are messengers to you,"},{"language_name":"indonesian","text":"Mereka berkata, “Tuhan kami mengetahui sesungguhnya kami adalah utusan-utusan(-Nya) kepada kamu."}],"verse_number":16},{"chapter_id":36,"juz_number":22,"text_madani":"وَمَا عَلَيْنَا إِلَّا الْبَلَاغُ الْمُبِينُ","translations":[{"language_name":"english","text":"And we are not responsible except for clear notification.\""},{"language_name":"indonesian","text":"Dan kewajiban kami hanyalah menyampaikan (perintah Allah) dengan jelas.”"}],"verse_number":17},{"chapter_id":36,"juz_number":22,"text_madani":"قَالُوا إِنَّا تَطَيَّرْنَا بِكُمْ ۖ لَئِن لَّمْ تَنتَهُوا لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٌ","translations":[{"language_name":"english","text":"They said, \"Indeed, we consider you a bad omen.  If you do not desist, we will surely stone you, and there will surely touch you, from us, a painful punishment.\""},{"language_name":"indonesian","text":"Mereka menjawab, “Sesungguhnya kami bernasib malang karena kamu. Sungguh, jika kamu tidak berhenti (menyeru kami), niscaya kami rajam kamu dan kamu pasti akan merasakan siksaan yang pedih dari kami.”"}],"verse_number":18},{"chapter_id":36,"juz_number":22,"text_madani":"قَالُوا طَائِرُكُم مَّعَكُمْ ۚ أَئِن ذُكِّرْتُم ۚ بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ","translations":[{"language_name":"indonesian","text":"Mereka (utusan-utusan) itu berkata, “Kemalangan kamu itu adalah karena kamu sendiri. Apakah karena kamu diberi peringatan? Sebenarnya kamu adalah kaum yang melampaui batas.”"},{"language_name":"english","text":"They said, \"Your omen is with yourselves. Is it because you were reminded?  Rather, you are a transgressing people.\""}],"verse_number":19},{"chapter_id":36,"juz_number":22,"text_madani":"وَجَاءَ مِنْ أَقْصَى الْمَدِينَةِ رَجُلٌ يَسْعَىٰ قَالَ يَا قَوْمِ اتَّبِعُوا الْمُرْسَلِينَ","translations":[{"language_name":"english","text":"And there came from the farthest end of the city a man, running.  He said, \"O my people, follow the messengers."},{"language_name":"indonesian","text":"Dan datanglah dari ujung kota, seorang laki-laki dengan bergegas dia berkata, “Wahai kaumku! Ikutilah utusan-utusan itu."}],"verse_number":20},{"chapter_id":36,"juz_number":22,"text_madani":"اتَّبِعُوا مَن لَّا يَسْأَلُكُمْ أَجْرًا وَهُم مُّهْتَدُونَ","translations":[{"language_name":"indonesian","text":"Ikutilah orang yang tidak meminta imbalan kepadamu; dan mereka adalah orang-orang yang mendapat petunjuk."},{"language_name":"english","text":"Follow those who do not ask of you [any] payment, and they are [rightly] guided."}],"verse_number":21},{"chapter_id":36,"juz_number":22,"text_madani":"وَمَا لِيَ لَا أَعْبُدُ الَّذِي فَطَرَنِي وَإِلَيْهِ تُرْجَعُونَ","translations":[{"language_name":"english","text":"And why should I not worship He who created me and to whom you will be returned?"},{"language_name":"indonesian","text":"Dan tidak ada alasan bagiku untuk tidak menyembah (Allah) yang telah menciptakanku dan hanya kepada-Nyalah kamu akan dikembalikan."}],"verse_number":22},{"chapter_id":36,"juz_number":22,"text_madani":"أَأَتَّخِذُ مِن دُونِهِ آلِهَةً إِن يُرِدْنِ الرَّحْمَٰنُ بِضُرٍّ لَّا تُغْنِ عَنِّي شَفَاعَتُهُمْ شَيْئًا وَلَا يُنقِذُونِ","translations":[{"language_name":"english","text":"Should I take other than Him [false] deities [while], if the Most Merciful intends for me some adversity, their intercession will not avail me at all, nor can they save me?"},{"language_name":"indonesian","text":"Mengapa aku akan menyembah tuhan-tuhan selain-Nya? Jika (Allah) Yang Maha Pengasih menghendaki bencana terhadapku, pasti pertolongan mereka tidak berguna sama sekali bagi diriku dan mereka (juga) tidak dapat menyelamatkanku."}],"verse_number":23},{"chapter_id":36,"juz_number":22,"text_madani":"إِنِّي إِذًا لَّفِي ضَلَالٍ مُّبِينٍ","translations":[{"language_name":"indonesian","text":"Sesungguhnya jika aku (berbuat) begitu, pasti aku berada dalam kesesatan yang nyata."},{"language_name":"english","text":"Indeed, I would then be in manifest error."}],"verse_number":24},{"chapter_id":36,"juz_number":22,"text_madani":"إِنِّي آمَنتُ بِرَبِّكُمْ فَاسْمَعُونِ","translations":[{"language_name":"indonesian","text":"Sesungguhnya aku telah beriman kepada Tuhanmu; maka dengarkanlah (pengakuan keimanan)-ku.”"},{"language_name":"english","text":"Indeed, I have believed in your Lord, so listen to me.\""}],"verse_number":25},{"chapter_id":36,"juz_number":22,"text_madani":"قِيلَ ادْخُلِ الْجَنَّةَ ۖ قَالَ يَا لَيْتَ قَوْمِي يَعْلَمُونَ","translations":[{"language_name":"indonesian","text":"Dikatakan (kepadanya), “Masuklah ke surga.” Dia (laki-laki itu) berkata, “Alangkah baiknya sekiranya kaumku mengetahui,"},{"language_name":"english","text":"It was said, \"Enter Paradise.\" He said, \"I wish my people could know"}],"verse_number":26},{"chapter_id":36,"juz_number":22,"text_madani":"بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ الْمُكْرَمِينَ","translations":[{"language_name":"english","text":"Of how my Lord has forgiven me and placed me among the honored.\""},{"language_name":"indonesian","text":"apa yang menyebabkan Tuhanku memberi ampun kepadaku dan menjadikan aku termasuk orang-orang yang telah dimuliakan.”"}],"verse_number":27},{"chapter_id":36,"juz_number":23,"text_madani":"وَمَا أَنزَلْنَا عَلَىٰ قَوْمِهِ مِن بَعْدِهِ مِن جُندٍ مِّنَ السَّمَاءِ وَمَا كُنَّا مُنزِلِينَ","translations":[{"language_name":"indonesian","text":"Dan setelah dia (meninggal), Kami tidak menurunkan suatu pasukan pun dari langit kepada kaumnya, dan Kami tidak perlu menurunkannya."},{"language_name":"english","text":"And We did not send down upon his people after him any soldiers from the heaven, nor would We have done so."}],"verse_number":28},{"chapter_id":36,"juz_number":23,"text_madani":"إِن كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ خَامِدُونَ","translations":[{"language_name":"english","text":"It was not but one shout, and immediately they were extinguished."},{"language_name":"indonesian","text":"Tidak ada siksaan terhadap mereka melainkan dengan satu teriakan saja; maka seketika itu mereka mati."}],"verse_number":29},{"chapter_id":36,"juz_number":23,"text_madani":"يَا حَسْرَةً عَلَى الْعِبَادِ ۚ مَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ","translations":[{"language_name":"indonesian","text":"Alangkah besar penyesalan terhadap hamba-hamba itu, setiap datang seorang rasul kepada mereka, mereka selalu memperolok-olokkannya."},{"language_name":"english","text":"How regretful for the servants. There did not come to them any messenger except that they used to ridicule him."}],"verse_number":30},{"chapter_id":36,"juz_number":23,"text_madani":"أَلَمْ يَرَوْا كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ الْقُرُونِ أَنَّهُمْ إِلَيْهِمْ لَا يَرْجِعُونَ","translations":[{"language_name":"indonesian","text":"Tidakkah mereka mengetahui berapa banyak umat-umat sebelum mereka yang telah Kami binasakan. Orang-orang (yang telah Kami binasakan) itu tidak ada yang kembali kepada mereka."},{"language_name":"english","text":"Have they not considered how many generations We destroyed before them -  that they to them will not return?"}],"verse_number":31},{"chapter_id":36,"juz_number":23,"text_madani":"وَإِن كُلٌّ لَّمَّا جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ","translations":[{"language_name":"indonesian","text":"Dan setiap (umat), semuanya akan dihadapkan kepada Kami."},{"language_name":"english","text":"And indeed, all of them will yet be brought present before Us."}],"verse_number":32},{"chapter_id":36,"juz_number":23,"text_madani":"وَآيَةٌ لَّهُمُ الْأَرْضُ الْمَيْتَةُ أَحْيَيْنَاهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ","translations":[{"language_name":"english","text":"And a sign for them is the dead earth. We have brought it to life and brought forth from it grain, and from it they eat."},{"language_name":"indonesian","text":"Dan suatu tanda (kebesaran Allah) bagi mereka adalah bumi yang mati (tandus). Kami hidupkan bumi itu dan Kami keluarkan darinya biji-bijian, maka dari (biji-bijian) itu mereka makan."}],"verse_number":33},{"chapter_id":36,"juz_number":23,"text_madani":"وَجَعَلْنَا فِيهَا جَنَّاتٍ مِّن نَّخِيلٍ وَأَعْنَابٍ وَفَجَّرْنَا فِيهَا مِنَ الْعُيُونِ","translations":[{"language_name":"english","text":"And We placed therein gardens of palm trees and grapevines and caused to burst forth therefrom some springs -"},{"language_name":"indonesian","text":"Dan Kami jadikan padanya di bumi itu kebun-kebun kurma dan anggur dan Kami pancarkan padanya beberapa mata air,"}],"verse_number":34},{"chapter_id":36,"juz_number":23,"text_madani":"لِيَأْكُلُوا مِن ثَمَرِهِ وَمَا عَمِلَتْهُ أَيْدِيهِمْ ۖ أَفَلَا يَشْكُرُونَ","translations":[{"language_name":"english","text":"That they may eat of His fruit. And their hands have not produced it, so will they not be grateful?"},{"language_name":"indonesian","text":"agar mereka dapat makan dari buahnya, dan dari hasil usaha tangan mereka. Maka mengapa mereka tidak bersyukur?"}],"verse_number":35},{"chapter_id":36,"juz_number":23,"text_madani":"سُبْحَانَ الَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا مِمَّا تُنبِتُ الْأَرْضُ وَمِنْ أَنفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ","translations":[{"language_name":"indonesian","text":"Mahasuci (Allah) yang telah menciptakan semuanya berpasang-pasangan, baik dari apa yang ditumbuhkan oleh bumi dan dari diri mereka sendiri, maupun dari apa yang tidak mereka ketahui."},{"language_name":"english","text":"Exalted is He who created all pairs -  from what the earth grows and from themselves and from that which they do not know."}],"verse_number":36},{"chapter_id":36,"juz_number":23,"text_madani":"وَآيَةٌ لَّهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَإِذَا هُم مُّظْلِمُونَ","translations":[{"language_name":"indonesian","text":"Dan suatu tanda (kebesaran Allah) bagi mereka adalah malam; Kami tanggalkan siang dari (malam) itu, maka seketika itu mereka (berada dalam) kegelapan,"},{"language_name":"english","text":"And a sign for them is the night. We remove from it [the light of] day, so they are [left] in darkness."}],"verse_number":37},{"chapter_id":36,"juz_number":23,"text_madani":"وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَّهَا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ","translations":[{"language_name":"english","text":"And the sun runs [on course] toward its stopping point. That is the determination of the Exalted in Might, the Knowing."},{"language_name":"indonesian","text":"dan matahari berjalan di tempat peredarannya. Demikianlah ketetapan (Allah) Yang Mahaperkasa, Maha Mengetahui."}],"verse_number":38},{"chapter_id":36,"juz_number":23,"text_madani":"وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ حَتَّىٰ عَادَ كَالْعُرْجُونِ الْقَدِيمِ","translations":[{"language_name":"indonesian","text":"Dan telah Kami tetapkan tempat peredaran bagi bulan, sehingga (setelah ia sampai ke tempat peredaran yang terakhir) kembalilah ia seperti bentuk tandan yang tua."},{"language_name":"english","text":"And the moon -  We have determined for it phases, until it returns [appearing] like the old date stalk."}],"verse_number":39},{"chapter_id":36,"juz_number":23,"text_madani":"لَا الشَّمْسُ يَنبَغِي لَهَا أَن تُدْرِكَ الْقَمَرَ وَلَا اللَّيْلُ سَابِقُ النَّهَارِ ۚ وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ","translations":[{"language_name":"english","text":"It is not allowable for the sun to reach the moon, nor does the night overtake the day, but each, in an orbit, is swimming."},{"language_name":"indonesian","text":"Tidaklah mungkin bagi matahari mengejar bulan dan malam pun tidak dapat mendahului siang. Masing-masing beredar pada garis edarnya."}],"verse_number":40},{"chapter_id":36,"juz_number":23,"text_madani":"وَآيَةٌ لَّهُمْ أَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِي الْفُلْكِ الْمَشْحُونِ","translations":[{"language_name":"indonesian","text":"Dan suatu tanda (kebesaran Allah) bagi mereka adalah bahwa Kami angkut keturunan mereka dalam kapal yang penuh muatan,"},{"language_name":"english","text":"And a sign for them is that We carried their forefathers in a laden ship."}],"verse_number":41},{"chapter_id":36,"juz_number":23,"text_madani":"وَخَلَقْنَا لَهُم مِّن مِّثْلِهِ مَا يَرْكَبُونَ","translations":[{"language_name":"indonesian","text":"dan Kami ciptakan (juga) untuk mereka (angkutan lain) seperti apa yang mereka kendarai."},{"language_name":"english","text":"And We created for them from the likes of it that which they ride."}],"verse_number":42},{"chapter_id":36,"juz_number":23,"text_madani":"وَإِن نَّشَأْ نُغْرِقْهُمْ فَلَا صَرِيخَ لَهُمْ وَلَا هُمْ يُنقَذُونَ","translations":[{"language_name":"english","text":"And if We should will, We could drown them; then no one responding to a cry would there be for them, nor would they be saved"},{"language_name":"indonesian","text":"Dan jika Kami menghendaki, Kami tenggelamkan mereka. Maka tidak ada penolong bagi mereka dan tidak (pula) mereka diselamatkan,"}],"verse_number":43},{"chapter_id":36,"juz_number":23,"text_madani":"إِلَّا رَحْمَةً مِّنَّا وَمَتَاعًا إِلَىٰ حِينٍ","translations":[{"language_name":"indonesian","text":"melainkan (Kami selamatkan mereka) karena rahmat yang besar dari Kami dan untuk memberikan kesenangan hidup sampai waktu tertentu."},{"language_name":"english","text":"Except as a mercy from Us and provision for a time."}],"verse_number":44},{"chapter_id":36,"juz_number":23,"text_madani":"وَإِذَا قِيلَ لَهُمُ اتَّقُوا مَا بَيْنَ أَيْدِيكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَمُونَ","translations":[{"language_name":"english","text":"But when it is said to them, \"Beware of what is before you and what is behind you; perhaps you will receive mercy... \""},{"language_name":"indonesian","text":"Dan apabila dikatakan kepada mereka, “Takutlah kamu akan siksa yang di hadapanmu (di dunia) dan azab yang akan datang (akhirat) agar kamu mendapat rahmat.”"}],"verse_number":45},{"chapter_id":36,"juz_number":23,"text_madani":"وَمَا تَأْتِيهِم مِّنْ آيَةٍ مِّنْ آيَاتِ رَبِّهِمْ إِلَّا كَانُوا عَنْهَا مُعْرِضِينَ","translations":[{"language_name":"indonesian","text":"Dan setiap kali suatu tanda dari tanda-tanda (kebesaran) Tuhan datang kepada mereka, mereka selalu berpaling darinya."},{"language_name":"english","text":"And no sign comes to them from the signs of their Lord except that they are from it turning away."}],"verse_number":46},{"chapter_id":36,"juz_number":23,"text_madani":"وَإِذَا قِيلَ لَهُمْ أَنفِقُوا مِمَّا رَزَقَكُمُ اللَّهُ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَنُطْعِمُ مَن لَّوْ يَشَاءُ اللَّهُ أَطْعَمَهُ إِنْ أَنتُمْ إِلَّا فِي ضَلَالٍ مُّبِينٍ","translations":[{"language_name":"english","text":"And when it is said to them, \"Spend from that which Allah has provided for you,\" those who disbelieve say to those who believe, \"Should we feed one whom, if Allah had willed, He would have fed? You are not but in clear error.\""},{"language_name":"indonesian","text":"Dan apabila dikatakan kepada mereka, “Infakkanlah sebagian rezeki yang diberikan Allah kepadamu,” orang-orang yang kafir itu berkata kepada orang-orang yang beriman, “Apakah pantas kami memberi makan kepada orang-orang yang jika Allah menghendaki Dia akan memberinya makan? Kamu benar-benar dalam kesesatan yang nyata.”"}],"verse_number":47},{"chapter_id":36,"juz_number":23,"text_madani":"وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ","translations":[{"language_name":"indonesian","text":"Dan mereka (orang-orang kafir) berkata, “Kapan janji (hari berbangkit) itu (terjadi) jika kamu orang yang benar?”"},{"language_name":"english","text":"And they say, \"When is this promise, if you should be truthful?\""}],"verse_number":48},{"chapter_id":36,"juz_number":23,"text_madani":"مَا يَنظُرُونَ إِلَّا صَيْحَةً وَاحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ","translations":[{"language_name":"english","text":"They do not await except one blast which will seize them while they are disputing."},{"language_name":"indonesian","text":"Mereka hanya menunggu satu teriakan, yang akan membinasakan mereka ketika mereka sedang bertengkar."}],"verse_number":49},{"chapter_id":36,"juz_number":23,"text_madani":"فَلَا يَسْتَطِيعُونَ تَوْصِيَةً وَلَا إِلَىٰ أَهْلِهِمْ يَرْجِعُونَ","translations":[{"language_name":"indonesian","text":"Sehingga mereka tidak mampu membuat suatu wasiat dan mereka (juga) tidak dapat kembali kepada keluarganya."},{"language_name":"english","text":"And they will not be able [to give] any instruction, nor to their people can they return."}],"verse_number":50},{"chapter_id":36,"juz_number":23,"text_madani":"وَنُفِخَ فِي الصُّورِ فَإِذَا هُم مِّنَ الْأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنسِلُونَ","translations":[{"language_name":"english","text":"And the Horn will be blown; and at once from the graves to their Lord they will hasten."},{"language_name":"indonesian","text":"Lalu ditiuplah sangkakala, maka seketika itu mereka keluar dari kuburnya (dalam keadaan hidup), menuju kepada Tuhannya."}],"verse_number":51},{"chapter_id":36,"juz_number":23,"text_madani":"قَالُوا يَا وَيْلَنَا مَن بَعَثَنَا مِن مَّرْقَدِنَا ۜ ۗ هَٰذَا مَا وَعَدَ الرَّحْمَٰنُ وَصَدَقَ الْمُرْسَلُونَ","translations":[{"language_name":"indonesian","text":"Mereka berkata, “Celakalah kami! Siapakah yang membangkitkan kami dari tempat tidur kami (kubur)?” Inilah yang dijanjikan (Allah) Yang Maha Pengasih dan benarlah rasul-rasul(-Nya)."},{"language_name":"english","text":"They will say, \"O woe to us! Who has raised us up from our sleeping place?\" [The reply will be], \"This is what the Most Merciful had promised, and the messengers told the truth.\""}],"verse_number":52},{"chapter_id":36,"juz_number":23,"text_madani":"إِن كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ","translations":[{"language_name":"indonesian","text":"Teriakan itu hanya sekali saja, maka seketika itu mereka semua dihadapkan kepada Kami (untuk dihisab)."},{"language_name":"english","text":"It will not be but one blast, and at once they are all brought present before Us."}],"verse_number":53},{"chapter_id":36,"juz_number":23,"text_madani":"فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَلَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ","translations":[{"language_name":"english","text":"So today no soul will be wronged at all, and you will not be recompensed except for what you used to do."},{"language_name":"indonesian","text":"Maka pada hari itu seseorang tidak akan dirugikan sedikit pun dan kamu tidak akan diberi balasan, kecuali sesuai dengan apa yang telah kamu kerjakan."}],"verse_number":54},{"chapter_id":36,"juz_number":23,"text_madani":"إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ","translations":[{"language_name":"indonesian","text":"Sesungguhnya penghuni surga pada hari itu bersenang-senang dalam kesibukan (mereka)."},{"language_name":"english","text":"Indeed the companions of Paradise, that Day, will be amused in [joyful] occupation -"}],"verse_number":55},{"chapter_id":36,"juz_number":23,"text_madani":"هُمْ وَأَزْوَاجُهُمْ فِي ظِلَالٍ عَلَى الْأَرَائِكِ مُتَّكِئُونَ","translations":[{"language_name":"english","text":"They and their spouses -  in shade, reclining on adorned couches."},{"language_name":"indonesian","text":"Mereka dan pasangan-pasangannya berada dalam tempat yang teduh, bersandar di atas dipan-dipan."}],"verse_number":56},{"chapter_id":36,"juz_number":23,"text_madani":"لَهُمْ فِيهَا فَاكِهَةٌ وَلَهُم مَّا يَدَّعُونَ","translations":[{"language_name":"indonesian","text":"Di surga itu mereka memperoleh buah-buahan dan memperoleh apa saja yang mereka inginkan."},{"language_name":"english","text":"For them therein is fruit, and for them is whatever they request [or wish]"}],"verse_number":57},{"chapter_id":36,"juz_number":23,"text_madani":"سَلَامٌ قَوْلًا مِّن رَّبٍّ رَّحِيمٍ","translations":[{"language_name":"english","text":"[And] \"Peace,\" a word from a Merciful Lord."},{"language_name":"indonesian","text":"(Kepada mereka dikatakan), “Salam,” sebagai ucapan selamat dari Tuhan Yang Maha Penyayang."}],"verse_number":58},{"chapter_id":36,"juz_number":23,"text_madani":"وَامْتَازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ","translations":[{"language_name":"indonesian","text":"Dan (dikatakan kepada orang-orang kafir), “Berpisahlah kamu (dari orang-orang mukmin) pada hari ini, wahai orang-orang yang berdosa!"},{"language_name":"english","text":"[Then He will say], \"But stand apart today, you criminals."}],"verse_number":59},{"chapter_id":36,"juz_number":23,"text_madani":"أَلَمْ أَعْهَدْ إِلَيْكُمْ يَا بَنِي آدَمَ أَن لَّا تَعْبُدُوا الشَّيْطَانَ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ","translations":[{"language_name":"indonesian","text":"Bukankah Aku telah memerintahkan kepadamu wahai anak cucu Adam agar kamu tidak menyembah setan? Sungguh, setan itu musuh yang nyata bagi kamu,"},{"language_name":"english","text":"Did I not enjoin upon you, O children of Adam, that you not worship Satan -  [for] indeed, he is to you a clear enemy -"}],"verse_number":60},{"chapter_id":36,"juz_number":23,"text_madani":"وَأَنِ اعْبُدُونِي ۚ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ","translations":[{"language_name":"english","text":"And that you worship [only] Me?  This is a straight path."},{"language_name":"indonesian","text":"dan hendaklah kamu menyembah-Ku. Inilah jalan yang lurus.”"}],"verse_number":61},{"chapter_id":36,"juz_number":23,"text_madani":"وَلَقَدْ أَضَلَّ مِنكُمْ جِبِلًّا كَثِيرًا ۖ أَفَلَمْ تَكُونُوا تَعْقِلُونَ","translations":[{"language_name":"english","text":"And he had already led astray from among you much of creation, so did you not use reason?"},{"language_name":"indonesian","text":"Dan sungguh, ia (setan itu) telah menyesatkan sebagian besar di antara kamu. Maka apakah kamu tidak mengerti?"}],"verse_number":62},{"chapter_id":36,"juz_number":23,"text_madani":"هَٰذِهِ جَهَنَّمُ الَّتِي كُنتُمْ تُوعَدُونَ","translations":[{"language_name":"indonesian","text":"Inilah (neraka) Jahanam yang dahulu telah diperingatkan kepadamu."},{"language_name":"english","text":"This is the Hellfire which you were promised."}],"verse_number":63},{"chapter_id":36,"juz_number":23,"text_madani":"اصْلَوْهَا الْيَوْمَ بِمَا كُنتُمْ تَكْفُرُونَ","translations":[{"language_name":"indonesian","text":"Masuklah ke dalamnya pada hari ini karena dahulu kamu mengingkarinya."},{"language_name":"english","text":"[Enter to] burn therein today for what you used to deny.\""}],"verse_number":64},{"chapter_id":36,"juz_number":23,"text_madani":"الْيَوْمَ نَخْتِمُ عَلَىٰ أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُم بِمَا كَانُوا يَكْسِبُونَ","translations":[{"language_name":"english","text":"That Day, We will seal over their mouths, and their hands will speak to Us, and their feet will testify about what they used to earn."},{"language_name":"indonesian","text":"Pada hari ini Kami tutup mulut mereka; tangan mereka akan berkata kepada Kami dan kaki mereka akan memberi kesaksian terhadap apa yang dahulu mereka kerjakan."}],"verse_number":65},{"chapter_id":36,"juz_number":23,"text_madani":"وَلَوْ نَشَاءُ لَطَمَسْنَا عَلَىٰ أَعْيُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَأَنَّىٰ يُبْصِرُونَ","translations":[{"language_name":"indonesian","text":"Dan jika Kami menghendaki, pastilah Kami hapuskan penglihatan mata mereka; sehingga mereka berlomba-lomba (mencari) jalan. Maka bagaimana mungkin mereka dapat melihat?"},{"language_name":"english","text":"And if We willed, We could have obliterated their eyes, and they would race to [find] the path, and how could they see?"}],"verse_number":66},{"chapter_id":36,"juz_number":23,"text_madani":"وَلَوْ نَشَاءُ لَمَسَخْنَاهُمْ عَلَىٰ مَكَانَتِهِمْ فَمَا اسْتَطَاعُوا مُضِيًّا وَلَا يَرْجِعُونَ","translations":[{"language_name":"indonesian","text":"Dan jika Kami menghendaki, pastilah Kami ubah bentuk mereka di tempat mereka berada; sehingga mereka tidak sanggup berjalan lagi dan juga tidak sanggup kembali."},{"language_name":"english","text":"And if We willed, We could have deformed them, [paralyzing them] in their places so they would not be able to proceed, nor could they return."}],"verse_number":67},{"chapter_id":36,"juz_number":23,"text_madani":"وَمَن نُّعَمِّرْهُ نُنَكِّسْهُ فِي الْخَلْقِ ۖ أَفَلَا يَعْقِلُونَ","translations":[{"language_name":"indonesian","text":"Dan barangsiapa Kami panjangkan umurnya niscaya Kami kembalikan dia kepada awal kejadian(nya). Maka mengapa mereka tidak mengerti?"},{"language_name":"english","text":"And he to whom We grant long life We reverse in creation; so will they not understand?"}],"verse_number":68},{"chapter_id":36,"juz_number":23,"text_madani":"وَمَا عَلَّمْنَاهُ الشِّعْرَ وَمَا يَنبَغِي لَهُ ۚ إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْآنٌ مُّبِينٌ","translations":[{"language_name":"english","text":"And We did not give Prophet Muhammad, knowledge of poetry, nor is it befitting for him.  It is not but a message and a clear Qur\u0027an"},{"language_name":"indonesian","text":"Dan Kami tidak mengajarkan syair kepadanya (Muhammad) dan bersyair itu tidaklah pantas baginya. Al-Qur\u0027an itu tidak lain hanyalah pelajaran dan Kitab yang jelas,"}],"verse_number":69},{"chapter_id":36,"juz_number":23,"text_madani":"لِّيُنذِرَ مَن كَانَ حَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكَافِرِينَ","translations":[{"language_name":"indonesian","text":"agar dia (Muhammad) memberi peringatan kepada orang-orang yang hidup (hatinya) dan agar pasti ketetapan (azab) terhadap orang-orang kafir."},{"language_name":"english","text":"To warn whoever is alive and justify the word against the disbelievers."}],"verse_number":70},{"chapter_id":36,"juz_number":23,"text_madani":"أَوَلَمْ يَرَوْا أَنَّا خَلَقْنَا لَهُم مِّمَّا عَمِلَتْ أَيْدِينَا أَنْعَامًا فَهُمْ لَهَا مَالِكُونَ","translations":[{"language_name":"indonesian","text":"Dan tidakkah mereka melihat bahwa Kami telah menciptakan hewan ternak untuk mereka, yaitu sebagian dari apa yang telah Kami ciptakan dengan kekuasaan Kami, lalu mereka menguasainya?"},{"language_name":"english","text":"Do they not see that We have created for them from what Our hands have made, grazing livestock, and [then] they are their owners?"}],"verse_number":71},{"chapter_id":36,"juz_number":23,"text_madani":"وَذَلَّلْنَاهَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُلُونَ","translations":[{"language_name":"english","text":"And We have tamed them for them, so some of them they ride, and some of them they eat."},{"language_name":"indonesian","text":"Dan Kami menundukkannya (hewan-hewan itu) untuk mereka; lalu sebagiannya untuk menjadi tunggangan mereka dan sebagian untuk mereka makan."}],"verse_number":72},{"chapter_id":36,"juz_number":23,"text_madani":"وَلَهُمْ فِيهَا مَنَافِعُ وَمَشَارِبُ ۖ أَفَلَا يَشْكُرُونَ","translations":[{"language_name":"indonesian","text":"Dan mereka memperoleh berbagai manfaat dan minuman darinya. Maka mengapa mereka tidak bersyukur?"},{"language_name":"english","text":"And for them therein are [other] benefits and drinks, so will they not be grateful?"}],"verse_number":73},{"chapter_id":36,"juz_number":23,"text_madani":"وَاتَّخَذُوا مِن دُونِ اللَّهِ آلِهَةً لَّعَلَّهُمْ يُنصَرُونَ","translations":[{"language_name":"english","text":"But they have taken besides Allah [false] deities that perhaps they would be helped."},{"language_name":"indonesian","text":"Dan mereka mengambil sesembahan selain Allah agar mereka mendapat pertolongan."}],"verse_number":74},{"chapter_id":36,"juz_number":23,"text_madani":"لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُندٌ مُّحْضَرُونَ","translations":[{"language_name":"indonesian","text":"Mereka (sesembahan) itu tidak dapat menolong mereka; padahal mereka itu menjadi tentara yang disiapkan untuk menjaga (sesembahan) itu."},{"language_name":"english","text":"They are not able to help them, and they [themselves] are for them soldiers in attendance."}],"verse_number":75},{"chapter_id":36,"juz_number":23,"text_madani":"فَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ","translations":[{"language_name":"english","text":"So let not their speech grieve you. Indeed, We know what they conceal and what they declare."},{"language_name":"indonesian","text":"Maka jangan sampai ucapan mereka membuat engkau (Muhammad) bersedih hati. Sungguh, Kami mengetahui apa yang mereka rahasiakan dan apa yang mereka nyatakan."}],"verse_number":76},{"chapter_id":36,"juz_number":23,"text_madani":"أَوَلَمْ يَرَ الْإِنسَانُ أَنَّا خَلَقْنَاهُ مِن نُّطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُّبِينٌ","translations":[{"language_name":"indonesian","text":"Dan tidakkah manusia memperhatikan bahwa Kami menciptakannya dari setetes mani, ternyata dia menjadi musuh yang nyata!"},{"language_name":"english","text":"Does man not consider that We created him from a [mere] sperm-drop -  then at once he is a clear adversary?"}],"verse_number":77},{"chapter_id":36,"juz_number":23,"text_madani":"وَضَرَبَ لَنَا مَثَلًا وَنَسِيَ خَلْقَهُ ۖ قَالَ مَن يُحْيِي الْعِظَامَ وَهِيَ رَمِيمٌ","translations":[{"language_name":"english","text":"And he presents for Us an example and forgets his [own] creation.  He says, \"Who will give life to bones while they are disintegrated?\""},{"language_name":"indonesian","text":"Dan dia membuat perumpamaan bagi Kami dan melupakan asal kejadiannya; dia berkata, “Siapakah yang dapat menghidupkan tulang-belulang, yang telah hancur luluh?”"}],"verse_number":78},{"chapter_id":36,"juz_number":23,"text_madani":"قُلْ يُحْيِيهَا الَّذِي أَنشَأَهَا أَوَّلَ مَرَّةٍ ۖ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ","translations":[{"language_name":"english","text":"Say, \"He will give them life who produced them the first time; and He is, of all creation, Knowing.\""},{"language_name":"indonesian","text":"Katakanlah (Muhammad), “Yang akan menghidupkannya ialah (Allah) yang menciptakannya pertama kali. Dan Dia Maha Mengetahui tentang segala makhluk,"}],"verse_number":79},{"chapter_id":36,"juz_number":23,"text_madani":"الَّذِي جَعَلَ لَكُم مِّنَ الشَّجَرِ الْأَخْضَرِ نَارًا فَإِذَا أَنتُم مِّنْهُ تُوقِدُونَ","translations":[{"language_name":"english","text":"[It is] He who made for you from the green tree, fire, and then from it you ignite."},{"language_name":"indonesian","text":"yaitu (Allah) yang menjadikan api untukmu dari kayu yang hijau, maka seketika itu kamu nyalakan (api) dari kayu itu.”"}],"verse_number":80},{"chapter_id":36,"juz_number":23,"text_madani":"أَوَلَيْسَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِقَادِرٍ عَلَىٰ أَن يَخْلُقَ مِثْلَهُم ۚ بَلَىٰ وَهُوَ الْخَلَّاقُ الْعَلِيمُ","translations":[{"language_name":"indonesian","text":"Dan bukankah (Allah) yang menciptakan langit dan bumi, mampu menciptakan kembali yang serupa itu (jasad mereka yang sudah hancur itu)? Benar, dan Dia Maha Pencipta, Maha Mengetahui."},{"language_name":"english","text":"Is not He who created the heavens and the earth Able to create the likes of them?  Yes, [it is so]; and He is the Knowing Creator."}],"verse_number":81},{"chapter_id":36,"juz_number":23,"text_madani":"إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَن يَقُولَ لَهُ كُن فَيَكُونُ","translations":[{"language_name":"english","text":"His command is only when He intends a thing that He says to it, \"Be,\" and it is."},{"language_name":"indonesian","text":"Sesungguhnya urusan-Nya apabila Dia menghendaki sesuatu Dia hanya berkata kepadanya, “Jadilah!” Maka jadilah sesuatu itu."}],"verse_number":82},{"chapter_id":36,"juz_number":23,"text_madani":"فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ","translations":[{"language_name":"indonesian","text":"Maka Mahasuci (Allah) yang di tangan-Nya kekuasaan atas segala sesuatu dan kepada-Nya kamu dikembalikan."},{"language_name":"english","text":"So exalted is He in whose hand is the realm of all things, and to Him you will be returned."}],"verse_number":83}]